{
"categories": [
{
"id": "all",
"name": "All News",
"active": true
},
{
"id": "artificial-intelligence-and-technology",
"name": "Artificial Intelligence & Technology",
"active": false
},
{
"id": "science-and-space-exploration",
"name": "Science & Space Exploration",
"active": false
},
{
"id": "digital-media-and-gaming",
"name": "Digital Media & Gaming",
"active": false
},
{
"id": "ancient-history-and-archaeology",
"name": "Ancient History & Archaeology",
"active": false
},
{
"id": "perth-local-services-and-lifestyle",
"name": "Perth Local Services & Lifestyle",
"active": false
}
],
"trending": [
{
"articleId": "a2",
"reason": "Anthropic announces first India office — major expansion in an increasingly competitive global AI market."
},
{
"articleId": "a1",
"reason": "Google previews Gemini 2.5 'computer use' model that can operate inside web browsers — potential step change for agentic web automation."
},
{
"articleId": "a3",
"reason": "James Webb finds a moon-forming disc around a giant exoplanet — new direct measurements with broad scientific interest."
}
],
"articles": [
{
"id": "a1",
"category": "artificial-intelligence-and-technology",
"title": "Google previews Gemini 2.5 model that can ‘use’ a web browser to perform tasks",
"excerpt": "Gemini 2.5 Computer Use can interact with websites via a browser, enabling agent-style automation for web-only interfaces.",
"image": "",
"imageModal": "",
"author": "Emma Roth / The Verge",
"date": "Oct 8, 2025",
"readTime": "3 min read",
"sourceUrl": "[https://www.theverge.com/news/795463/google-computer-use-gemini-ai-model-agents](https://www.theverge.com/news/795463/google-computer-use-gemini-ai-model-agents)",
"isTrending": true,
"fullContent": [
"Google has previewed Gemini 2.5 Computer Use, a version of its Gemini model designed to interact with websites through a browser and perform tasks on web interfaces.",
"The model uses visual understanding and reasoning to carry out actions such as typing, dragging and filling forms, enabling automation where services lack direct APIs or developer access.",
"Google positions the capability as a specialised browser-level agent rather than a full OS-level controller; it currently supports a defined set of actions and is available to developers via Google AI Studio and Vertex AI.",
"Demo examples show the model completing multi-step tasks and UI testing faster than previous approaches, while Google highlights benchmark gains on web and mobile tests.",
"The preview follows similar agentic moves from other labs and signals further competition in practical automation — developers and product teams will assess security, privacy and reliability as adoption grows."
]
},
{
"id": "a2",
"category": "artificial-intelligence-and-technology",
"title": "Anthropic to open first India office in Bengaluru in early 2026",
"excerpt": "Anthropic will open its first India office, citing strong demand for Claude and plans to grow international operations.",
"image": "",
"imageModal": "",
"author": "Mrinmay Dey / Reuters",
"date": "Oct 7, 2025",
"readTime": "2 min read",
"sourceUrl": "[https://www.reuters.com/business/retail-consumer/anthropic-open-india-office-2026-2025-10-08/](https://www.reuters.com/business/retail-consumer/anthropic-open-india-office-2026-2025-10-08/)",
"isTrending": true,
"fullContent": [
"Anthropic announced it will open its first office in India, selecting Bengaluru for an early-2026 launch to support growing demand for its Claude models.",
"The company said India is now its second-largest market and plans to expand international staffing to meet rising enterprise and developer interest.",
"Anthropic’s move follows increased competition in India from other major AI providers and reflects a broader strategy to localise operations and partner with regional customers.",
"The company noted the office will enable closer collaboration with local enterprises and help tailor Claude’s offerings to Indian workflows and pricing requirements.",
"Analysts say the expansion underscores India’s strategic importance in global AI deployment and intensifies competition for talent and market share in the region."
]
},
{
"id": "a3",
"category": "science-and-space-exploration",
"title": "James Webb finds a carbon-rich moon-forming disc around a giant exoplanet",
"excerpt": "JWST has directly measured the properties of a circumplanetary disc around CT Cha b, a candidate moon-forming region.",
"image": "",
"imageModal": "",
"author": "ESA / NASA science teams",
"date": "Sep 29, 2025",
"readTime": "4 min read",
"sourceUrl": "[https://esawebb.org/news/archive/year/2025/](https://esawebb.org/news/archive/year/2025/)",
"isTrending": true,
"fullContent": [
"The James Webb Space Telescope has measured a carbon-rich circumplanetary disc around the exoplanet CT Cha b, indicating a possible site for moon formation.",
"Spectroscopic data captured by Webb’s instruments reveal specific molecules and physical conditions consistent with a dusty, gas-rich ring surrounding the massive planet.",
"Scientists emphasise that while the disc matches theoretical expectations for moon-forming environments, no moons have been directly detected in the data so far.",
"The observation provides direct constraints on the chemistry and dynamics of circumplanetary material and offers a new laboratory to test models of satellite formation.",
"Researchers expect follow-up observations and modelling to clarify how commonly such discs occur and what they imply for the diversity of moon systems in the galaxy."
]
},
{
"id": "a4",
"category": "science-and-space-exploration",
"title": "JWST data may contain signatures of exotic early Universe objects, researchers report",
"excerpt": "Analyses of JWST observations suggest unexpected spectral signatures that could indicate unusual early-Universe objects.",
"image": "",
"imageModal": "",
"author": "EurekAlert / Research Teams",
"date": "Oct 3, 2025",
"readTime": "4 min read",
"sourceUrl": "[https://www.eurekalert.org/news-releases/1100359](https://www.eurekalert.org/news-releases/1100359)",
"isTrending": false,
"fullContent": [
"New analyses of James Webb Telescope data have flagged unusual spectral features that some researchers interpret as possible signatures of exotic early-Universe objects.",
"The findings highlight objects whose light does not match standard stellar population models, prompting proposals that some early luminous sources may differ markedly from ordinary stars.",
"Authors caution that alternative explanations, including dust effects or data processing artefacts, remain plausible and require additional observations to confirm.",
"If verified, the signatures could change understanding of the first luminous sources and their role in reionisation, but the community emphasises rigorous follow-up to avoid premature conclusions.",
"Ongoing JWST programmes and independent analyses will test these claims and aim to resolve whether the signals represent new physics or observational complexities."
]
},
{
"id": "a5",
"category": "artificial-intelligence-and-technology",
"title": "Analysis: China’s rapid rollout of on-site learning robots pressures Western cautious approaches",
"excerpt": "Reports show China scaling learn-on-the-job robots while Western deployments remain more cautious and regulated.",
"image": "",
"imageModal": "",
"author": "Viviantoh / Forbes",
"date": "Sep 26, 2025",
"readTime": "5 min read",
"sourceUrl": "[https://www.forbes.com/sites/viviantoh/2025/09/26/chinas-android-for-robots-and-the-race-for-embodied-ai-supremacy/](https://www.forbes.com/sites/viviantoh/2025/09/26/chinas-android-for-robots-and-the-race-for-embodied-ai-supremacy/)",
"isTrending": false,
"fullContent": [
"Forbes reports that Chinese manufacturers and integrators are rapidly deploying learning-capable robots for commercial tasks, outpacing more cautious Western rollouts.",
"The article compares philosophies: China’s aggressive field-testing and scale versus Western emphasis on safety, regulation and measured deployment.",
"Proponents say large-scale deployments accelerate practical improvements through real-world training, while critics warn of safety and labour impacts without robust oversight.",
"The piece surveys several firms and projects and highlights how competition in embodied AI is driving innovation in both hardware and agent software.",
"Observers recommend clearer regulation and international collaboration to ensure safety, while recognising that competition may yield faster technical progress."
]
},
{
"id": "a6",
"category": "perth-local-services-and-lifestyle",
"title": "Perth job listings remain active as SEEK shows hundreds of local vacancies",
"excerpt": "SEEK lists thousands of roles across Perth, signalling continued hiring across sectors including IT and design.",
"image": "",
"imageModal": "",
"author": "SEEK listings",
"date": "Oct 8, 2025",
"readTime": "2 min read",
"sourceUrl": "[https://www.seek.com.au/perth-seek-jobs/in-All-Perth-WA](https://www.seek.com.au/perth-seek-jobs/in-All-Perth-WA)",
"isTrending": false,
"fullContent": [
"SEEK’s Perth pages show hundreds of active job listings across Western Australia, with roles spanning IT, design, trades and services.",
"Local demand reflects ongoing infrastructure and resources projects, and employers continue to advertise for skilled and entry-level roles.",
"Job-seekers are advised to use tailored alerts and to update profiles to match employer preferences for immediate visibility.",
"Training providers and TAFE courses remain an option for candidates seeking upskilling in areas such as digital design, 3D visualisation and IT.",
"Recruitment trends suggest employers are prioritising candidates with practical experience or demonstrable project portfolios."
]
},
{
"id": "a7",
"category": "perth-local-services-and-lifestyle",
"title": "Perth market snapshot: listings tighten while sales remain steady",
"excerpt": "Weekly market data shows fewer listings and relatively steady sales in Perth as local demand persists.",
"image": "",
"imageModal": "",
"author": "Mirage News / REIWA data",
"date": "Oct 5, 2025",
"readTime": "2 min read",
"sourceUrl": "[https://www.miragenews.com/perth-weekly-market-snapshot-for-week-ending-5-1546630/](https://www.miragenews.com/perth-weekly-market-snapshot-for-week-ending-5-1546630/)",
"isTrending": false,
"fullContent": [
"Local market data for the week ending 5 October 2025 shows listings tightening while sales volumes remain broadly steady.",
"REIWA members reported a decline in active listings compared with the previous week, which analysts say supports price stability in many suburbs.",
"Experts note that reduced new listings and continued demand are influencing competition for quality properties across metropolitan Perth.",
"For renters and buyers, the report recommends closely monitoring suburb-specific vacancy trends and engaging agents early in search processes.",
"Policy or economic changes could shift dynamics; market participants are watching affordability and supply indicators for signs of change."
]
}
],
"videos": [
{
"id": "v1",
"category": "artificial-intelligence-and-technology",
"title": "Gemini 2.5: Make your own interactive demo",
"excerpt": "Google DeepMind demonstrates Gemini 2.5 Pro creating an interactive demo using reasoning capabilities.",
"thumbnail": "[https://img.youtube.com/vi/_CU0PkLNtwc/maxresdefault.jpg](https://img.youtube.com/vi/_CU0PkLNtwc/maxresdefault.jpg)",
"videoUrl": "[https://www.youtube.com/watch?v=_CU0PkLNtwc](https://www.youtube.com/watch?v=_CU0PkLNtwc)",
"channel": "Google DeepMind",
"publishDate": "Aug 01, 2025",
"duration": "03:47"
},
{
"id": "v2",
"category": "science-and-space-exploration",
"title": "Webb Telescope Observes Moon-Forming Disk Around Exoplanet",
"excerpt": "Short explainer and visuals showing JWST observations of a circumplanetary disc around CT Cha b.",
"thumbnail": "[https://img.youtube.com/vi/zQUuI6nTcM4/maxresdefault.jpg](https://img.youtube.com/vi/zQUuI6nTcM4/maxresdefault.jpg)",
"videoUrl": "[https://www.youtube.com/watch?v=zQUuI6nTcM4](https://www.youtube.com/watch?v=zQUuI6nTcM4)",
"channel": "Beyond Headlines",
"publishDate": "Sep 30, 2025",
"duration": "01:12"
},
{
"id": "v3",
"category": "artificial-intelligence-and-technology",
"title": "Anthropic's First India Developer Event in Bengaluru",
"excerpt": "Clip outlining Anthropic’s planned developer event and India expansion plans.",
"thumbnail": "[https://img.youtube.com/vi/EWjoIeOgKkM/maxresdefault.jpg](https://img.youtube.com/vi/EWjoIeOgKkM/maxresdefault.jpg)",
"videoUrl": "[https://www.youtube.com/watch?v=EWjoIeOgKkM](https://www.youtube.com/watch?v=EWjoIeOgKkM)",
"channel": "AI News Clips",
"publishDate": "Oct 06, 2025",
"duration": "02:05"
}
]
}
