 
{
  "categories": [
    {
      "id": "all",
      "name": "All",
      "active": true
    },
    {
      "id": "ai-technology",
      "name": "AI Technology",
      "active": false
    },
    {
      "id": "quantum-physics",
      "name": "Quantum Physics",
      "active": false
    },
    {
      "id": "environmental-science",
      "name": "Environmental Science",
      "active": false
    },
    {
      "id": "gaming",
      "name": "Gaming",
      "active": false
    },
    {
      "id": "entertainment",
      "name": "Entertainment",
      "active": false
    },
    {
      "id": "local-news",
      "name": "Local News",
      "active": false
    },
    {
      "id": "jobs",
      "name": "Jobs",
      "active": false
    },
    {
      "id": "particle-physics",
      "name": "Particle Physics",
      "active": false
    }
  ],
  "trending": [
    {
      "articleId": "daily-ai-agent-news-oct-19-2025",
      "reason": "Breaking developments in enterprise AI agents and platforms."
    },
    {
      "articleId": "entertainment-news-oct-19-2025",
      "reason": "Latest updates in movies, TV, and pop culture."
    },
    {
      "articleId": "wa-today-news-oct-19-2025",
      "reason": "Top headlines and breaking news for Perth & Western Australia."
    },
    {
      "articleId": "unreal-engine-jobs-perth-oct-18-2025",
      "reason": "High demand for Unreal Engine developers in the Perth job market."
    }
  ],
  "articles": [
    {
      "id": "daily-ai-agent-news-oct-19-2025",
      "category": "AI technology innovations, AI news, AI in games",
      "title": "Daily AI Agent News - Last 7 Days",
      "excerpt": "A digest of news and developments in the world of AI agents, covering new platforms, enterprise adoption, and market trends.",
      "bannerImage": "https://images.pexels.com/photos/8386440/pexels-photo-8386440.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
      "thumbnailImage": "https://images.pexels.com/photos/8386440/pexels-photo-8386440.jpeg?auto=compress&cs=tinysrgb&w=400&h=300&dpr=2",
      "author": "Various Sources",
      "date": "Oct 19, 2025",
      "readTime": "4 min",
      "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQH7cW0vMI5hA3rh_kYRVqQV7BH_LMc6nIe6xmR1LSoHE2jN-nJc2ThExzXrNqsyiG5YO86mwj-uxnneUx9rCUdktDtbh2B3H49kPoBhFi2qpoF2GpBcvIevdJub52eEGxCG4idxyBPqO9c2wW-G6k5zSPiQ7Wq51pHYXZz7SyaCW2Avtt3LE6zWPH7Js9cFX4w5HJoYRU9mS_aoY_UlBEozsI5LaIz_G5Oq",
      "isTrending": true,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<div class=\"article-hero\"><img src=\"https://images.pexels.com/photos/8386440/pexels-photo-8386440.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2\" alt=\"Abstract AI representation\" style=\"width:100%;\"></div><p class=\"lead-paragraph\">October 2025 has marked a pivotal moment for Artificial Intelligence, as AI 'agents' transitioned from experimental projects to robust enterprise-grade software. In a flurry of announcements, major tech companies including Microsoft, OpenAI, Google, and AWS launched platforms and frameworks that allow businesses to build, deploy, and manage AI agents at scale, signalling a significant shift in how companies can automate complex workflows and interact with customers.</p><h2>The Enterprise Shift</h2><p>The core development this week is the move towards making agentic AI a commercially viable product rather than a developer's side project. IBM, in partnership with Oracle, released new AI agents on the Oracle Fusion Applications AI Agent Marketplace designed to automate specific enterprise tasks in areas like sales order entry and contract management. According to Kaushal Kurapati of Oracle, these tools help customers “drive growth with speed and confidence” by addressing unique business needs. Similarly, OpenAI launched AgentKit, a comprehensive toolkit for developers that includes a visual builder and other components to streamline the creation and deployment of agents.</p><div class=\"pullquote\">“October 2025 will be remembered as the month AI agents stopped being side projects and became enterprise software.”</div><h2>Impact on Industries</h2><p>The application of these new AI agents is already being seen across various sectors. In banking, AI agents are delivering 24/7 customer support, handling high-volume repetitive tasks and freeing up human agents to focus on more complex issues. This allows banks to meet the modern customer's demand for always-on service without increasing operational costs. In the retail sector, a major partnership between OpenAI and Walmart now allows shoppers to purchase products directly within ChatGPT, transforming the chatbot into a conversational commerce platform.</p><h3>Key Takeaways</h3><ul class=\"key-points\"><li>Major tech companies like Google, AWS, OpenAI, and IBM have launched enterprise-ready AI agent platforms.</li><li>These platforms provide tools to visually design, deploy, and manage AI agents for business workflows.</li><li>Industries like banking and retail are already using AI agents to enhance customer support and enable conversational commerce.</li><li>The new tools aim to streamline development, allowing companies to move from proof-of-concept to production-level AI applications.</li></ul>"
    },
    {
      "id": "wa-today-news-oct-19-2025",
      "category": "Perth, Western Australia News",
      "title": "WA Today - Latest & Breaking News Perth & WA",
      "excerpt": "Breaking news from Perth and Western Australia, plus national and world news. Includes sport, business, entertainment, lifestyle and travel news.",
      "bannerImage": "https://images.pexels.com/photos/1940034/pexels-photo-1940034.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
      "thumbnailImage": "https://images.pexels.com/photos/1940034/pexels-photo-1940034.jpeg?auto=compress&cs=tinysrgb&w=400&h=300&dpr=2",
      "author": "WA Today",
      "date": "Oct 19, 2025",
      "readTime": "1 min",
      "sourceUrl": "https://www.watoday.com.au/",
      "isTrending": true,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<div class=\"article-hero\"><img src=\"https://images.pexels.com/photos/1940034/pexels-photo-1940034.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2\" alt=\"Perth city skyline with the Swan River\" style=\"width:100%;\"></div><p class=\"lead-paragraph\">Stay informed with the latest breaking news and headlines from Perth and across Western Australia. WA Today provides comprehensive coverage of local events, politics, business, and community stories.</p><h2>Top Stories</h2><p>WA Today delivers up-to-the-minute reports on significant developments impacting the state. The publication covers everything from governmental policy changes and economic updates to major infrastructure projects and local council decisions. It serves as a primary source of information for residents looking to understand the forces shaping their local environment.</p><h3>Community and Lifestyle</h3><p>Beyond the major headlines, find in-depth stories on lifestyle, arts, and culture within Western Australia. Coverage includes reviews of new restaurants, guides to local events, and features on prominent personalities in the Perth community. The sport section provides detailed analysis and scores for local and national teams, ensuring fans are always up to date.</p><div class=\"highlight-box info-box\">This feed is a dynamic source for the latest news. Content is continuously updated to reflect the most current events in Perth, Western Australia, and around the world. For the very latest, please refer to the source website.</div><h3>Key Takeaways</h3><ul class=\"key-points\"><li>Provides breaking news coverage for Perth and Western Australia.</li><li>Features national and international news headlines.</li><li>Includes dedicated sections for sport, business, entertainment, and lifestyle.</li><li>Acts as a vital source of information for the local community.</li></ul>"
    },
    {
      "id": "entertainment-news-oct-19-2025",
      "category": "TV Movies and Entertainment news",
      "title": "Entertainment News, Photos and Videos - GamesRadar+",
      "excerpt": "Get the latest entertainment news, photos, and videos from GamesRadar+, covering movies, TV shows, and video games.",
      "bannerImage": "https://images.pexels.com/photos/7991579/pexels-photo-7991579.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
      "thumbnailImage": "https://images.pexels.com/photos/7991579/pexels-photo-7991579.jpeg?auto=compress&cs=tinysrgb&w=400&h=300&dpr=2",
      "author": "GamesRadar+",
      "date": "Oct 19, 2025",
      "readTime": "2 min",
      "sourceUrl": "https://www.gamesradar.com/au/entertainment/",
      "isTrending": true,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<div class=\"article-hero\"><img src=\"https://images.pexels.com/photos/7991579/pexels-photo-7991579.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2\" alt=\"A collection of movie and entertainment icons\" style=\"width:100%;\"></div><p class=\"lead-paragraph\">The latest entertainment news cycle features updates on highly anticipated movie sequels, television series developments, and insights from creators. Discussions around upcoming blockbusters and fan theories are circulating, particularly regarding the future of popular horror and sci-fi franchises.</p><h2>Movie Sequel Updates</h2><p>In recent news, 'The Black Phone 2' director Scott Derrickson revealed that the idea for the sequel came directly from author Joe Hill, son of Stephen King, despite not being based on one of his existing stories. This collaboration has generated excitement among fans of the original horror film. Meanwhile, Timothée Chalamet has teased the next chapter of the Dune saga with a behind-the-scenes picture from the set of 'Dune: Messiah'.</p><div class=\"pullquote\">'The Boys' spin-off, Gen V, faces an uncertain future, with showrunner Eric Kripke giving a devastating update that a second season seems unlikely.</div><h2>Television and Streaming News</h2><p>On the small screen, fans of DC's 'Peacemaker' are buzzing with theories following a shocking season 2 finale. In other news, Netflix is reportedly developing another period romance drama that some speculate could be the next 'Bridgerton'. For those looking to catch up on expansive universes, guides on how to watch franchises like Dragon Ball in order are proving popular.</p><h3>Key Takeaways</h3><ul class=\"key-points\"><li>The idea for 'The Black Phone 2' came directly from author Joe Hill.</li><li>'Dune: Messiah' is in development, with star Timothée Chalamet sharing glimpses from the set.</li><li>The future of 'The Boys' spin-off, Gen V, is in doubt.</li><li>Netflix is expanding its catalogue of period romance dramas.</li></ul>"
    },
    {
      "id": "unreal-engine-jobs-perth-oct-18-2025",
      "category": "Perth, Western Australia jobs relating to 3DS Max, 3D visualisation, Unity, Unreal Engine, 3D visualisation, 3D rendering, and architectural visualisation",
      "title": "Unreal Engine Jobs in Perth WA (with Salaries)",
      "excerpt": "A summary of the current job market in Perth, Western Australia for professionals skilled in Unreal Engine, 3D visualisation, and real-time rendering.",
      "bannerImage": "https://images.pexels.com/photos/177557/pexels-photo-177557.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
      "thumbnailImage": "https://images.pexels.com/photos/177557/pexels-photo-177557.jpeg?auto=compress&cs=tinysrgb&w=400&h=300&dpr=2",
      "author": "Indeed",
      "date": "Oct 18, 2025",
      "readTime": "3 min",
      "sourceUrl": "https://au.indeed.com/q-unreal-engine-l-perth-wa-jobs.html",
      "isTrending": true,
      "isJob": true,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<h2>Role Overview: The Unreal Engine Job Market in Perth</h2><p class=\"lead-paragraph\">The job market in Perth, Western Australia, is showing a growing demand for skilled professionals with expertise in Unreal Engine. These roles span various industries beyond just gaming, including architectural visualisation, simulation, and interactive media. Companies are seeking talented individuals who can leverage the power of real-time 3D rendering to create immersive and visually stunning experiences.</p><h3>Key Responsibilities</h3><p>Based on current listings, common responsibilities for Unreal Engine specialists in Perth include developing real-time visualisations, creating interactive 3D environments, and programming gameplay or application logic using Blueprints or C++. Many roles require collaboration with multidisciplinary teams, including artists, designers, and engineers, to bring complex projects to life. A strong understanding of 3D modelling, texturing, lighting, and optimisation for real-time performance is a recurring requirement.</p><h3>Required Qualifications</h3><p>Employers are typically looking for candidates with a strong portfolio showcasing their work in Unreal Engine. A degree in computer science, game design, or a related field is often preferred but not always mandatory if experience is substantial. Proficiency in C++ and the Blueprint visual scripting system is highly valued. Experience with 3D software such as 3ds Max, Maya, or Blender is also frequently listed as a core requirement for asset integration.</p><h3>What We Offer</h3><p>Job listings in Perth for Unreal Engine professionals often feature competitive salaries and the opportunity to work on cutting-edge projects. Many companies offer flexible working arrangements and a collaborative studio environment. These roles provide a chance to be at the forefront of the real-time technology boom in Western Australia, contributing to innovative projects in a growing and dynamic field.</p><h3>Key Points</h3><ul class=\"key-points\"><li>High demand for Unreal Engine skills in Perth, WA.</li><li>Opportunities exist in gaming, architectural visualisation, and simulation.</li><li>Strong proficiency in Unreal Engine, Blueprints, and C++ is often required.</li><li>Portfolios showcasing high-quality real-time 3D work are essential.</li><li>The market offers competitive salaries and opportunities for career growth.</li></ul>"
    },
    {
      "id": "ai-update-oct-17-2025",
      "category": "AI technology innovations, AI news, AI in games",
      "title": "AI Update, October 17, 2025: AI News and Views From the Past Week",
      "excerpt": "Catch up on select AI news including OpenAI's partnership with Walmart, Slack's new AI assistant, and Google's Gemini Enterprise.",
      "bannerImage": "https://images.pexels.com/photos/546819/pexels-photo-546819.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
      "thumbnailImage": "https://images.pexels.com/photos/546819/pexels-photo-546819.jpeg?auto=compress&cs=tinysrgb&w=400&h=300&dpr=2",
      "author": "Marketing Profs",
      "date": "Oct 17, 2025",
      "readTime": "4 min",
      "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHmgvjZc1zE9xjUJBv537ujWe6Pnh4Sh2lJXrY50jJLSbnulE0OD2J8cnc5nfEOhVmkZQBSI-HchsXp1BfGxk5o3i6Tna0uKQ-t-J_zyw65Ok2yjYcPBiHYQghGFAT7mdnrbUhsVbPn93y0VDgcSR0Dzocw-v2AUOJvmd0giI9uGoMjegiIF5Eke_dBfjnxBN9badivfsLZK7eSsl-KwCJ1l1kGZu9JMdFGaqeO",
      "isTrending": true,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<div class=\"article-hero\"><img src=\"https://images.pexels.com/photos/546819/pexels-photo-546819.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2\" alt=\"Abstract code on a screen representing AI development\" style=\"width:100%;\"></div><p class=\"lead-paragraph\">The past week in AI has seen significant moves by major tech companies to integrate artificial intelligence more deeply into enterprise and consumer applications. Key developments include a partnership between OpenAI and Walmart to enable conversational shopping, Slack enhancing its Slackbot into a personalised AI assistant, and Google's launch of Gemini Enterprise to facilitate interaction with internal company data.</p><h2>Enterprise and Commerce Integrations</h2><p>OpenAI and Walmart have partnered to allow users to purchase products directly within ChatGPT, using natural-language prompts for an instant checkout experience. This transforms ChatGPT into a conversational shopping platform, signalling a broader trend of embedding e-commerce within AI chat environments. In the enterprise space, Google launched Gemini Enterprise, a conversational AI platform that enables employees to interact with their company's internal data, documents, and software through a chat interface. Salesforce has also deepened its partnership with Google, integrating Gemini AI models into its Atlas Reasoning Engine to enhance data analysis and agentic-AI capabilities within Slack.</p><blockquote class=\"expert-quote\"><p>For marketing teams, this could speed data analysis, content planning, and reporting.</p><span>- Marketing Profs on Google's Gemini Enterprise</span></blockquote><h2>Workplace and Development Tools</h2><p>Slack is testing an AI-enhanced Slackbot that can answer queries, summarise channels, and help coordinate projects by pulling data from conversations and files. Microsoft is also pushing the 'AI PC' concept by weaving Copilot deeper into Windows 11, with features that allow users to interact with their computer through voice and on-screen context. On the development side, Anthropic introduced Haiku 4.5, its most affordable AI model to date, aiming to make advanced AI workflows accessible to smaller teams and budgets by balancing cost and capability.</p><h3>Key Takeaways</h3><ul class=\"key-points\"><li>OpenAI and Walmart have partnered to integrate e-commerce into ChatGPT.</li><li>Google launched Gemini Enterprise for secure, internal corporate data interaction.</li><li>Slack is upgrading its Slackbot into a personalised AI assistant for workplace productivity.</li><li>Microsoft is advancing its 'AI PC' initiative with enhanced Copilot features in Windows 11.</li><li>Anthropic released a new, lower-cost AI model, Haiku 4.5, to broaden enterprise adoption.</li></ul>"
    },
    {
      "id": "quantum-networks-dark-matter-oct-17-2025",
      "category": "Quantum Physics, Quantum Mechanics",
      "title": "Quantum networks bring new precision to dark matter searches",
      "excerpt": "Recent developments in quantum physics, including using quantum networks for dark matter searches and advancements in quantum computing.",
      "bannerImage": "https://images.pexels.com/photos/39520/physicist-einstein-genius-smart-39520.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
      "thumbnailImage": "https://images.pexels.com/photos/39520/physicist-einstein-genius-smart-39520.jpeg?auto=compress&cs=tinysrgb&w=400&h=300&dpr=2",
      "author": "Asia Research News",
      "date": "Oct 17, 2025",
      "readTime": "3 min",
      "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEII8U1FcQpAtl7Jl4_asG0TnAgr3pnVp59Vtv10YbwrunSa5jd65OJ4zwKXiVLbg9bP93_eU-ASOmSWhZ71Ytnzoq_LUK_l5ijfIO8drZvRgDFpUlrWz_8oZr-Mn7vLC-tl-F2JSK163aHkIQFtKPG6Qgwms9bzh8YzgtUMDck5CtYb3LJ7AFG_WBOpk534tjYbeuBuXzB1OI9cvqUEMk=",
      "isTrending": true,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<div class=\"article-hero\"><img src=\"https://images.pexels.com/photos/39520/physicist-einstein-genius-smart-39520.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2\" alt=\"Abstract representation of quantum particles and networks\" style=\"width:100%;\"></div><p class=\"lead-paragraph\">Researchers from Tohoku University have designed a new type of quantum sensor network that could significantly improve the chances of detecting dark matter, an invisible substance that makes up about 27% of the universe. The study, published in Physical Review D, proposes a method to boost the sensitivity of quantum sensors by connecting them in optimised network structures.</p><h2>Enhanced Sensitivity Through Networks</h2><p>The research focuses on using superconducting qubits, which are tiny electric circuits cooled to very low temperatures, typically used in quantum computing. By connecting these qubits in various network designs—such as ring, line, star, and fully connected structures—the team aims to amplify their ability to detect the extremely faint signals theorised to be left by dark matter. The concept is that networking multiple qubits allows for stronger, more coherent detection capabilities than individual sensors acting alone.</p><blockquote class=\"expert-quote\"><p>This research shows that carefully designed quantum networks can push the boundaries of what is possible in precision measurement.</p><span>- Dr. Le Bin Ho, lead author of the study</span></blockquote><h2>Broader Applications</h2><p>Beyond the search for dark matter, these advanced quantum sensor networks have the potential to advance a range of other technologies. Potential applications include quantum radar, gravitational wave detection, and ultra-precise timekeeping. Furthermore, they could lead to improvements in GPS accuracy, enhance brain imaging with MRI, or help in the detection of hidden underground structures. The team plans to extend this approach to larger networks and explore ways to make the sensors more resistant to environmental noise.</p><h3>Key Takeaways</h3><ul class=\"key-points\"><li>Researchers have designed quantum sensor networks to improve dark matter detection sensitivity.</li><li>The networks use interconnected superconducting qubits to amplify faint signals.</li><li>This approach has been shown to enhance precision compared to individual sensors.</li><li>Potential applications extend to GPS, MRI, and gravitational wave detection.</li><li>The findings were published in the journal Physical Review D.</li></ul>"
    },
    {
      "id": "3d-visualisation-jobs-perth-oct-17-2025",
      "category": "Perth, Western Australia jobs relating to 3DS Max, 3D visualisation, Unity, Unreal Engine, 3D visualisation, 3D rendering, and architectural visualisation",
      "title": "3D Visualisation Jobs in Perth WA 6000",
      "excerpt": "An overview of job opportunities in Perth for 3D visualisation artists, designers, and draftspersons, highlighting key roles and required skills.",
      "bannerImage": "https://images.pexels.com/photos/159497/school-notebook-work-desk-business-159497.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
      "thumbnailImage": "https://images.pexels.com/photos/159497/school-notebook-work-desk-business-159497.jpeg?auto=compress&cs=tinysrgb&w=400&h=300&dpr=2",
      "author": "SEEK",
      "date": "Oct 17, 2025",
      "readTime": "3 min",
      "sourceUrl": "https://www.seek.com.au/3d-visualisation-jobs/in-Perth-WA-6000",
      "isTrending": true,
      "isJob": true,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<h2>Role Overview: 3D Visualisation Careers in Perth</h2><p class=\"lead-paragraph\">The Perth job market is currently active with opportunities for professionals in the 3D visualisation field. Roles range from 3D Artists and Draftspersons to R&D Product Design Specialists, indicating a diverse need for 3D skills across various industries, including architecture, product design, and engineering. Companies are seeking creative and technical individuals to help bring concepts to life through detailed 3D models and renderings.</p><h3>Key Responsibilities</h3><p>Common responsibilities found in job listings include creating precise 2D and 3D drawings, developing 3D models for cutting-edge products, and producing lifelike multimedia outputs for project visualisations. For roles like an Architectural Draftsperson, the focus is on creating accurate documentation that translates design concepts into buildable plans. Many positions require the ability to work collaboratively with stakeholders to achieve the desired visual outcomes for projects.</p><h3>Required Qualifications</h3><p>A strong technical capability in 3D visualisation is essential, often requiring proficiency in software for 3D modelling, VFX, and compositing. For design-focused roles, expertise in CAD and 3D modelling is a must. Experience in integrating operational model outputs from software like Vissim into 3D rendering software is a specialised skill sought for certain technical positions. A strong portfolio is crucial for demonstrating creative and technical abilities to potential employers.</p><h3>What We Offer</h3><p>Many companies in Perth offer attractive salary packages, flexible working arrangements, and opportunities for professional development. Roles like the R&D Product Design Specialist and Architectural Draftsperson are often listed with competitive salary ranges. Government jobs, such as those with Main Roads, highlight benefits like attractive leave provisions and a focus on work-life balance.</p><h3>Key Points</h3><ul class=\"key-points\"><li>Diverse 3D visualisation roles are available in Perth, including artists, designers, and draftspersons.</li><li>Skills in 3D modelling, CAD, and rendering software are in high demand.</li><li>Opportunities span industries from architecture to product R&D.</li><li>Employers often offer competitive salaries and flexible work conditions.</li></ul>"
    },
    {
      "id": "particle-physics-symposium-oct-17-2025",
      "category": "real-time GPU simulations and Particle Physics",
      "title": "4th International Symposium on the History of Particle Physics",
      "excerpt": "CERN will host the 4th International Symposium on the History of Particle Physics from 10–13 November, focusing on the pivotal discoveries of the 1980s and 1990s.",
      "bannerImage": "https://images.pexels.com/photos/207489/pexels-photo-207489.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
      "thumbnailImage": "https://images.pexels.com/photos/207489/pexels-photo-207489.jpeg?auto=compress&cs=tinysrgb&w=400&h=300&dpr=2",
      "author": "CERN",
      "date": "Oct 17, 2025",
      "readTime": "2 min",
      "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQFQDwKdBATpMge9wwVPSi9L3dt8Z3blrmBNY1N2oYNaeBRQa1Bt2NdHXj2av3gskQGPvupIuneJAqoz-QmzK6PQ1LeK5QHurKXCYUrOlUlvkS5AybT2sp0R9I-ovDByZnspHEUQ1DbhQ0xNWckbtahjorPTN0CB3X6O3J-XL6x9PR9TO98SdetS0j9KQsrO88r9",
      "isTrending": true,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<div class=\"article-hero\"><img src=\"https://images.pexels.com/photos/207489/pexels-photo-207489.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2\" alt=\"View of the Large Hadron Collider tunnel at CERN\" style=\"width:100%;\"></div><p class=\"lead-paragraph\">The European Organization for Nuclear Research (CERN) will host the 4th International Symposium on the History of Particle Physics from November 10-13, 2025. The event will bring together leading physicists, historians, and philosophers to discuss the significant developments in the field during the 1980s and 1990s, a period when CERN became the global centre for particle physics.</p><h2>Focus of the Symposium</h2><p>The symposium will explore the monumental discoveries and intellectual shifts that occurred between 1980 and 2000. This fascinating period includes decisive moments such as the discovery of the W and Z bosons, the initial development of the Large Hadron Collider (LHC) project, and the rise of string theory. The event aims to examine theoretical, experimental, and accelerator physics developments, as well as the convergence of particle physics with cosmology and astrophysics.</p><div class=\"highlight-box info-box\"><h4>A Tribute to Herwig Schopper</h4><p>The symposium will be dedicated to the memory of former CERN Director-General Herwig Schopper, who passed away earlier this year. A dinner on November 11 will feature stories about his life and influential work.</p></div><h2>A Legacy of Discovery</h2><p>CERN was established in 1954 to foster peace and bring scientists together in post-war Europe. It is now an intergovernmental organisation with 24 member states, operating the largest particle physics laboratory in the world. This symposium continues a tradition of historical reflection, following previous events at Fermilab and SLAC that covered the period from 1930 to 1980.</p><h3>Key Takeaways</h3><ul class=\"key-points\"><li>CERN will host a symposium on the history of particle physics from November 10-13, 2025.</li><li>The event will focus on the key discoveries and developments of the 1980s and 1990s.</li><li>Topics include the discovery of W and Z bosons and the development of the LHC.</li><li>The symposium is dedicated to the memory of former CERN Director-General Herwig Schopper.</li></ul>"
    },
    {
      "id": "ai-game-development-oct-16-2025",
      "category": "AI technology innovations, AI news, AI in games",
      "title": "AI-Powered Game Development: Innovation & Efficiency",
      "excerpt": "The game development landscape is undergoing a seismic shift, driven by the transformative power of Artificial Intelligence.",
      "bannerImage": "https://images.pexels.com/photos/275137/pexels-photo-275137.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
      "thumbnailImage": "https://images.pexels.com/photos/275137/pexels-photo-275137.jpeg?auto=compress&cs=tinysrgb&w=400&h=300&dpr=2",
      "author": "Various Sources",
      "date": "Oct 16, 2025",
      "readTime": "4 min",
      "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEkXBiqjRBJnXRG0XxZRtzAG2Y1WQWOyEWFNKyWkZJr4mL823PCMr_i_KzhnWVLf_vDwBqFPctTAibT9PEL4o6ok2D0eKzmfT70bLa0DHHU8FMRKMsdS3zKUkvuR1MPacgLRJJ4qZSasmFru1kPoZMv9cBKInqjxOnJnzPaJ9279txIGb_wxeKkW8mcUSbEjcvqPZwNTfCh7IdVc-0YwRPMfgvYjQ==",
      "isTrending": false,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<div class=\"article-hero\"><img src=\"https://images.pexels.com/photos/275137/pexels-photo-275137.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2\" alt=\"A futuristic concept art for a video game\" style=\"width:100%;\"></div><p class=\"lead-paragraph\">The game development industry is experiencing a fundamental transformation driven by Artificial Intelligence, which is rapidly becoming a core pillar of modern game creation. AI is no longer just a futuristic concept but a practical toolkit that redefines every stage of the development lifecycle, from asset generation to creating more intelligent non-player characters (NPCs) and optimising code. This shift enables smaller teams to achieve AAA-quality results and larger studios to build more complex and personalised game worlds.</p><h2>Accelerating Production Pipelines</h2><p>One of the most significant impacts of AI is its ability to accelerate development by automating repetitive and time-consuming tasks. AI-powered tools are revolutionising asset creation by generating 2D/3D models, textures, and entire environments from simple prompts. This allows artists to iterate faster and focus on creative direction. Similarly, AI coding assistants can generate code, identify bugs, and optimise performance, freeing up programmers to concentrate on unique gameplay mechanics.</p><blockquote class=\"expert-quote\"><p>I'd like AI to handle the tedious tasks. That would lower the cost and cut down on time. It's more like co-creating with AI instead of just using it.</p><span>- Hideo Kojima, Game Developer</span></blockquote><h2>Creating Smarter, More Immersive Worlds</h2><p>AI is also enhancing the player experience by creating more dynamic and believable game worlds. AI-driven NPCs can now exhibit complex, adaptive behaviours that go beyond simple scripted actions, making them feel more alive and unpredictable. Furthermore, AI can be used to generate quests, design levels that adapt to a player's skill, and even create dynamic narratives that respond to player choices, significantly increasing engagement and replayability. Legendary game developer Hideo Kojima sees a future of co-creating with AI, using it as a tool to handle tedious work while humans remain at the helm of innovation.</p><h3>Key Takeaways</h3><ul class=\"key-points\"><li>AI is becoming a core component of modern game development, impacting the entire production lifecycle.</li><li>It accelerates development by automating tasks like asset creation and code optimisation.</li><li>AI-driven NPCs and procedural content generation are making game worlds more immersive and dynamic.</li><li>The global AI in Game Development market is projected to grow from approximately $3.17 billion in 2025 to $58.78 billion by 2035.</li></ul>"
    },
    {
      "id": "quantum-mechanics-nobel-prize-oct-16-2025",
      "category": "Quantum Physics, Quantum Mechanics",
      "title": "How 100 Years of Quantum Mechanics Led to the 2025 Nobel Prize in Physics",
      "excerpt": "The 2025 Nobel Prize in Physics was awarded for the discovery of macroscopic quantum mechanical tunneling and energy quantization in electrical circuits.",
      "bannerImage": "https://images.pexels.com/photos/1115203/pexels-photo-1115203.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
      "thumbnailImage": "https://images.pexels.com/photos/1115203/pexels-photo-1115203.jpeg?auto=compress&cs=tinysrgb&w=400&h=300&dpr=2",
      "author": "Various Sources",
      "date": "Oct 16, 2025",
      "readTime": "3 min",
      "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEf-u-98OVnndm3suVsiVv04S7DqW7IJKc66Wo_rtamruCxR3qGu-D9hWpJja8Qrq90Raf3sESVQBaI1xnAWWH5TzM2gvQpFxxHWV1dqBWM4fNugJ-X5pmC8fiu22NU2I53VcYblRJx7sDLrx6S-hG-JOI0rxWygw==",
      "isTrending": false,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<div class=\"article-hero\"><img src=\"https://images.pexels.com/photos/1115203/pexels-photo-1115203.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2\" alt=\"The Nobel Prize medal\" style=\"width:100%;\"></div><p class=\"lead-paragraph\">The 2025 Nobel Prize in Physics has been jointly awarded to John Clarke, Michel H. Devoret, and John M. Martinis for their groundbreaking discovery of macroscopic quantum mechanical tunnelling and energy quantisation in an electric circuit. Their pioneering experiments, conducted primarily in the 1980s, demonstrated for the first time that quantum phenomena, previously observed only at microscopic scales, could be manifested in a system large enough to be held in the hand.</p><h2>Bridging the Quantum and Macroscopic Worlds</h2><p>Quantum tunnelling is a phenomenon where particles can pass through an energy barrier that, according to classical physics, they should not have enough energy to overcome. While this effect was known at the atomic level, the laureates' work showed that a collective group of electrons in a superconducting electrical circuit could also 'tunnel' through a barrier together. This achievement effectively bridged the gap between the bizarre rules of the quantum world and the tangible, large-scale world we experience every day.</p><div class=\"pullquote\">“It is wonderful to be able to celebrate the way that century-old quantum mechanics continually offers new surprises.”</div><h2>Paving the Way for Quantum Technology</h2><p>The discovery has had profound implications for modern technology, particularly in the development of quantum computing. By demonstrating that a macroscopic system can behave like a single quantum particle, their work laid the foundational groundwork for creating qubits, the building blocks of quantum computers. The research also has relevance for ultra-precise sensors and other next-generation quantum technologies. The award is especially fitting as 2025 was designated the International Year of Quantum Science and Technology, celebrating 100 years since the initial development of modern quantum mechanics.</p><h3>Key Takeaways</h3><ul class=\"key-points\"><li>The 2025 Nobel Prize in Physics was awarded to John Clarke, Michel H. Devoret, and John M. Martinis.</li><li>The prize recognises their discovery of quantum tunnelling in a macroscopic electrical circuit.</li><li>Their work proved that quantum effects are not limited to microscopic scales.</li><li>This breakthrough is fundamental to the development of quantum computing and other advanced technologies.</li></ul>"
    },
    {
      "id": "top-10-mmorpgs-2025-oct-15-2025",
      "category": "MMO RPG Games, Game Modding",
      "title": "Top 10 NEW MMORPGs of 2025",
      "excerpt": "A look at the most anticipated new and updated MMORPGs releasing or receiving major updates in 2025.",
      "bannerImage": "https://images.pexels.com/photos/7449996/pexels-photo-7449996.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
      "thumbnailImage": "https://img.youtube.com/vi/mBIXvX9C-cM/maxresdefault.jpg",
      "author": "Various Sources",
      "date": "Oct 15, 2025",
      "readTime": "3 min",
      "sourceUrl": "https://www.youtube.com/watch?v=mBIXvX9C-cM",
      "isTrending": false,
      "isJob": false,
      "isVideo": true,
      "videoUrl": "https://www.youtube.com/watch?v=mBIXvX9C-cM",
      "fullContent": "<div class=\"article-hero\"><img src=\"https://img.youtube.com/vi/mBIXvX9C-cM/maxresdefault.jpg\" alt=\"Promotional art for a fantasy MMORPG\" style=\"width:100%;\"></div><p class=\"lead-paragraph\">The landscape of Massively Multiplayer Online Role-Playing Games (MMORPGs) continues to evolve in 2025, with a mix of brand-new titles and significant updates to established classics. Both new and veteran players have a wide array of worlds to explore, from high-fantasy realms to sprawling sci-fi universes. This overview highlights some of the most notable MMOs capturing players' attention this year.</p><h2>New and Updated Experiences</h2><p>Established games continue to provide fresh content, keeping their communities engaged. <strong>Guild Wars 2</strong> plans to release its 'Visions of Eternity' expansion in late October 2025, continuing its model of spreading new content across multiple releases. <strong>Final Fantasy 14</strong> remains a top contender, celebrated for its strong storytelling and massive expansions that continually enrich the world of Eorzea. Similarly, <strong>The Elder Scrolls Online</strong> has solidified its place as a premier MMO, especially for console players, by consistently adding to the vast continent of Tamriel.</p><div class=\"side-image-left\"><img src=\"https://images.pexels.com/photos/7449996/pexels-photo-7449996.jpeg?auto=compress&cs=tinysrgb&w=800&h=600&dpr=2\" alt=\"Gamer at a computer setup\" style=\"width:100%;\"><p class=\"caption\">The MMO genre remains a dominant force in online gaming.</p></div><h2>Free-to-Play and Emerging Titles</h2><p>The free-to-play market offers several compelling options. <strong>Throne and Liberty</strong>, from the creators of Guild Wars, provides a vibrant fantasy world with a flexible classless combat system. <strong>Lost Ark</strong>, which released in 2020, has quickly become a fan favorite due to its action-oriented combat and consistent endgame content updates. For those seeking a different flavour, the Gacha MMO <strong>Tower of Fantasy</strong> offers a more traditional MMO feel compared to its counterpart Genshin Impact, with shared world bosses and a more visible player community.</p><h3>Key Takeaways</h3><ul class=\"key-points\"><li>Established MMOs like Final Fantasy 14 and Guild Wars 2 are releasing major expansions in 2025.</li><li>The Elder Scrolls Online continues to be a top choice for experiencing the world of Tamriel.</li><li>Free-to-play titles like Throne and Liberty and Lost Ark offer high-quality, accessible experiences.</li><li>Newer titles like Dune: Awakening and Corepunk are anticipated to launch or expand their early access in 2025.</li></ul>"
    },
    {
      "id": "what-is-quantum-physics-oct-14-2025",
      "category": "Quantum Physics, Quantum Mechanics",
      "title": "What Is Quantum Physics, Exactly?",
      "excerpt": "A clear and simple explanation of the weird and wonderful world of quantum physics, from wave-particle duality to quantum tunneling.",
      "bannerImage": "https://img.youtube.com/vi/bfD_S-S_g-s/maxresdefault.jpg",
      "thumbnailImage": "https://img.youtube.com/vi/bfD_S-S_g-s/maxresdefault.jpg",
      "author": "Get Ahead",
      "date": "Oct 14, 2025",
      "readTime": "2 min",
      "sourceUrl": "https://www.youtube.com/watch?v=bfD_S-S_g-s",
      "isTrending": false,
      "isJob": false,
      "isVideo": true,
      "videoUrl": "https://www.youtube.com/watch?v=bfD_S-S_g-s",
      "fullContent": "<div class=\"article-hero\"><iframe width=\"100%\" height=\"600\" src=\"https://www.youtube.com/embed/bfD_S-S_g-s\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></div><p class=\"lead-paragraph\">Quantum physics is the science that describes the behaviour of matter and energy at the smallest scales—in the realm of atoms and subatomic particles. It reveals a world where the familiar rules of classical physics no longer apply, introducing counterintuitive concepts like wave-particle duality, superposition, and quantum tunnelling.</p><h2>Core Concepts of Quantum Mechanics</h2><p>At its heart, quantum mechanics explains that particles like electrons can behave as both particles and waves simultaneously. This is known as <strong>wave-particle duality</strong>. Another key principle is <strong>superposition</strong>, where a particle can exist in multiple states or locations at once until it is measured. The very act of observation forces the particle into a single, definite state.</p><div class=\"highlight-box info-box\"><h4>Quantum Tunnelling</h4><p>One of the most fascinating quantum phenomena is tunnelling, where a particle can pass through a physical barrier it shouldn't have enough energy to overcome. This concept was central to the 2025 Nobel Prize in Physics, which recognised its discovery in macroscopic systems.</p></div><h2>From Theory to Technology</h2><p>While these ideas may seem abstract, they form the foundation of countless modern technologies. Quantum mechanics is essential for the operation of lasers, transistors (the basis of all computers), MRI scanners, and atomic clocks. The ongoing development in this field is now leading to the next generation of technology, including quantum computing and ultra-precise quantum sensors, which promise to revolutionise fields from medicine to materials science.</p><h3>Key Takeaways</h3><ul class=\"key-points\"><li>Quantum physics governs the behaviour of matter and energy at the atomic and subatomic levels.</li><li>Key principles include wave-particle duality, superposition, and quantum tunnelling.</li><li>The act of measurement plays a crucial role in determining the state of a quantum system.</li><li>Quantum mechanics is the foundational theory behind modern technologies like lasers, computers, and MRI.</li></ul>"
    },
    {
      "id": "cobbs-creek-water-quality-oct-14-2025",
      "category": "Astrophysics and Cosmology, Earth and Environmental Science",
      "title": "Inspiring Interest in Water Quality at Cobbs Creek",
      "excerpt": "A coalition of researchers, students, and community members are working to collect detailed water quality data for Cobbs Creek in West Philadelphia, a waterway long designated as “impaired.”",
      "bannerImage": "https://images.pexels.com/photos/326461/pexels-photo-326461.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
      "thumbnailImage": "https://images.pexels.com/photos/326461/pexels-photo-326461.jpeg?auto=compress&cs=tinysrgb&w=400&h=300&dpr=2",
      "author": "Penn Today",
      "date": "Oct 14, 2025",
      "readTime": "3 min",
      "sourceUrl": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQGokmBqEy86M5QJze3yJcJhq_94QJMNZcUe6IIuCLYJtymqLPbRnAqpGVqbku-tpXu5rs6WyoKQ2gC9ZNDXaBliZKj2A6W9oKecQ6RPn87dae2Ou6yrwUW670_GTSouPTPHYInzeuFfebIeqYMGZ--49fVkARjhY9QxYH_eczPYxbM-bS6WwYNd8MdvXtpCKjbAoRc=",
      "isTrending": false,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<div class=\"article-hero\"><img src=\"https://images.pexels.com/photos/326461/pexels-photo-326461.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2\" alt=\"A clear stream flowing over rocks in a forest\" style=\"width:100%;\"></div><p class=\"lead-paragraph\">For decades, the Pennsylvania Department of Environmental Protection has designated Cobbs Creek in West Philadelphia as an “impaired stream,” indicating it fails to meet at least one water quality standard. However, a lack of detailed data has made it difficult to identify the specific causes. A new initiative led by researchers, students, and community members is now working to change that by collecting the most comprehensive water quality data for the creek to date.</p><h2>The Cobbs Creek Stream Team</h2><p>Led by Jon Hawkings, an assistant professor of earth and environmental science, a group called the Cobbs Creek Stream Team has been conducting in-depth water sampling and analysis since 2024. The coalition aims to empower young leaders and community members in water quality monitoring, building on existing community efforts. The project's goals are twofold: to submit crucial data to state and federal water quality reports and to share live water quality data directly with the local community.</p><blockquote class=\"expert-quote\"><p>Cobbs Creek Watershed communities have faced barriers to accessing their green space and a long history of environmental disinvestment. These issues are not just environmental; they directly impact the quality of life for the communities.</p><span>- Clean Air Council</span></blockquote><h2>Identifying Pollutants</h2><p>The stream faces numerous environmental threats, including pollution from urban runoff, erosion, and contamination from the city's aging combined sewer systems, which can release raw sewage during heavy rain. Researchers are sampling for heavy metals like lead, cadmium, and copper, as well as microplastics from illegally dumped items. Postdoctoral researcher Derek Ho is developing methods to make microplastics detection faster and more accessible by using fluorescence imaging and machine learning, as these tiny plastics can act as sponges for other contaminants.</p><h3>Key Takeaways</h3><ul class=\"key-points\"><li>Cobbs Creek in West Philadelphia has long been classified as an “impaired stream” by environmental authorities.</li><li>A coalition of researchers, students, and community members is now gathering detailed water quality data.</li><li>The project aims to identify specific pollutants, including heavy metals and microplastics, and share findings with the public.</li><li>The creek suffers from pollution due to urban runoff and an aging combined sewer system.</li></ul>"
    }
  ],
  "makeWebhook": "",
  "authToken": ""
}
