{
  "categories": [
    {
      "id": "all",
      "name": "All",
      "active": true
    },
    {
      "id": "ai-and-tech",
      "name": "AI & Tech",
      "active": false
    },
    {
      "id": "science-and-space",
      "name": "Science & Space",
      "active": false
    },
    {
      "id": "perth-local",
      "name": "Perth Local",
      "active": false
    }
  ],
  "trending": [],
  "articles": [
    {
      "id": "senior-desktop-engineer-perth",
      "category": "perth-local",
      "title": "Job Opening: Senior Desktop Engineer in Perth",
      "excerpt": "A contract role for a Senior Desktop Engineer is available in Perth, focusing on providing high-level helpdesk and IT support services.",
      "bannerImage": "https://images.pexels.com/photos/3183150/pexels-photo-3183150.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
      "thumbnailImage": "https://images.pexels.com/photos/3184339/pexels-photo-3184339.jpeg?auto=compress&cs=tinysrgb&w=400",
      "author": "Peoplebank",
      "date": "Oct 08, 2025",
      "readTime": "3 min",
      "sourceUrl": "https://www.peoplebank.com.au/perth-it-digital-recruitment-contact-us",
      "isTrending": false,
      "isJob": true,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<h2>Role Overview</h2><p>A leading organisation in Perth is seeking an experienced Senior Desktop Engineer for a contract position. The role is centred on providing advanced IT support, managing desktop environments, and resolving complex technical issues to ensure smooth business operations.</p><h3>Key Responsibilities</h3><ul><li>Provide Level 2/3 IT support for desktop hardware, software, and network issues.</li><li>Manage the deployment, configuration, and maintenance of desktop systems and applications.</li><li>Troubleshoot and resolve complex incidents related to operating systems, mobile devices, and peripherals.</li><li>Contribute to IT projects, including system upgrades and migrations.</li><li>Mentor junior support staff and develop technical documentation.</li></ul><h3>Required Qualifications</h3><ul><li><strong>Experience:</strong> Proven experience in a senior desktop support or helpdesk engineer role.</li><li><strong>Technical Skills:</strong> Expertise in Windows operating systems, Active Directory, Microsoft 365, and network troubleshooting.</li><li><strong>Soft Skills:</strong> Strong problem-solving abilities, excellent communication skills, and a customer-focussed approach.</li></ul><h3>Nice-to-Have Skills</h3><ul><li>Experience with ITIL frameworks.</li><li>Certifications such as CompTIA A+ or Microsoft Certified Desktop Support Technician (MCDST).</li><li>Familiarity with virtualisation technologies.</li></ul><h3>What We Offer</h3><ul><li>A competitive contract rate.</li><li>Opportunity to work within a professional and dynamic IT team.</li><li>Exposure to a variety of technologies and IT projects.</li></ul><div class=\"highlight-box\"><p><strong>📍 Location:</strong> Perth, WA (On-site)</p></div><h3>Application Instructions</h3><p>Interested candidates are encouraged to apply via the official Peoplebank website or contact their Perth office for more information on the application process.</p><div class=\"key-takeaways\"><h3>Key Points</h3><ul><li>Role: Senior Desktop Engineer (Contract)</li><li>Key Requirement: Advanced IT support and troubleshooting skills</li><li>Work Arrangement: On-site in Perth</li><li>Application: Via Peoplebank recruitment agency</li></ul></div>"
    },
    {
      "id": "ai-model-collapse-risk-2025",
      "category": "ai-and-tech",
      "title": "What Happens When AI Models Starve for Fresh Knowledge?",
      "excerpt": "A phenomenon known as \"model collapse\" threatens the future of generative AI, where models trained on their own synthetic data begin to lose accuracy and originality.",
      "bannerImage": "https://images.pexels.com/photos/8386440/pexels-photo-8386440.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
      "thumbnailImage": "https://images.pexels.com/photos/11545593/pexels-photo-11545593.jpeg?auto=compress&cs=tinysrgb&w=400",
      "author": "Gopenai",
      "date": "Oct 05, 2025",
      "readTime": "4 min",
      "sourceUrl": "https://medium.com/gopenai/what-happens-when-models-starve-for-fresh-knowledge-3f3398c8c257",
      "isTrending": false,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<h2>The Looming Risk of AI Model Collapse</h2><p>Generative AI models are degrading in performance because they are increasingly trained on AI-generated synthetic data, a phenomenon known as \"model collapse\". This feedback loop causes models to forget the diversity of real-world data, leading to outputs that are less creative, more repetitive, and sometimes factually incorrect. As more of the internet becomes populated with AI-generated content, the risk of polluting future training datasets grows, threatening the long-term progress of artificial intelligence.</p><h3>Forgetting Reality</h3><p>Model collapse occurs when an AI starts to learn from its own outputs, or those of other models. In this recursive process, any small errors or biases in the generated data are amplified in subsequent generations of models. Researchers have found this leads to models forgetting the extremes or \"tails\" of the original data distribution, causing them to favour more common and safer responses, which ultimately reduces the variety and originality of their output.</p><h3>Expert Perspectives on Data Pollution</h3><p>Experts warn that this self-consuming cycle poses a fundamental threat to the development of generative AI. Without careful curation and a steady stream of fresh, human-generated data, AI systems risk converging on a distorted and simplified version of reality. This data pollution could have significant consequences in critical applications like medical diagnostics or financial modelling, where inaccuracies can lead to costly or dangerous outcomes.</p><blockquote><p>\"Model collapse is what happens when AI models are trained on synthetic, AI-generated content -- as opposed to human-generated content -- and degrade. Simply put, it's a feedback loop.\" - TechTarget</p></blockquote><h3>The Path Forward</h3><p>To combat model collapse, a greater emphasis on data quality and diversity is essential. Solutions include better methods for identifying and filtering out synthetic data from training sets, as well as actively curating high-quality, human-verified data. Organisations are recognising that the foundation of a reliable AI model is not just the volume of data, but its authenticity and richness, a challenge that will become more critical as AI-generated content proliferates.</p><div class=\"key-takeaways\"><h3>Key Takeaways</h3><ul><li><strong>Model Collapse:</strong> A degradation in AI performance caused by training on AI-generated data, leading to a loss of diversity and accuracy.</li><li><strong>Amplified Errors:</strong> The process creates a feedback loop where errors and biases are magnified over successive model generations.</li><li><strong>Data Curation is Crucial:</strong> The primary solution is to ensure future AI models are trained on curated, high-quality, human-generated data to avoid pollution.</li><li><strong>Real-World Impact:</strong> The consequences include less creative AI tools and potential failures in critical systems that rely on AI for decision-making.</li></ul></div>"
    },
    {
      "id": "top-video-generation-models-2025",
      "category": "ai-and-tech",
      "title": "The Top 10 Video Generation Models of 2025",
      "excerpt": "A comprehensive list of the leading open-source and proprietary AI video generation models that are redefining creative possibilities in media and content creation.",
      "bannerImage": "https://images.pexels.com/photos/4009409/pexels-photo-4009409.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
      "thumbnailImage": "https://images.pexels.com/photos/757889/pexels-photo-757889.jpeg?auto=compress&cs=tinysrgb&w=400",
      "author": "DataCamp",
      "date": "Oct 05, 2025",
      "readTime": "4 min",
      "sourceUrl": "https://www.datacamp.com/blog/the-top-10-video-generation-models-of-2025",
      "isTrending": false,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<h2>AI Redefines Video Creation in 2025</h2><p>The field of artificial intelligence has achieved a new milestone with the release of advanced text-to-video generation models capable of producing high-fidelity, cinematic content from simple text prompts. These models build upon the foundation of image generation but add the complexity of temporal coherence, ensuring that motion, characters, and scenes remain consistent over time. This technology is rapidly transforming industries from marketing and advertising to film production.</p><h3>A New Era of Creative Tools</h3><p>AI video generators work by interpreting text prompts to create a sequence of images that form a coherent video. Modern systems now offer sophisticated controls over camera movement, character consistency, and art direction, allowing creators to produce professional-quality clips without traditional equipment. The leading models of 2025 represent a significant leap in realism, prompt adherence, and overall output quality.</p><h3>Leading Video Generation Models</h3><p>The landscape of AI video generation is populated by a mix of powerful proprietary systems from major tech companies and versatile open-source projects. Each model offers unique strengths, from photorealism to specific artistic styles.</p><ul><li><strong>Google Veo 3:</strong> A state-of-the-art model known for producing high-fidelity, cinematic clips with excellent realism and temporal consistency.</li><li><strong>Kling 2.5 Turbo:</strong> Recognised for its advanced camera control, physics-aware realism, and film-grade aesthetics.</li><li><strong>OpenAI Sora:</strong> A powerful model capable of generating high-resolution, long-duration videos with a deep understanding of prompts.</li><li><strong>Hailuo 02:</strong> Excels in creating scenes that require realistic physics and can output natively in 1080p.</li><li><strong>Runway Gen-3:</strong> A versatile, production-ready model used for high-quality storytelling and creative content.</li></ul><h3>Future Outlook and Broader Impact</h3><p>The rapid advancement of AI video generation tools is democratising content creation, enabling individuals and small teams to produce visually stunning narratives that were previously only possible for large studios. As these models become more accessible and powerful, they are expected to have a profound impact on social media, entertainment, and digital marketing, offering new avenues for storytelling and audience engagement.</p><div class=\"key-takeaways\"><h3>Key Takeaways</h3><ul><li><strong>Rapid Advancement:</strong> AI text-to-video technology has matured significantly, enabling the creation of high-quality, coherent video from text prompts.</li><li><strong>Top Contenders:</strong> Key models like Google's Veo 3, Kling 2.5 Turbo, and OpenAI's Sora are leading the market with advanced features and realism.</li><li><strong>Creative Control:</strong> Modern platforms offer detailed control over cinematic elements, including camera angles, motion, and character consistency.</li><li><strong>Industry Transformation:</strong> AI video generation is set to revolutionise marketing, filmmaking, and content creation across various media.</li></ul></div>"
    },
    {
      "id": "make-ai-model-integrations-2025",
      "category": "ai-and-tech",
      "title": "Make.com Integrates Latest AI Models from OpenAI and Gemini",
      "excerpt": "The automation platform Make.com has expanded its AI capabilities by integrating new advanced models from OpenAI and Google's Vertex AI, including GPT-4.1 and Gemini 2.5 Pro.",
      "bannerImage": "https://images.pexels.com/photos/5926382/pexels-photo-5926382.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
      "thumbnailImage": "https://images.pexels.com/photos/169573/pexels-photo-169573.jpeg?auto=compress&cs=tinysrgb&w=400",
      "author": "Make.com",
      "date": "Oct 04, 2025",
      "readTime": "3 min",
      "sourceUrl": "https://www.make.com/en/help/release-notes/2025/latest-ai-models-for-openai-and-gemini--ui-updates-to-module-rename-panel",
      "isTrending": false,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<h2>Make.com Enhances AI Automation Capabilities</h2><p>The no-code automation platform Make.com has announced the integration of the latest and most advanced AI models from OpenAI and Google Vertex AI. Users can now leverage OpenAI's GPT-4.1 and o4 models, alongside Google's Gemini 2.5 Flash and Gemini 2.5 Pro, directly within their automated workflows, enabling more powerful and intelligent business process solutions.</p><h3>Access to Cutting-Edge AI</h3><p>This update provides Make.com users with direct access to state-of-the-art AI technologies. The integration is designed to help businesses automate more complex tasks, from data analysis and content generation to sophisticated decision-making processes. The newly supported models offer enhanced reasoning, improved accuracy, and faster response times for a wide range of applications.</p><h3>Newly Integrated Models</h3><table><tr><th>Provider</th><th>Model</th><th>Key Feature</th></tr><tr><td>OpenAI</td><td>GPT-4.1</td><td>Enhanced reasoning and problem-solving</td></tr><tr><td>OpenAI</td><td>o4</td><td>Optimised for complex tasks and accuracy</td></tr><tr><td>Google Vertex AI</td><td>Gemini 2.5 Flash</td><td>Faster responses for everyday tasks</td></tr><tr><td>Google Vertex AI</td><td>Gemini 2.5 Pro</td><td>Advanced capabilities for complex scenarios</td></tr></table><h3>Implications for Automation</h3><p>By incorporating these next-generation models, Make.com reinforces its position as a versatile tool for AI-driven automation. Businesses can now build more sophisticated scenarios that analyse images, extract structured data, and create nuanced content with greater efficiency. The update, which also includes minor UI enhancements, allows for the creation of smarter, more adaptive workflows without requiring any coding knowledge.</p><div class=\"key-takeaways\"><h3>Key Takeaways</h3><ul><li><strong>New Integrations:</strong> Make.com has added support for OpenAI's GPT-4.1 and Google's Gemini 2.5 models.</li><li><strong>Enhanced Power:</strong> Users can now build more intelligent automations with improved reasoning, speed, and accuracy.</li><li><strong>No-Code Access:</strong> The platform continues to provide access to advanced AI for non-developers through its visual interface.</li><li><strong>Broader Capabilities:</strong> The new models expand the potential for automating complex tasks in data analysis, content creation, and workflow management.</li></ul></div>"
    }
  ],
  "videos": [
    {
      "id": "jwst-october-2025-reveals",
      "category": "science-and-space",
      "title": "October 2025: Webb's Next Big Reveals from the Cosmos",
      "excerpt": "The James Webb Space Telescope continues its mission to uncover cosmic secrets, with October 2025 observations targeting the early universe and dying stars.",
      "thumbnail": "https://img.youtube.com/vi/kGrj4S8i21k/maxresdefault.jpg",
      "videoUrl": "https://www.youtube.com/watch?v=kGrj4S8i21k",
      "channel": "JamesWebbTelescope",
      "publishDate": "Oct 07, 2025",
      "duration": "4:32"
    },
    {
      "id": "astronomy-cafe-oct-6-2025",
      "category": "science-and-space",
      "title": "Astronomy Cafe - Oct 6, 2025",
      "excerpt": "A discussion on recent astronomical events, including observations of 3I/Atlas, the third known interstellar object to visit our solar system.",
      "thumbnail": "https://img.youtube.com/vi/V-a-4-g9q7A/maxresdefault.jpg",
      "videoUrl": "https://www.youtube.com/watch?v=V-a-4-g9q7A",
      "channel": "SETI Institute",
      "publishDate": "Oct 06, 2025",
      "duration": "1:01:38"
    }
  ],
  "makeWebhook": "",
  "authToken": ""
}