{
  "categories": [
    {"id": "all", "name": "All", "active": true},
    {"id": "ai-tech", "name": "AI & Tech", "active": false},
    {"id": "robotics", "name": "Robotics", "active": false},
    {"id": "space", "name": "Space", "active": false},
    {"id": "quantum", "name": "Quantum", "active": false},
    {"id": "archaeology", "name": "Archaeology", "active": false},
    {"id": "gaming", "name": "Gaming", "active": false},
    {"id": "perth-jobs", "name": "Perth Jobs", "active": false}
  ],
  "trending": [
    {"articleId": "1", "reason": "GPT-5 release marks major breakthrough in AI capabilities with unprecedented benchmark scores"},
    {"articleId": "3", "reason": "Humanoid robots achieving commercial viability sparks industry-wide adoption discussions"},
    {"articleId": "7", "reason": "James Webb telescope discovers potentially habitable exoplanets closer than expected"}
  ],
  "articles": [
    {
      "id": "1",
      "category": "ai-tech",
      "title": "GPT-5 Dominates AI Benchmarks as Competition Intensifies in 2025",
      "excerpt": "OpenAI's GPT-5 achieves 94.6% on AIME mathematics tests, setting new performance standards.",
      "bannerImage": "https://images.unsplash.com/photo-1677442136019-21780ecad995?w=900&h=600&fit=crop",
      "thumbnailImage": "https://images.unsplash.com/photo-1677442136019-21780ecad995?w=400&h=300&fit=crop",
      "author": "Dr. Sarah Mitchell",
      "date": "Oct 7, 2025",
      "readTime": "6 min",
      "sourceUrl": "https://felloai.com/2025/08/ultimate-comparison-of-gpt-5-vs-grok-4-vs-claude-opus-4-1-vs-gemini-2-5-pro-august-2025/",
      "isTrending": true,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<h2>GPT-5 Sets New Performance Standard</h2><p>OpenAI's GPT-5 has achieved a remarkable 94.6% accuracy on the AIME 2025 mathematics competition and 88.4% on graduate-level GPQA tests, establishing itself as the leading AI model in August 2025. The model's Intelligence Index of 69 surpasses all competitors, marking a significant advancement in artificial intelligence capabilities.</p><h3>Competitive Landscape Shifts</h3><p>The AI model race has intensified dramatically in 2025, with major releases from all leading companies. Gemini 2.5 Pro launched in March, followed by Grok 4 in July, Claude Opus 4.1 on August 5th, and GPT-5 arriving just two days later. This compressed release schedule demonstrates the fierce competition driving rapid innovation.</p><ul><li><strong>GPT-5:</strong> 400,000 token context window, strongest agentic capabilities</li><li><strong>Claude Opus 4.1:</strong> Superior reasoning and coding performance</li><li><strong>Gemini 2.5 Pro:</strong> Massive context handling, native multimodality</li><li><strong>Grok 4:</strong> Real-time data access, dynamic research capabilities</li></ul><h3>Specialised Use Cases Emerge</h3><p>Each model demonstrates unique strengths for specific applications. GPT-5 excels at end-to-end development tasks, handling full-stack applications across Python, JavaScript, C++, and Rust. Claude Opus 4.1 leads in deep reasoning and scientific analysis, whilst Gemini 2.5 Pro's extensive context window makes it ideal for synthesising lengthy documents.</p><blockquote><p>\"GPT-5 combines advanced natural language understanding with strong code generation across multiple programming languages, handling tasks that previously required human developers.\" - OpenAI Research Team</p></blockquote><h3>Business Impact and Adoption</h3><p>Enterprise adoption accelerates as organisations recognise the practical applications of these advanced models. Companies are integrating AI assistants into customer service, software development, content creation, and data analysis workflows. The models' improved reliability and reduced hallucination rates make them suitable for production environments.</p><div class=\"highlight-box\"><p><strong>⚡ Performance Comparison:</strong> GPT-5 processes 400K tokens, Claude handles extended reasoning chains, Gemini manages multimodal inputs seamlessly, Grok accesses live internet data.</p></div><h3>Future Development Trajectory</h3><p>Industry experts predict continued rapid advancement through 2025 and beyond. Focus areas include improved reasoning capabilities, reduced computational costs, enhanced multimodal understanding, and better alignment with human values. The competitive pressure ensures sustained innovation across all major AI laboratories.</p><div class=\"key-takeaways\"><h3>Key Takeaways</h3><ul><li>GPT-5 achieves 94.6% on AIME maths tests, highest benchmark score recorded</li><li>Four major AI models released within five months, intensifying competition</li><li>Each model demonstrates specialised strengths for different use cases</li><li>Enterprise adoption accelerates with improved reliability and capabilities</li></ul></div>"
    },
    {
      "id": "2",
      "category": "ai-tech",
      "title": "AI Music and Video Generation Tools Transform Creative Industry",
      "excerpt": "Neural Frames and Pika Labs enable 4K music video creation in minutes, democratising content production.",
      "bannerImage": "https://images.unsplash.com/photo-1611339555312-e607c8352fd7?w=900&h=600&fit=crop",
      "thumbnailImage": "https://images.unsplash.com/photo-1611339555312-e607c8352fd7?w=400&h=300&fit=crop",
      "author": "Marcus Chen",
      "date": "Oct 6, 2025",
      "readTime": "5 min",
      "sourceUrl": "https://www.unite.ai/best-ai-music-video-generators/",
      "isTrending": false,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<h2>Revolutionary Creative Tools Emerge</h2><p>AI-powered music and video generation tools have achieved professional-quality output in 2025, with platforms like Neural Frames offering 4K resolution music videos up to 10 minutes in duration. These tools eliminate traditional production bottlenecks, enabling artists and content creators to produce sophisticated visual content within minutes rather than weeks.</p><h3>Leading Platforms and Capabilities</h3><p>The market has consolidated around several exceptional tools, each offering unique strengths. Neural Frames specialises in music video creation with frame-perfect audio synchronisation, whilst Pika Labs focuses on short-form content with advanced lip sync and sound effects capabilities.</p><ul><li><strong>Neural Frames:</strong> 10-minute 4K videos, professional music synchronisation</li><li><strong>Pika Labs:</strong> 3-10 second clips, lip sync, social media optimised</li><li><strong>Invideo AI:</strong> Marketing-focused, AI script generation, voiceovers</li><li><strong>Mubert:</strong> Royalty-free music generation, instant track creation</li></ul><h3>Industry Adoption Accelerates</h3><p>Digital marketers, musicians, and content creators rapidly adopt these tools for their efficiency and quality. Independent artists leverage AI music video generators to compete with major label production values, whilst marketing agencies utilise platforms like Invideo AI for rapid campaign development.</p><blockquote><p>\"Neural Frames is a game-changer for music visuals. As a composer and producer, I'm always looking for tools that elevate the storytelling of sound—and Neural Frames does exactly that.\" - Professional Music Producer</p></blockquote><h3>Cost and Accessibility</h3><p>Many platforms offer free tiers with substantial capabilities, democratising access to professional creative tools. Entry-level creators can produce high-quality content without significant capital investment, whilst professionals benefit from advanced features and extended output lengths available in premium subscriptions.</p><div class=\"highlight-box\"><p><strong>💡 Best Use Cases:</strong> Music videos (Neural Frames), social media clips (Pika Labs), marketing content (Invideo AI), background music (Mubert).</p></div><h3>Technical Capabilities Advance</h3><p>Current AI video generators handle complex visual effects, maintain temporal consistency across frames, and synchronise precisely with audio inputs. The tools understand narrative structure, apply cinematic principles, and generate coherent visual sequences that match musical dynamics and emotional content.</p><div class=\"key-takeaways\"><h3>Key Takeaways</h3><ul><li>AI tools now produce 4K professional music videos in minutes</li><li>Free tiers democratise access to sophisticated creative capabilities</li><li>Independent artists compete with major label production quality</li><li>Platforms specialise in music videos, social content, and marketing</li></ul></div>"
    },
    {
      "id": "3",
      "category": "robotics",
      "title": "Humanoid Robots Enter Commercial Production as Optimus and Unitree Scale",
      "excerpt": "Tesla's Optimus and Unitree's H1 demonstrate practical applications in manufacturing and logistics.",
      "bannerImage": "https://images.unsplash.com/photo-1485827404703-89b55fcc595e?w=900&h=600&fit=crop",
      "thumbnailImage": "https://images.unsplash.com/photo-1485827404703-89b55fcc595e?w=400&h=300&fit=crop",
      "author": "Dr. Jennifer Park",
      "date": "Oct 5, 2025",
      "readTime": "7 min",
      "sourceUrl": "https://www.reuters.com/technology/artificial-intelligence/",
      "isTrending": true,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<h2>Commercial Viability Achieved</h2><p>Humanoid robots have transitioned from research prototypes to practical commercial applications in 2025, with Tesla's Optimus and Unitree's H1 robots demonstrating reliable performance in real-world manufacturing and logistics environments. Multiple companies report successful pilot programmes with plans for expanded deployment.</p><h3>Technical Capabilities Mature</h3><p>Current-generation humanoid robots achieve human-level dexterity for many manipulation tasks, navigate complex environments autonomously, and operate continuously for extended shifts. Advances in actuator technology, computer vision, and AI control systems enable robots to perform tasks previously requiring human workers.</p><ul><li><strong>Manipulation:</strong> Precise object handling, tool operation, assembly tasks</li><li><strong>Mobility:</strong> Stable bipedal locomotion, stair climbing, obstacle avoidance</li><li><strong>Perception:</strong> 360-degree vision, depth sensing, object recognition</li><li><strong>Learning:</strong> Task acquisition through demonstration, continuous improvement</li></ul><h3>Industry Deployment Begins</h3><p>Manufacturing facilities integrate humanoid robots for repetitive assembly tasks, quality inspection, and material handling. Logistics companies deploy robots for warehouse operations, including picking, packing, and inventory management. Early adopters report productivity improvements and reduced workplace injuries.</p><blockquote><p>\"Humanoid robots complement human workers by handling physically demanding and repetitive tasks, allowing employees to focus on higher-value activities requiring creativity and problem-solving.\" - Manufacturing Industry Report</p></blockquote><h3>Consumer Robot Market Emerges</h3><p>Alongside industrial applications, consumer-oriented robot pets and companions gain traction. Products like Loona and various AI virtual pets offer entertainment, companionship, and smart home integration. These devices demonstrate advanced personality simulation and adaptive behaviour based on interaction history.</p><div class=\"highlight-box\"><p><strong>🤖 Market Segments:</strong> Industrial humanoids ($50K-200K), logistics robots ($30K-100K), consumer companions ($500-5K), research platforms ($100K+).</p></div><h3>Economic and Workforce Implications</h3><p>The robotics industry anticipates creating new job categories whilst transforming existing roles. Robot technicians, AI trainers, and automation specialists experience strong demand. Companies emphasise collaborative human-robot workflows rather than wholesale workforce replacement, focusing on augmentation strategies that enhance productivity whilst maintaining employment.</p><div class=\"key-takeaways\"><h3>Key Takeaways</h3><ul><li>Humanoid robots achieve commercial viability in 2025 for specific applications</li><li>Tesla Optimus and Unitree H1 lead industrial deployment efforts</li><li>Consumer robot companions gain popularity with advanced AI personalities</li><li>Industry focuses on human-robot collaboration rather than replacement</li></ul></div>"
    },
    {
      "id": "4",
      "category": "robotics",
      "title": "Advanced FPV Drone Technology and Simulation Training Systems Advance",
      "excerpt": "New simulation platforms enable realistic FPV drone training without physical hardware costs.",
      "bannerImage": "https://images.unsplash.com/photo-1473968512647-3e447244af8f?w=900&h=600&fit=crop",
      "thumbnailImage": "https://images.unsplash.com/photo-1473968512647-3e447244af8f?w=400&h=300&fit=crop",
      "author": "Alex Rodriguez",
      "date": "Oct 4, 2025",
      "readTime": "5 min",
      "sourceUrl": "https://www.dronezon.com/category/drone-news/",
      "isTrending": false,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<h2>Simulation Technology Revolutionises Training</h2><p>Advanced FPV drone simulation platforms now offer photorealistic environments and physics-accurate flight dynamics, enabling pilots to develop skills without expensive hardware or outdoor spaces. These systems replicate real-world conditions including wind, turbulence, and equipment limitations, providing effective training at fraction of traditional costs.</p><h3>Platform Capabilities</h3><p>Modern simulators support multiple controller types, offer extensive environment libraries, and include multiplayer racing competitions. The software tracks performance metrics, provides instant feedback, and structures progressive learning paths from basic hovering through advanced acrobatic manoeuvres.</p><ul><li><strong>Graphics:</strong> Photorealistic rendering, dynamic lighting, weather effects</li><li><strong>Physics:</strong> Accurate aerodynamics, motor response, collision detection</li><li><strong>Environments:</strong> Urban, natural, purpose-built racing courses</li><li><strong>Multiplayer:</strong> Competitive racing, cooperative missions, global leaderboards</li></ul><h3>Hardware Integration</h3><p>Simulators integrate seamlessly with popular FPV controllers and goggles, providing authentic control feel and visual experience. USB connectivity enables plug-and-play operation, whilst low-latency rendering maintains the responsiveness critical for drone piloting skill development.</p><blockquote><p>\"Simulator training accelerates skill acquisition whilst eliminating crash damage costs. Pilots can practice dangerous manoeuvres safely, building confidence before flying actual equipment.\" - FPV Training Institute</p></blockquote><h3>Commercial and Recreational Applications</h3><p>Professional drone operators utilise simulators for scenario training, emergency procedure practice, and equipment familiarisation. Recreational pilots use the software for entertainment, skill maintenance during adverse weather, and exploring new flying styles without equipment risk.</p><div class=\"key-takeaways\"><h3>Key Takeaways</h3><ul><li>Advanced simulators provide photorealistic FPV drone training environments</li><li>Training costs reduced by eliminating hardware damage expenses</li><li>Multiplayer features enable competitive racing and skill comparison</li><li>Professional operators use simulators for scenario and emergency training</li></ul></div>"
    },
    {
      "id": "5",
      "category": "ai-tech",
      "title": "AR/VR Headset Market Expands with New Features and Competitive Pricing",
      "excerpt": "Meta Quest 4 and Apple Vision Pro updates deliver enhanced capabilities at improved price points.",
      "bannerImage": "https://images.unsplash.com/photo-1617802690992-15d93263d3a9?w=900&h=600&fit=crop",
      "thumbnailImage": "https://images.unsplash.com/photo-1617802690992-15d93263d3a9?w=400&h=300&fit=crop",
      "author": "Emma Thompson",
      "date": "Oct 3, 2025",
      "readTime": "6 min",
      "sourceUrl": "https://www.theverge.com/tech",
      "isTrending": false,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<h2>Extended Reality Adoption Accelerates</h2><p>The AR/VR market experiences significant growth in 2025 as improved hardware capabilities, expanded content libraries, and competitive pricing drive consumer adoption. Major manufacturers release updated headsets featuring higher resolution displays, enhanced tracking systems, and longer battery life.</p><h3>Hardware Advancements</h3><p>Current-generation headsets achieve 4K per-eye resolution, 120Hz refresh rates, and pancake lens designs reducing form factors. Advanced hand tracking eliminates controller requirements for many applications, whilst improved inside-out tracking provides accurate spatial positioning without external sensors.</p><ul><li><strong>Display:</strong> 4K per eye, 120Hz refresh, micro-OLED panels</li><li><strong>Tracking:</strong> Inside-out, hand tracking, eye tracking, facial expression</li><li><strong>Audio:</strong> Spatial audio, active noise cancellation, directional speakers</li><li><strong>Connectivity:</strong> Wi-Fi 7, standalone and PC tethered modes</li></ul><h3>Content Ecosystem Expands</h3><p>Major software platforms invest heavily in VR content development, resulting in diverse application libraries spanning gaming, productivity, education, and social experiences. Professional applications emerge for architecture, medical training, and collaborative design work.</p><blockquote><p>\"Extended reality technology transitions from novelty to practical tool as hardware improves and content quality matches traditional computing experiences.\" - XR Industry Analysis</p></blockquote><h3>Market Positioning and Pricing</h3><p>Manufacturers adopt tiered product strategies serving different market segments. Entry-level devices start around $300, mid-range models with standalone capabilities price near $500-700, whilst premium headsets with advanced features reach $3000-4000. This range enables wider accessibility whilst supporting professional applications.</p><div class=\"highlight-box\"><p><strong>🥽 Price Ranges:</strong> Entry ($300-500), Mid-range ($500-1000), Premium ($1000-4000). Consider use case, standalone vs tethered, and content ecosystem.</p></div><h3>Adoption Barriers Diminish</h3><p>Improved ergonomics address comfort concerns for extended use sessions. Expanding content libraries provide compelling reasons for purchase beyond initial novelty. Social VR platforms gain users as network effects create value, whilst productivity applications demonstrate clear workplace benefits justifying enterprise investment.</p><div class=\"key-takeaways\"><h3>Key Takeaways</h3><ul><li>AR/VR headsets achieve 4K resolution and 120Hz refresh rates in 2025</li><li>Competitive pricing from $300-4000 serves diverse market segments</li><li>Content libraries expand across gaming, productivity, and social applications</li><li>Enterprise adoption increases as workplace benefits become evident</li></ul></div>"
    },
    {
      "id": "6",
      "category": "ai-tech",
      "title": "Gaussian Splatting Revolutionises 3D Rendering and Light-Field Displays",
      "excerpt": "New rendering technique enables real-time photorealistic 3D visualisation on consumer hardware.",
      "bannerImage": "https://images.unsplash.com/photo-1633356122544-f134324a6cee?w=900&h=600&fit=crop",
      "thumbnailImage": "https://images.unsplash.com/photo-1633356122544-f134324a6cee?w=400&h=300&fit=crop",
      "author": "Dr. Michael Zhang",
      "date": "Oct 2, 2025",
      "readTime": "6 min",
      "sourceUrl": "https://www.siggraph.org/",
      "isTrending": false,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<h2>Novel Rendering Approach Transforms Graphics</h2><p>Gaussian splatting technology achieves photorealistic 3D rendering at interactive frame rates on consumer hardware, representing a fundamental shift in computer graphics methodology. The technique generates convincing 3D representations from 2D images, enabling applications from virtual production to architectural visualisation.</p><h3>Technical Innovation</h3><p>Unlike traditional polygon-based rendering or neural radiance fields, Gaussian splatting represents scenes as collections of 3D Gaussian distributions. This approach combines the speed of rasterisation with the quality of volumetric rendering, achieving real-time performance whilst maintaining photorealistic appearance.</p><ul><li><strong>Performance:</strong> 60+ fps on mid-range GPUs, 120+ fps on high-end hardware</li><li><strong>Quality:</strong> Photorealistic output, accurate lighting, view-dependent effects</li><li><strong>Efficiency:</strong> Lower memory usage than traditional methods</li><li><strong>Flexibility:</strong> Supports dynamic scenes, editable representations</li></ul><h3>Industry Applications</h3><p>Film and television production studios adopt Gaussian splatting for virtual set extensions and pre-visualisation. Architectural firms utilise the technology for client presentations and design review. Gaming companies experiment with hybrid approaches combining traditional geometry with splat-based rendering for enhanced realism.</p><blockquote><p>Gaussian splatting democratises photorealistic 3D rendering by achieving film-quality results on consumer hardware, eliminating previous barriers to real-time photorealism. - SIGGRAPH Technical Paper</p></blockquote><h3>Light-Field Display Integration</h3><p>The technology pairs naturally with emerging light-field displays, which present different views to each eye without requiring headsets. Combined systems create glasses-free 3D visualisation with correct motion parallax and focus cues, approaching holographic display quality.</p><div class=\"highlight-box\"><p><strong>Performance Impact:</strong> 10-20x faster rendering than neural radiance fields, 2-3x faster than traditional rasterisation with similar quality levels.</p></div><h3>Accessibility and Tools</h3><p>Open-source implementations enable widespread experimentation and adoption. Major 3D software packages integrate Gaussian splatting support, whilst standalone tools facilitate scene capture from photographs or video. The technology's efficiency makes it accessible to independent creators and small studios.</p><div class=\"key-takeaways\"><h3>Key Takeaways</h3><ul><li>Gaussian splatting achieves photorealistic 3D rendering at 60+ fps</li><li>Technology works on consumer hardware without specialised equipment</li><li>Film, architecture, and gaming industries adopt the technique</li><li>Open-source tools enable widespread accessibility and experimentation</li></ul></div>"
    },
    {
      "id": "7",
      "category": "space",
      "title": "James Webb Telescope Discovers Earth-Sized Exoplanets in Habitable Zones",
      "excerpt": "JWST identifies multiple potentially habitable worlds within 100 light-years of Earth.",
      "bannerImage": "https://images.unsplash.com/photo-1614730321146-b6fa6a46bcb4?w=900&h=600&fit=crop",
      "thumbnailImage": "https://images.unsplash.com/photo-1614730321146-b6fa6a46bcb4?w=400&h=300&fit=crop",
      "author": "Dr. Rebecca Foster",
      "date": "Oct 1, 2025",
      "readTime": "7 min",
      "sourceUrl": "https://www.nasa.gov/mission_pages/webb/main/index.html",
      "isTrending": true,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<h2>Breakthrough Exoplanet Discoveries</h2><p>The James Webb Space Telescope has identified seven Earth-sized exoplanets orbiting within the habitable zones of nearby stars, with atmospheric analysis revealing potential biosignatures on two candidates. These discoveries, located between 40-100 light-years from Earth, represent the most promising targets yet for the search for extraterrestrial life.</p><h3>Detection Methods and Capabilities</h3><p>JWST's infrared capabilities enable detailed atmospheric spectroscopy of transiting exoplanets, revealing chemical compositions including water vapour, carbon dioxide, methane, and potentially biogenic gases. The telescope's unprecedented sensitivity detects atmospheric features previously beyond observational limits.</p><ul><li><strong>Water Vapour:</strong> Detected on five of seven planets</li><li><strong>Oxygen Signatures:</strong> Preliminary indications on two candidates</li><li><strong>Temperature Range:</strong> 250-320 Kelvin (Earth-like)</li><li><strong>Orbital Periods:</strong> 20-150 days around red dwarf stars</li></ul><h3>Biosignature Analysis</h3><p>Two planets exhibit atmospheric chemistry potentially indicating biological processes. The presence of oxygen alongside methane suggests possible metabolic activity, whilst carbon dioxide levels align with planetary conditions supporting liquid water. Scientists caution that confirmation requires additional observations ruling out non-biological explanations.</p><blockquote><p>\"These discoveries represent the best opportunities yet to determine whether life exists beyond Earth. The atmospheric signatures are intriguing and warrant intensive follow-up observations.\" - NASA Exoplanet Science Institute</p></blockquote><h3>Red Dwarf Advantages</h3><p>The target stars are M-class red dwarfs, smaller and cooler than our Sun but offering distinct advantages for habitability studies. Their habitable zones lie closer to the star, making planets easier to detect and characterise. Red dwarfs' longevity provides billions of additional years for life to develop compared to Sun-like stars.</p><div class=\"highlight-box\"><p><strong>🌍 Habitability Factors:</strong> Liquid water presence, stable orbits, protective magnetic fields, atmospheric retention, appropriate stellar radiation levels.</p></div><h3>Future Observation Campaigns</h3><p>NASA has allocated additional JWST observation time for detailed atmospheric characterisation of the most promising candidates. Ground-based extremely large telescopes currently under construction will provide complementary data. The discoveries focus astrobiology research efforts and inform target selection for future interstellar probe missions.</p><div class=\"key-takeaways\"><h3>Key Takeaways</h3><ul><li>JWST discovers seven Earth-sized planets in habitable zones within 100 light-years</li><li>Two planets show potential biosignatures requiring further investigation</li><li>Red dwarf stars offer advantages for habitability and observation</li><li>Additional telescope time allocated for detailed atmospheric analysis</li></ul></div>"
    },
    {
      "id": "8",
      "category": "quantum",
      "title": "Quantum Entanglement Achieved Over 1000 Kilometres via Satellite",
      "excerpt": "Chinese researchers demonstrate record-distance quantum communication through space.",
      "bannerImage": "https://images.unsplash.com/photo-1635070041078-e363dbe005cb?w=900&h=600&fit=crop",
      "thumbnailImage": "https://images.unsplash.com/photo-1635070041078-e363dbe005cb?w=400&h=300&fit=crop",
      "author": "Dr. Li Wei",
      "date": "Sep 30, 2025",
      "readTime": "6 min",
      "sourceUrl": "https://www.nature.com/nature/articles",
      "isTrending": false,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<h2>Space-Based Quantum Communication Succeeds</h2><p>Researchers have successfully demonstrated quantum entanglement distribution over 1,200 kilometres using satellite relay systems, marking a crucial milestone toward global quantum communication networks. The achievement overcomes previous distance limitations imposed by ground-based fibre optic transmission.</p><h3>Technical Implementation</h3><p>The system employs satellites as trusted nodes, generating entangled photon pairs and distributing them to ground stations. Advanced adaptive optics compensate for atmospheric disturbances, whilst specialised detectors maintain signal integrity despite losses inherent in space-to-ground transmission.</p><ul><li><strong>Distance:</strong> 1,200 kilometres between ground stations</li><li><strong>Fidelity:</strong> 92% entanglement quality maintained</li><li><strong>Transmission:</strong> Satellite altitude 500 kilometres</li><li><strong>Detection:</strong> Single-photon sensitivity, low noise</li></ul><h3>Quantum Communication Advantages</h3><p>Quantum key distribution provides theoretically unbreakable encryption, as any interception attempt disturbs the quantum states and reveals eavesdropping. This capability addresses growing concerns about quantum computer threats to conventional cryptography, offering future-proof secure communication.</p><blockquote><p>\"Space-based quantum communication enables global secure networks immune to quantum computer attacks, providing essential infrastructure for future information security.\" - Quantum Communication Research Team</p></blockquote><h3>Network Expansion Plans</h3><p>Multiple nations develop quantum satellite constellations for expanded coverage and reliability. Commercial providers explore quantum communication services for financial institutions, government agencies, and critical infrastructure operators requiring highest security levels.</p><div class=\"key-takeaways\"><h3>Key Takeaways</h3><ul><li>Quantum entanglement achieved over 1,200 kilometres via satellite</li><li>System maintains 92% entanglement fidelity through atmosphere</li><li>Technology enables quantum-secure global communication networks</li><li>Commercial quantum communication services under development</li></ul></div>"
    },
    {
      "id": "9",
      "category": "quantum",
      "title": "Time Crystals Demonstrate Practical Applications in Quantum Computing",
      "excerpt": "Exotic matter phase shows promise for maintaining quantum coherence in processors.",
      "bannerImage": "https://images.unsplash.com/photo-1635241161466-541f065683ba?w=900&h=600&fit=crop",
      "thumbnailImage": "https://images.unsplash.com/photo-1635241161466-541f065683ba?w=400&h=300&fit=crop",
      "author": "Dr. Sofia Martinez",
      "date": "Sep 29, 2025",
      "readTime": "6 min",
      "sourceUrl": "https://physics.aps.org/",
      "isTrending": false,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<h2>Exotic Matter Phase Finds Practical Use</h2><p>Time crystals, an exotic phase of matter that exhibits periodic structure in time rather than space, demonstrate practical applications in quantum computing by maintaining coherence significantly longer than conventional qubit implementations. This breakthrough addresses one of quantum computing's fundamental challenges.</p><h3>Time Crystal Properties</h3><p>Unlike ordinary crystals with repeating spatial patterns, time crystals exhibit periodic behaviour in their lowest energy state without consuming energy. This property makes them resistant to thermal noise and environmental disturbances that typically cause quantum decoherence.</p><ul><li><strong>Coherence Time:</strong> 100x improvement over standard qubits</li><li><strong>Stability:</strong> Resistant to thermal noise and vibrations</li><li><strong>Scalability:</strong> Compatible with existing quantum hardware architectures</li><li><strong>Energy:</strong> Minimal power consumption in operation</li></ul><h3>Quantum Computing Integration</h3><p>Researchers successfully integrate time crystal qubits into quantum processors, demonstrating stable operation at higher temperatures than conventional systems require. This advancement could reduce cooling requirements and enable more practical quantum computer designs.</p><blockquote><p>Time crystals represent a paradigm shift in quantum information storage, offering unprecedented stability without active error correction overhead. - Physical Review Letters</p></blockquote><h3>Broader Implications</h3><p>Beyond quantum computing, time crystals may enable ultra-precise sensors, improved atomic clocks, and novel approaches to quantum simulation. The material's unique properties open new avenues for fundamental physics research whilst providing practical technological benefits.</p><div class=\"key-takeaways\"><h3>Key Takeaways</h3><ul><li>Time crystals improve quantum coherence by 100x over standard qubits</li><li>Material naturally resists environmental noise causing decoherence</li><li>Integration succeeds with existing quantum computing hardware</li><li>Applications extend to sensors, clocks, and quantum simulation</li></ul></div>"
    },
    {
      "id": "10",
      "category": "archaeology",
      "title": "Ancient Egyptian Construction Methods Revealed Through Acoustic Analysis",
      "excerpt": "Resonance testing in pyramids uncovers evidence of sophisticated acoustic engineering.",
      "bannerImage": "https://images.unsplash.com/photo-1568322445389-f64ac2515020?w=900&h=600&fit=crop",
      "thumbnailImage": "https://images.unsplash.com/photo-1568322445389-f64ac2515020?w=400&h=300&fit=crop",
      "author": "Dr. Ahmed Hassan",
      "date": "Sep 28, 2025",
      "readTime": "7 min",
      "sourceUrl": "https://www.archaeology.org/",
      "isTrending": false,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<h2>Acoustic Engineering Discovery</h2><p>Comprehensive acoustic testing within Egyptian pyramids reveals deliberate architectural designs creating specific resonance frequencies. Researchers discover that chamber dimensions and passage geometries produce standing waves at frequencies matching ancient Egyptian musical scales, suggesting sophisticated acoustic engineering knowledge.</p><h3>Research Methodology</h3><p>Scientists employed advanced acoustic measurement equipment to map sound propagation throughout pyramid interiors. Multiple frequency sweeps identified resonant modes, whilst comparative analysis with other ancient structures revealed patterns indicating intentional design rather than coincidental acoustics.</p><ul><li><strong>Resonance Peaks:</strong> 110 Hz and 220 Hz matching ancient instruments</li><li><strong>Chamber Design:</strong> Dimensions create standing wave patterns</li><li><strong>Material Selection:</strong> Limestone acoustic properties considered</li><li><strong>Passage Geometry:</strong> Angles enhance specific frequencies</li></ul><h3>Construction Implications</h3><p>The acoustic findings support theories proposing advanced ancient Egyptian technical knowledge. The precision required to achieve specific resonant frequencies suggests sophisticated understanding of mathematics, geometry, and material properties beyond previously attributed capabilities.</p><blockquote><p>The acoustic properties demonstrate intentional engineering rather than accident. Ancient Egyptians possessed remarkable understanding of sound propagation and architectural acoustics. - Archaeological Acoustics Research Team</p></blockquote><h3>Alternative Construction Theories</h3><p>Researchers investigate whether acoustic properties played roles in construction processes. Some theories propose sound vibration usage for moving or positioning massive stone blocks, whilst others suggest ceremonial or spiritual functions for the resonant chambers.</p><div class=\"highlight-box\"><p><strong>Key Frequencies:</strong> 110 Hz fundamental tone and 220 Hz first harmonic, matching ancient Egyptian flutes and percussion instruments discovered in tombs.</p></div><h3>Broader Archaeological Impact</h3><p>The research methodology extends to other ancient sites worldwide, revealing acoustic considerations in structures from Stonehenge to Mayan temples. This emerging field of archaeological acoustics provides new perspectives on ancient cultures' technical capabilities and ceremonial practices.</p><div class=\"key-takeaways\"><h3>Key Takeaways</h3><ul><li>Pyramid chambers exhibit deliberate acoustic resonance at 110 Hz and 220 Hz</li><li>Architecture demonstrates sophisticated understanding of sound propagation</li><li>Frequencies match ancient Egyptian musical instruments</li><li>Findings support theories of advanced ancient technical knowledge</li></ul></div>"
    },
    {
      "id": "11",
      "category": "archaeology",
      "title": "Lost Civilisation Discovered in Amazon Using LiDAR Technology",
      "excerpt": "Remote sensing reveals extensive ancient urban settlement network beneath rainforest canopy.",
      "bannerImage": "https://images.unsplash.com/photo-1516426122078-c23e76319801?w=900&h=600&fit=crop",
      "thumbnailImage": "https://images.unsplash.com/photo-1516426122078-c23e76319801?w=400&h=300&fit=crop",
      "author": "Dr. Maria Santos",
      "date": "Sep 27, 2025",
      "readTime": "6 min",
      "sourceUrl": "https://www.sciencemag.org/",
      "isTrending": false,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<h2>Massive Pre-Columbian Settlement Uncovered</h2><p>LiDAR surveys of the Amazon basin reveal an extensive ancient civilisation occupying over 4,500 square kilometres, featuring planned cities, agricultural infrastructure, and sophisticated water management systems. The discovery challenges previous assumptions about pre-Columbian population densities and technological capabilities in the region.</p><h3>LiDAR Technology Application</h3><p>Airborne laser scanning penetrates dense rainforest canopy, revealing ground topography and archaeological features invisible from the surface. The technology identifies earthworks, building foundations, roads, and agricultural terraces hidden for centuries beneath vegetation.</p><ul><li><strong>Settlement Size:</strong> 4,500 square kilometres of urban development</li><li><strong>Population Estimate:</strong> 500,000 to 1 million inhabitants at peak</li><li><strong>Infrastructure:</strong> Roads, water channels, agricultural terraces</li><li><strong>Time Period:</strong> 500 BCE to 1500 CE occupation</li></ul><h3>Architectural Discoveries</h3><p>The settlement features planned urban layouts with central plazas, residential districts, and monumental architecture. Sophisticated drainage systems managed water during rainy seasons, whilst agricultural terraces supported intensive farming. The complexity rivals contemporary European cities of the same period.</p><blockquote><p>This discovery fundamentally changes our understanding of pre-Columbian Amazon societies. The scale and sophistication demonstrate advanced civilisation equal to any in the ancient world. - Lead Archaeologist</p></blockquote><h3>Environmental Adaptation</h3><p>The civilisation developed sustainable practices for tropical rainforest environments, including agroforestry systems, soil enhancement through biochar, and water management preventing erosion. These techniques maintained productivity for over 2,000 years without causing deforestation or environmental degradation.</p><div class=\"key-takeaways\"><h3>Key Takeaways</h3><ul><li>LiDAR reveals 4,500 square kilometre ancient Amazonian civilisation</li><li>Settlement supported estimated 500,000 to 1 million inhabitants</li><li>Sophisticated infrastructure included roads, water systems, terraced agriculture</li><li>Civilisation practiced sustainable environmental management for millennia</li></ul></div>"
    },
    {
      "id": "12",
      "category": "gaming",
      "title": "Diablo Immortal Tempest Class Update Introduces New Build Possibilities",
      "excerpt": "October update brings balance changes and legendary items expanding Tempest endgame viability.",
      "bannerImage": "https://images.unsplash.com/photo-1538481199705-c710c4e965fc?w=900&h=600&fit=crop",
      "thumbnailImage": "https://images.unsplash.com/photo-1538481199705-c710c4e965fc?w=400&h=300&fit=crop",
      "author": "Jason Miller",
      "date": "Oct 6, 2025",
      "readTime": "5 min",
      "sourceUrl": "https://news.blizzard.com/en-us/diablo-immortal",
      "isTrending": false,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<h2>Major Class Balance Changes</h2><p>Blizzard's October 2025 update for Diablo Immortal introduces significant improvements to the Tempest class, addressing community feedback regarding endgame viability. New legendary items and skill modifications create diverse build options for both PvE and PvP content.</p><h3>Legendary Gear Additions</h3><p>The update adds twelve new legendary items specifically designed for Tempest builds, focusing on synergies between lightning and wind abilities. These items enable specialised playstyles emphasising either sustained damage, burst potential, or crowd control capabilities.</p><ul><li><strong>Storm Conductor's Grasp:</strong> Lightning strikes chain to 5 additional targets</li><li><strong>Gale Force Mantle:</strong> Wind abilities reduce all cooldowns by 15%</li><li><strong>Tempest's Fury:</strong> Critical hits generate storm charges for enhanced abilities</li><li><strong>Cyclone Treads:</strong> Movement speed increases damage by up to 40%</li></ul><h3>Skill Balance Adjustments</h3><p>Core abilities receive modifications improving their effectiveness in challenging content. Lightning Storm damage increases by 25%, Wind Slash cooldown reduces to 8 seconds, and Cyclone duration extends to 12 seconds. These changes address previous concerns about Tempest's performance compared to other classes in high-difficulty rifts.</p><blockquote><p>The Tempest updates create meaningful build diversity whilst maintaining class identity. Players now have viable options for different content types and playstyles. - Diablo Immortal Development Team</p></blockquote><h3>Community Response</h3><p>Early player feedback indicates positive reception, with multiple theorycrafters developing optimised builds for various content. The changes particularly benefit players focusing on challenge rift progression and PvP battlegrounds, where Tempest previously struggled against established classes.</p><div class=\"key-takeaways\"><h3>Key Takeaways</h3><ul><li>October update adds twelve new legendary items for Tempest class</li><li>Core ability damage increased by 25% improving endgame viability</li><li>New items enable diverse build options for PvE and PvP content</li><li>Community response positive with active theorycrafting underway</li></ul></div>"
    },
    {
      "id": "13",
      "category": "gaming",
      "title": "Star Citizen's Pyro System and Server Meshing Enter Testing Phase",
      "excerpt": "Cloud Imperium Games opens public testing for long-awaited server technology and new star system.",
      "bannerImage": "https://images.unsplash.com/photo-1614294148960-9aa740632a87?w=900&h=600&fit=crop",
      "thumbnailImage": "https://images.unsplash.com/photo-1614294148960-9aa740632a87?w=400&h=300&fit=crop",
      "author": "Chris Matthews",
      "date": "Oct 5, 2025",
      "readTime": "6 min",
      "sourceUrl": "https://robertsspaceindustries.com/comm-link",
      "isTrending": false,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<h2>Technical Milestone Achieved</h2><p>Star Citizen's persistent testing universe welcomes the Pyro system alongside dynamic server meshing technology, representing years of development effort addressing scalability challenges. The implementation enables thousands of concurrent players across multiple connected servers, fundamentally changing the game's technical architecture.</p><h3>Server Meshing Implementation</h3><p>The dynamic server meshing system distributes game world segments across multiple servers, seamlessly transitioning players between instances as they travel. This approach eliminates previous player count limitations whilst maintaining persistent universe state across all connected servers.</p><ul><li><strong>Player Capacity:</strong> Increases from 50 to 500+ per instance</li><li><strong>Performance:</strong> Maintains 60+ fps with high player counts</li><li><strong>Persistence:</strong> Universe state maintained across server boundaries</li><li><strong>Scalability:</strong> Additional servers dynamically allocated as needed</li></ul><h3>Pyro System Features</h3><p>The new star system introduces lawless frontier gameplay with unique locations, outposts, and gameplay opportunities. Pyro features distinctive visual aesthetics, dangerous environmental hazards, and emergent PvP scenarios absent from the more regulated Stanton system.</p><blockquote><p>Server meshing represents the technical foundation enabling Star Citizen's vision of a living, breathing universe. Pyro demonstrates what becomes possible with this technology. - Cloud Imperium Games</p></blockquote><h3>RSI Galaxy Ship Status</h3><p>The RSI Galaxy multi-role capital ship progresses through final implementation stages, with release planned for early 2026. The vessel features modular design supporting cargo transport, refueling operations, and mobile construction capabilities, filling crucial logistics roles in larger fleet operations.</p><div class=\"key-takeaways\"><h3>Key Takeaways</h3><ul><li>Dynamic server meshing enables 500+ concurrent players per instance</li><li>Pyro system adds lawless frontier gameplay and unique locations</li><li>Technology maintains persistence across multiple connected servers</li><li>RSI Galaxy capital ship entering final development phases</li></ul></div>"
    },
    {
      "id": "14",
      "category": "gaming",
      "title": "Cities Skylines 2 Road Builder Mod Revolutionises Infrastructure Design",
      "excerpt": "Community-created tool enables unprecedented control over road networks and intersections.",
      "bannerImage": "https://images.unsplash.com/photo-1449824913935-59a10b8d2000?w=900&h=600&fit=crop",
      "thumbnailImage": "https://images.unsplash.com/photo-1449824913935-59a10b8d2000?w=400&h=300&fit=crop",
      "author": "Emma Roberts",
      "date": "Oct 4, 2025",
      "readTime": "5 min",
      "sourceUrl": "https://www.paradoxinteractive.com/games/cities-skylines-ii",
      "isTrending": false,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<h2>Advanced Modding Tools Transform Gameplay</h2><p>The Road Builder Pro mod for Cities Skylines 2 introduces professional-grade infrastructure design tools, enabling players to create complex interchange systems, custom lane configurations, and realistic traffic management solutions. The modification addresses community requests for enhanced road-building capabilities beyond the base game's offerings.</p><h3>Key Features</h3><p>Road Builder Pro provides node-by-node editing, custom lane assignments, elevation control, and intersection design tools matching professional traffic engineering software. Players gain precise control over every aspect of road networks, creating realistic highway systems, roundabouts, and complex urban intersections.</p><ul><li><strong>Lane Control:</strong> Individual lane direction, width, and type assignment</li><li><strong>Node Editing:</strong> Precise intersection geometry and traffic light timing</li><li><strong>Elevation Tools:</strong> Smooth grade transitions and tunnel or bridge integration</li><li><strong>Asset Library:</strong> 200+ road types, barriers, and decorative elements</li></ul><h3>Community Impact</h3><p>The mod achieves over 500,000 downloads within its first month, becoming essential for players focused on realistic city building. Community members share road templates, tutorial videos, and showcase builds demonstrating the tool's capabilities.</p><blockquote><p>Road Builder Pro transforms Cities Skylines 2 from a game into a professional-grade traffic simulation platform. The level of control matches industry-standard planning software. - Modding Community Review</p></blockquote><h3>Performance Optimisation</h3><p>Despite adding complex features, the mod maintains strong performance through efficient code and smart caching systems. Players report minimal frame rate impact even in large cities with extensive custom road networks, demonstrating excellent optimisation practices.</p><div class=\"key-takeaways\"><h3>Key Takeaways</h3><ul><li>Road Builder Pro mod adds professional traffic engineering tools to Cities Skylines 2</li><li>Features include precise lane control, node editing, and elevation management</li><li>Over 500,000 downloads within first month of release</li><li>Maintains strong performance despite complex feature additions</li></ul></div>"
    },
    {
      "id": "15",
      "category": "perth-jobs",
      "title": "Senior 3D Artist Position - Perth Game Development Studio",
      "excerpt": "Established studio seeks experienced 3D artist for AAA project using Unreal Engine 5.",
      "bannerImage": "https://images.unsplash.com/photo-1550745165-9bc0b252726f?w=900&h=600&fit=crop",
      "thumbnailImage": "https://images.unsplash.com/photo-1550745165-9bc0b252726f?w=400&h=300&fit=crop",
      "author": "Perth Gaming Studios HR",
      "date": "Oct 7, 2025",
      "readTime": "4 min",
      "sourceUrl": "https://www.seek.com.au/job/80654321",
      "isTrending": false,
      "isJob": true,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<h2>Role Overview</h2><p>Perth Gaming Studios seeks an experienced Senior 3D Artist to join our growing team working on an ambitious AAA action-adventure title. This role focuses on creating high-quality character models, environmental assets, and props using Unreal Engine 5's latest rendering technologies.</p><h3>Key Responsibilities</h3><ul><li>Create photorealistic 3D character models and environments for Unreal Engine 5</li><li>Develop high-quality textures and materials using PBR workflows</li><li>Collaborate with art directors and technical artists on asset pipelines</li><li>Optimise models for real-time rendering whilst maintaining visual quality</li><li>Mentor junior artists and provide constructive feedback</li><li>Participate in art direction discussions and contribute creative ideas</li></ul><h3>Required Qualifications</h3><ul><li><strong>Experience:</strong> 5+ years in game development or related 3D production</li><li><strong>Software:</strong> Expert proficiency in Maya or Blender, ZBrush, Substance Painter</li><li><strong>Engine:</strong> Strong Unreal Engine experience, familiarity with UE5 features</li><li><strong>Portfolio:</strong> Demonstrate strong character and environment work</li><li><strong>Skills:</strong> Excellent understanding of anatomy, form, and composition</li><li><strong>Communication:</strong> Strong English communication and teamwork abilities</li></ul><h3>Desired Skills</h3><ul><li>Experience with photogrammetry workflows and asset creation</li><li>Knowledge of Houdini for procedural content generation</li><li>Familiarity with performance optimisation for console platforms</li><li>Understanding of rigging and animation technical requirements</li><li>Previous AAA game development experience</li></ul><div class=\"highlight-box\"><p><strong>Location:</strong> Perth CBD office with hybrid work options, 3 days office and 2 days remote. Relocation assistance available for exceptional candidates.</p></div><h3>What We Offer</h3><ul><li><strong>Salary:</strong> $95,000 to $125,000 AUD based on experience</li><li><strong>Benefits:</strong> Health insurance, professional development budget</li><li><strong>Equipment:</strong> High-end workstation, dual monitors, graphics tablet</li><li><strong>Culture:</strong> Collaborative environment, flexible hours, regular team events</li><li><strong>Growth:</strong> Opportunities for career progression and skill development</li></ul><h3>Application Process</h3><p>Submit your CV, cover letter, and portfolio link through SEEK or email careers at perthgamingstudios.com.au. Applications close October 31, 2025. Shortlisted candidates will participate in art tests and multiple interview rounds.</p><div class=\"key-takeaways\"><h3>Key Points</h3><ul><li>Senior 3D Artist role at established Perth game development studio</li><li>Work on AAA action-adventure title using Unreal Engine 5</li><li>Salary range $95K to $125K with hybrid work arrangement</li><li>Requires 5+ years experience and strong portfolio</li></ul></div>"
    },
    {
      "id": "16",
      "category": "perth-jobs",
      "title": "Graphic Designer - Digital Marketing Agency Perth",
      "excerpt": "Growing agency seeks creative graphic designer for client campaigns and brand development.",
      "bannerImage": "https://images.unsplash.com/photo-1626785774573-4b799315345d?w=900&h=600&fit=crop",
      "thumbnailImage": "https://images.unsplash.com/photo-1626785774573-4b799315345d?w=400&h=300&fit=crop",
      "author": "Creative Minds Perth HR",
      "date": "Oct 6, 2025",
      "readTime": "4 min",
      "sourceUrl": "https://www.seek.com.au/job/80654322",
      "isTrending": false,
      "isJob": true,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<h2>Role Overview</h2><p>Creative Minds Perth, an award-winning digital marketing agency, seeks a talented Graphic Designer to join our creative team. This role involves developing visual concepts for diverse client campaigns across digital and print media, contributing to brand identity development, and collaborating with marketing strategists.</p><h3>Key Responsibilities</h3><ul><li>Design engaging graphics for digital campaigns, social media, and websites</li><li>Create brand identity systems including logos, style guides, and templates</li><li>Develop print materials such as brochures, posters, and packaging</li><li>Collaborate with copywriters, marketers, and account managers</li><li>Present design concepts to clients and incorporate feedback</li><li>Maintain brand consistency across all client touchpoints</li></ul><h3>Required Qualifications</h3><ul><li><strong>Education:</strong> Diploma or degree in Graphic Design or equivalent</li><li><strong>Experience:</strong> 2 to 4 years in agency or corporate design environment</li><li><strong>Software:</strong> Advanced Adobe Creative Suite including Photoshop, Illustrator, InDesign</li><li><strong>Portfolio:</strong> Demonstrate diverse design work across digital and print</li><li><strong>Skills:</strong> Strong typography, colour theory, and layout expertise</li><li><strong>Attributes:</strong> Creative thinking, attention to detail, time management</li></ul><h3>Desired Skills</h3><ul><li>Experience with motion graphics and video editing using After Effects and Premiere Pro</li><li>Knowledge of web design principles and responsive layouts</li><li>Familiarity with UI and UX design concepts</li><li>Understanding of digital marketing and social media platforms</li><li>Photography or illustration skills</li></ul><div class=\"highlight-box\"><p><strong>Location:</strong> Northbridge office, Perth. Full-time position with flexible start times between 7:30am and 9:30am. Occasional remote work available.</p></div><h3>What We Offer</h3><ul><li><strong>Salary:</strong> $65,000 to $80,000 AUD plus superannuation</li><li><strong>Benefits:</strong> Professional development opportunities, Adobe Creative Cloud licence</li><li><strong>Environment:</strong> Modern office space, collaborative team culture</li><li><strong>Perks:</strong> Free parking, regular team lunches, birthday leave</li><li><strong>Growth:</strong> Clear career progression pathways to Senior Designer or Art Director</li></ul><h3>Application Instructions</h3><p>Apply via SEEK with your CV, cover letter explaining your design philosophy, and portfolio link showcasing your best work. Applications close October 28, 2025. First-round interviews will include a design challenge.</p><div class=\"key-takeaways\"><h3>Key Points</h3><ul><li>Graphic Designer role at Perth digital marketing agency</li><li>Requires 2 to 4 years experience and strong Adobe Creative Suite skills</li><li>Salary from $65K to $80K with professional development opportunities</li><li>Northbridge location with flexible hours and occasional remote work</li></ul></div>"
    },
     {
      "id": "17",
      "category": "perth-jobs",
      "title": "IT Support Specialist - Managed Services Provider Perth",
      "excerpt": "MSP seeks technical support specialist for client infrastructure management and helpdesk services.",
      "bannerImage": "https://images.unsplash.com/photo-1573164713714-d95e436ab8d6?w=900&h=600&fit=crop",
      "thumbnailImage": "https://images.unsplash.com/photo-1573164713714-d95e436ab8d6?w=400&h=300&fit=crop",
      "author": "TechServe Perth Recruitment",
      "date": "Oct 5, 2025",
      "readTime": "4 min",
      "sourceUrl": "https://www.seek.com.au/job/80654323",
      "isTrending": false,
      "isJob": true,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<h2>Role Overview</h2><p>TechServe Perth, a leading managed services provider, seeks an IT Support Specialist to deliver technical support and infrastructure management services to our diverse client base. This role combines helpdesk responsibilities with hands-on technical work, offering excellent opportunities for skill development.</p><h3>Key Responsibilities</h3><ul><li>Provide first and second-level technical support via phone, email, and remote access</li><li>Troubleshoot hardware, software, and network connectivity issues</li><li>Perform onsite client visits for installations, maintenance, and complex issues</li><li>Manage user accounts, permissions, and security settings in Active Directory</li><li>Document support tickets, solutions, and procedures in knowledge base</li><li>Assist with server maintenance, backups, and disaster recovery procedures</li><li>Support Microsoft 365 administration and cloud service implementations</li></ul><h3>Required Qualifications</h3><ul><li><strong>Experience:</strong> 1 to 3 years in IT support or helpdesk environment</li><li><strong>Technical:</strong> Windows 10 and 11, Windows Server, Active Directory, Microsoft 365</li><li><strong>Networking:</strong> TCP/IP, DNS, DHCP, VPN, basic firewall configuration</li><li><strong>Certifications:</strong> CompTIA A+ or Microsoft certification desirable</li><li><strong>Licence:</strong> Valid WA driver’s licence for client site visits</li><li><strong>Communication:</strong> Excellent customer service and problem-solving skills</li></ul><h3>Desired Skills</h3><ul><li>Experience with backup solutions such as Veeam or Acronis</li><li>Knowledge of virtualisation technologies including Hyper-V or VMware</li><li>Familiarity with RMM tools such as ConnectWise or Datto</li><li>Understanding of cybersecurity best practices</li><li>Previous MSP or multi-client environment experience</li></ul><div class=\"highlight-box\"><p><strong>Location:</strong> Osborne Park office, Perth. Monday to Friday from 8:00am to 5:00pm with occasional after-hours work for maintenance windows. Company vehicle provided for client visits.</p></div><h3>What We Offer</h3><ul><li><strong>Salary:</strong> $60,000 to $75,000 AUD based on experience</li><li><strong>Benefits:</strong> Company vehicle, mobile phone, laptop</li><li><strong>Training:</strong> Professional certification support and ongoing technical training</li><li><strong>Culture:</strong> Supportive team environment with experienced mentors</li><li><strong>Progression:</strong> Clear pathway to Senior Support or Systems Administrator roles</li></ul><h3>Application Process</h3><p>Submit your CV and cover letter via SEEK outlining your technical experience and relevant certifications. Applications close October 30, 2025. Technical assessment and multiple interviews required for shortlisted candidates.</p><div class=\"key-takeaways\"><h3>Key Points</h3><ul><li>IT Support Specialist role at Perth managed services provider</li><li>Requires 1 to 3 years experience with Windows and Microsoft 365</li></ul></div>"
     }
  ]
}


