{
  "categories": [
    {
      "id": "all",
      "name": "All",
      "active": true
    },
    {
      "id": "ai-tech",
      "name": "AI & Tech",
      "active": false
    },
    {
      "id": "history-archaeology",
      "name": "History",
      "active": false
    },
    {
      "id": "science-space",
      "name": "Science",
      "active": false
    }
  ],
  "trending": [
    {
      "articleId": "roman-sailor-grave-marker-new-orleans",
      "reason": "A 1,900-year-old Roman artifact, missing since WWII, was unexpectedly discovered in a New Orleans backyard."
    }
  ],
  "articles": [
    {
      "id": "roman-sailor-grave-marker-new-orleans",
      "category": "history-archaeology",
      "title": "Roman Sailor's 1,900-Year-Old Grave Marker Found in New Orleans",
      "excerpt": "A 2nd-century Roman grave marker, missing from an Italian museum since it was bombed in WWII, has been discovered during a routine yard cleanup in New Orleans.",
      "bannerImage": "https://i.natgeofe.com/n/759b6c7a-4251-4d0f-9602-525a74e2d3b5/roman-tombstone-found-new-orleans-yard-national-geographic-picture_3x2.jpg",
      "thumbnailImage": "https://www.thehistoryblog.com/wp-content/uploads/2025/10/Grave-marker-of-Sextus-Congenius-Verus-inscription.jpg",
      "author": "The History Blog",
      "date": "Oct 11, 2025",
      "readTime": "4 min",
      "sourceUrl": "https://www.thehistoryblog.com/archives/category/modernish",
      "isTrending": true,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<h2>Roman Artifact Missing Since WWII Surfaces in US Backyard</h2><p>A 2nd-century grave marker for a Roman sailor has been discovered in a New Orleans backyard, solving a decades-old mystery of the artifact's whereabouts. The tombstone, belonging to a sailor named Sextus Congenius Verus, was housed in the National Archaeological Museum of Civitavecchia, Italy, which was destroyed by Allied bombing during World War II. The recovery began when a couple clearing undergrowth in their yard found the inscribed marble slab and contacted local academics for assistance.</p><h3>An Unlikely Journey Across the Atlantic</h3><p>The mystery of how the ancient Roman artifact travelled from Italy to New Orleans has now been solved. The previous homeowner, Erin Scott O'Brien, revealed that the stone belonged to her grandfather, Master Sergeant Charles E. Paddock, who was stationed in Italy during the war. He brought the tablet back to the United States and kept it in a display case. His family, unaware of its historical significance, later placed it in the garden as a decorative stone, where it remained forgotten until the recent discovery.</p><h3>Historical Significance and Repatriation</h3><p>Experts quickly identified the inscription, which details the life and military service of Sextus Congenius Verus, a sailor in the praetorian fleet from the Bessi tribe who lived for 42 years. Such inscriptions provide valuable information about
