 
{
  "categories": [
    {
      "id": "all",
      "name": "All",
      "active": true
    },
    {
      "id": "artificial-intelligence-and-technology",
      "name": "AI & Tech",
      "active": false
    },
    {
      "id": "science-and-space-exploration",
      "name": "Science & Space",
      "active": false
    },
    {
      "id": "perth-local-services-and-lifestyle",
      "name": "Perth Lifestyle",
      "active": false
    }
  ],
  "trending": [
    {
      "articleId": "skyways-drone-offshore-wind-delivery",
      "reason": "Demonstrates a significant leap in logistics for renewable energy, cutting supply times from 2 hours to just 26 minutes."
    },
    {
      "articleId": "webb-catches-supernova-before-and-after",
      "reason": "For the first time, astronomers have used the JWST to capture 'before and after' images of a supernova, solving a major cosmic mystery."
    },
    {
      "articleId": "samsung-vr-headset-unveiling",
      "reason": "Samsung has officially announced the launch event for its highly anticipated Apple Vision Pro competitor, signalling a new major player in the XR market."
    }
  ],
  "articles": [
    {
      "id": "skyways-drone-offshore-wind-delivery",
      "category": "artificial-intelligence-and-technology",
      "title": "Skyways Drone Cuts Offshore Wind Supply Time From 2 Hours To 26 Mins",
      "excerpt": "Skyways has completed the world's first repeated autonomous cargo drone deliveries directly to offshore wind turbines, drastically reducing logistics time and increasing efficiency.",
      "bannerImage": "https://i.ytimg.com/vi/a-kCjI-t4-8/maxresdefault.jpg",
      "thumbnailImage": "https://www.unmannedairspace.info/wp-content/uploads/2023/10/Skyways-V2.jpg",
      "author": "GlobeNewswire",
      "date": "Oct 16, 2025",
      "readTime": "3 min",
      "sourceUrl": "https://dronexl.co/2025/10/16/skyways-autonomous-drone-offshore-wind/",
      "isTrending": true,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<div class=\"article-hero\"><img src=\"https://www.unmannedairspace.info/wp-content/uploads/2023/10/Skyways-V2.jpg\" alt=\"A Skyways V2 drone flying over the ocean towards an offshore wind turbine.\" class=\"hero-image\"><div class=\"hero-caption\">The Skyways V2 aircraft demonstrated its long-range delivery capabilities to the Arkona Offshore Windfarm.</div></div><h2>Autonomous Drones Revolutionise Offshore Wind Logistics</h2><p class=\"lead-paragraph\">Skyways, in partnership with RWE and Skyports Drone Services, has successfully executed the first-ever autonomous drone deliveries directly to offshore wind turbines, cutting transport time for essential supplies from two hours to just 26 minutes. The operation took place at the Arkona Windfarm in the Baltic Sea, proving the viability of using long-range unmanned aircraft in harsh marine environments.</p><div class=\"article-columns\"><div class=\"content-column\"><h3>A New Era of Efficiency</h3><p>During a three-week trial, the Skyways V2 aircraft performed automated 50-mile round trips from a base in Germany to the wind farm. The drones carried payloads of up to 10 kilograms (22 pounds) and withstood winds of nearly 30 knots to make precise cargo drops to the turbines. This on-demand service represents a significant improvement over traditional crew transfer vessels, which operate on fixed schedules and take far longer to complete the same journey.</p><div class=\"pullquote\"><p>\"At Skyways, our mission is simple: deliver what matters, where it matters, when it matters.\" <span class=\"attribution\">&mdash; Charles Acknin, CEO of Skyways</span></p></div><p>The project aimed to validate the role of drones in making the offshore supply chain more flexible, efficient, and sustainable. The flights were conducted Beyond Visual Line of Sight (BVLOS), following a predefined flight path without reliance on mobile networks.</p></div></div><h3>Technical Capabilities</h3><div class=\"stats-grid\"><div class=\"stat-box\"><span class=\"stat-number\">26 Mins</span><span class=\"stat-label\">Delivery Time via Drone</span></div><div class=\"stat-box\"><span class=\"stat-number\">2 Hours</span><span class=\"stat-label\">Delivery Time via Boat</span></div><div class=\"stat-box\"><span class=\"stat-number\">50 Miles</span><span class=\"stat-label\">Automated Round Trip</span></div><div class=\"stat-box\"><span class=\"stat-number\">10 kg</span><span class=\"stat-label\">Cargo Capacity</span></div></div><p>The Skyways V2 aircraft is a dual-hybrid vehicle, using electric motors for vertical takeoff and landing and a heavy-fuel engine for its long-range cruise. This design gives it an operational range of nearly 500 miles. Over the trial, the aircraft flew more than 2,500 kilometres, accumulating over 65 hours of flight time.</p><div class=\"key-takeaways magazine-style\"><h3>Key Takeaways</h3><ul class=\"takeaway-list\"><li><span class=\"takeaway-bullet\">&#10004;</span> Autonomous drones reduced delivery times to offshore turbines from 2 hours to 26 minutes.</li><li><span class=\"takeaway-bullet\">&#10004;</span> The successful trials prove the viability of BVLOS drone logistics in harsh offshore environments.</li><li><span class=\"takeaway-bullet\">&#10004;</span> The technology offers a more flexible, efficient, and sustainable alternative to traditional supply vessels.</li><li><span class=\"takeaway-bullet\">&#10004;</span> RWE plans to further integrate cargo drones into its global offshore wind fleet operations.</li></ul></div>"
    },
    {
      "id": "webb-catches-supernova-before-and-after",
      "category": "science-and-space-exploration",
      "title": "For the First Time, Webb Catches Supernova Before and After",
      "excerpt": "In an unprecedented achievement, the James Webb Space Telescope has captured images of a massive star both before and after its cataclysmic supernova explosion.",
      "bannerImage": "https://s.yimg.com/ny/api/res/1.2/Z4Jz_n0aX7Q.I1iYl.gLhA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03NzU-/https://media.zenfs.com/en/mashable/dd8f85f31c2b5d4f3b61031d2551a14a",
      "thumbnailImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2023/07/webb_captures_a_star_in_the_making/25026930-1-eng-GB/Webb_captures_a_star_in_the_making_card_medium.jpg",
      "author": "Mashable",
      "date": "Oct 16, 2025",
      "readTime": "3 min",
      "sourceUrl": "https://mashable.com/article/nasa-james-webb-space-telescope-supernova-before-after",
      "isTrending": true,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<div class=\"article-hero\"><img src=\"https://s.yimg.com/ny/api/res/1.2/Z4Jz_n0aX7Q.I1iYl.gLhA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03NzU-/https://media.zenfs.com/en/mashable/dd8f85f31c2b5d4f3b61031d2551a14a\" alt=\"A James Webb Space Telescope image of the galaxy NGC 1637, with a highlighted box around the location where the supernova occurred.\" class=\"hero-image\"><div class=\"hero-caption\">A combined Webb and Hubble view of spiral galaxy NGC 1637, where the supernova SN 2025pht occurred.</div></div><h2>Webb's Unprecedented View of a Star's Demise</h2><p class=\"lead-paragraph\">An international team of astronomers has used NASA's James Webb Space Telescope (JWST) to capture the first-ever 'before and after' images of a supernova, identifying the original star that exploded on June 29, 2025. This rare accomplishment provides the clearest look yet at a dying star and may solve a long-standing cosmic mystery.</p><div class=\"article-columns\"><div class=\"content-column\"><h3>Solving the 'Red Supergiant Problem'</h3><p>The supernova, named SN 2025pht, occurred in the galaxy NGC 1637, approximately 40 million light-years from Earth. By analysing archival Webb images of that same region of space, scientists were able to pinpoint the progenitor star. The data revealed it was a massive red supergiant cloaked in a thick shroud of dust.</p><div class=\"inline-image-right\"><img src=\"https://www.nasa.gov/wp-content/uploads/2023/11/stsci-01he9azk3hxwtryksm117902t4.png?resize=1600,900\" alt=\"Artistic impression of a red supergiant star.\" class=\"content-image\"><p class=\"image-caption\">Artist's illustration of a massive red supergiant star.</p></div><p>This discovery helps explain why astronomers rarely see red supergiants explode, even though models predict they should account for most core-collapse supernovae. The new findings suggest the stars do explode but are often hidden from view by heavy dust clouds, which Webb's infrared vision can penetrate.</p><div class=\"pullquote\"><p>\"Only now, with [Webb], do we finally have the quality of data and infrared observations that allow us to say precisely the exact type of red supergiant that exploded.\" <span class=\"attribution\">&mdash; Charlie Kilpatrick, Northwestern University</span></p></div><p>The star was roughly 100,000 times brighter than the sun, but the dense dust made it appear more than 100 times dimmer in visible light. This marks the first time JWST has been used to directly identify a supernova progenitor star, opening a new era for studying how massive stars live and die.</p></div></div><div class=\"key-takeaways magazine-style\"><h3>Key Takeaways</h3><ul class=\"takeaway-list\"><li><span class=\"takeaway-bullet\">&#10004;</span> JWST captured the first-ever 'before and after' images of a star exploding as a supernova.</li><li><span class=\"takeaway-bullet\">&#10004;</span> The progenitor was a massive red supergiant star, hidden within a thick cloud of dust.</li><li><span class=\"takeaway-bullet\">&#10004;</span> This discovery may solve the mystery of why so few red supergiant supernovae are observed.</li><li><span class=\"takeaway-bullet\">&#10004;</span> Webb's infrared capabilities allow it to see through cosmic dust that obscures other telescopes.</li></ul></div>"
    },
    {
      "id": "samsung-vr-headset-unveiling",
      "category": "artificial-intelligence-and-technology",
      "title": "Samsung's VR Headset Will Be Unveiled on October 21",
      "excerpt": "Samsung has officially announced its next Galaxy event, where it will finally reveal 'Project Moohan,' its highly anticipated XR headset positioned as a direct rival to the Apple Vision Pro.",
      "bannerImage": "https://www.notebookcheck.net/fileadmin/Notebooks/News/_nc3/samsung_galaxy_xr_mixed_reality_headset_4.jpg",
      "thumbnailImage": "https://www.cnet.com/a/img/resize/0d0e6e4a2d8c4e0c46a2a90a424a1068df6d28c3/hub/2024/02/27/1553c026-9d32-421b-a567-27038e2354a9/samsung-google-qualcomm-xr-headset-logo.jpg?auto=webp&fit=crop&height=675&width=1200",
      "author": "GamesRadar+",
      "date": "Oct 15, 2025",
      "readTime": "3 min",
      "sourceUrl": "https://www.gamesradar.com/samsungs-vr-headset-will-finally-be-unveiled-on-october-21-and-it-could-right-the-wrongs-of-apple-vision-pro/",
      "isTrending": true,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<div class=\"article-hero\"><img src=\"https://www.notebookcheck.net/fileadmin/Notebooks/News/_nc3/samsung_galaxy_xr_mixed_reality_headset_4.jpg\" alt=\"A sleek, futuristic XR headset from Samsung, codenamed Project Moohan.\" class=\"hero-image\"><div class=\"hero-caption\">Samsung's Project Moohan is expected to challenge Apple's Vision Pro in the high-end XR market.</div></div><h2>Samsung Enters the XR Arena with 'Project Moohan'</h2><p class=\"lead-paragraph\">Samsung has confirmed it will unveil its new extended reality (XR) headset, codenamed 'Project Moohan', on October 21 at an event titled 'Worlds Wide Open'. The announcement positions Samsung to directly compete with Apple's Vision Pro, signalling a new major rivalry in the premium spatial computing market.</p><div class=\"article-columns\"><div class=\"content-column\"><h3>A New Partnership for a New Reality</h3><p>Developed in a landmark partnership with Google and Qualcomm, the headset will be the first device to run on the new Android XR platform, an operating system optimised for immersive experiences. It is powered by Qualcomm's latest Snapdragon XR2+ Gen 2 chip, designed specifically for mixed-reality environments. Samsung describes the device as an 'AI-optimised XR platform' that blends 'everyday utility with immersive new experiences'.</p><div class=\"highlight-box info-box\"><p><strong>&#128161; What to Expect:</strong> The event, streaming live on Samsung's YouTube channel, is expected to reveal the headset's official name, full specifications, pricing, and availability.</p></div><h3>Addressing the Competition</h3><p>Early reports suggest Project Moohan (rumoured to be commercially named Galaxy XR) aims to improve upon the Apple Vision Pro in key areas. It is rumoured to feature higher resolution displays with over 29 million pixels and a lighter build, weighing around 545 grams compared to the Vision Pro's 600-650 grams. While pricing has not been confirmed, the headset is expected to be more accessible than Apple's $3,499 device. Reservations for the new headset are already open, offering early adopters a $100 credit.</p></div></div><div class=\"key-takeaways magazine-style\"><h3>Key Takeaways</h3><ul class=\"takeaway-list\"><li><span class=\"takeaway-bullet\">&#10004;</span> Samsung will unveil its Apple Vision Pro competitor, codenamed Project Moohan, on October 21.</li><li><span class=\"takeaway-bullet\">&#10004;</span> It is the first device from a partnership between Samsung, Google, and Qualcomm, running the new Android XR platform.</li><li><span class=\"takeaway-bullet\">&#10004;</span> The headset is rumoured to be lighter and have a higher resolution than the Apple Vision Pro.</li><li><span class=\"takeaway-bullet\">&#10004;</span> The launch signals a major new competitor in the high-end spatial computing market.</li></ul></div>"
    },
    {
      "id": "apple-vision-pro-m5-upgrade",
      "category": "artificial-intelligence-and-technology",
      "title": "Apple's Upgraded Vision Pro With M5 Chip Still Costs $3,500",
      "excerpt": "Apple has announced an upgraded Vision Pro featuring the new M5 processor for significantly faster performance and an improved display, but the premium price remains unchanged.",
      "bannerImage": "https://images.macrumors.com/t/b88-1g21E53J6my-OQ2YJ352aGA=/1600x/article-new/2024/02/apple-vision-pro-on-table.jpg",
      "thumbnailImage": "https://www.apple.com/v/apple-vision-pro/c/images/overview/design/design_hero_1__m4n6769u9sqe_large.jpg",
      "author": "Variety",
      "date": "Oct 15, 2025",
      "readTime": "3 min",
      "sourceUrl": "https://variety.com/2025/digital/news/apple-vision-pro-upgrade-m5-chip-1236268819/",
      "isTrending": false,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<div class=\"article-hero\"><img src=\"https://www.apple.com/v/apple-vision-pro/c/images/overview/design/design_hero_1__m4n6769u9sqe_large.jpg\" alt=\"The Apple Vision Pro headset shown in a lifestyle setting.\" class=\"hero-image\"><div class=\"hero-caption\">The upgraded Vision Pro includes the powerful M5 chip and a new Dual Knit Band for comfort.</div></div><h2>Apple Boosts Vision Pro with M5 Chip</h2><p class=\"lead-paragraph\">Apple has announced an upgraded version of the Vision Pro, now equipped with the powerful M5 chip. The refresh delivers a significant leap in performance, a higher refresh rate display, and improved battery life, though the starting price remains firm at $3,499.</p><div class=\"article-columns\"><div class=\"content-column\"><h3>Performance and Display Enhancements</h3><p>The new M5 processor, built on a 3-nanometre process, features a 10-core CPU, a 10-core GPU, and a 16-core Neural Engine for AI tasks that is reportedly 50% faster than its predecessor. This upgrade promises smoother overall performance and sharper visuals. The custom micro-OLED displays now support a higher refresh rate of up to 120Hz, which will reduce motion blur and create a more fluid user experience. The headset still works in tandem with the R1 chip, which processes input from the 12 cameras, five sensors, and six microphones in real-time.</p><blockquote class=\"expert-quote\"><p>\"Apple's Vision Pro refresh lands with meaningful improvements wrapped in the same premium price tag that keeps most mortals at bay.\" <span class=\"source-attribution\">&mdash; Yahoo</span></p></blockquote><h3>Design and Battery Improvements</h3><p>Along with the internal upgrades, Apple has introduced a new Dual Knit Band designed for a more comfortable and balanced fit, available in three sizes. Battery life has also seen an improvement, with the new model offering up to 2.5 hours of general use and up to 3 hours of video playback on a single charge. Despite the meaningful upgrades, the unchanged price point suggests Apple continues to position the Vision Pro primarily as a high-end device for developers and enterprise users rather than the mass market.</p></div></div><div class=\"key-takeaways magazine-style\"><h3>Key Takeaways</h3><ul class=\"takeaway-list\"><li><span class=\"takeaway-bullet\">&#10004;</span> The Apple Vision Pro has been upgraded with the new, more powerful M5 chip.</li><li><span class=\"takeaway-bullet\">&#10004;</span> Key improvements include a faster 10-core CPU/GPU, a 120Hz display refresh rate, and longer battery life.</li><li><span class=\"takeaway-bullet\">&#10004;</span> A new Dual Knit Band is included for improved comfort.</li><li><span class=\"takeaway-bullet\">&#10004;</span> The starting price remains unchanged at $3,499.</li></ul></div>"
    },
    {
      "id": "drones-emergency-communications-collaboration",
      "category": "artificial-intelligence-and-technology",
      "title": "New Collaboration Sends Drones Flying With Emergency Communications",
      "excerpt": "A new force in physical security is emerging through the integration of autonomous drone systems with traditional security devices, significantly enhancing threat detection and protection.",
      "bannerImage": "https://www.ecmweb.com/files/base/ebm/ecmweb/image/2021/09/16x9/Drone_surveillance.613f751433878.png",
      "thumbnailImage": "https://www.kentonbrothers.com/wp-content/uploads/2024/01/AdobeStock_633649479-1-1024x576.jpeg",
      "author": "ECM Web",
      "date": "Oct 15, 2025",
      "readTime": "3 min",
      "sourceUrl": "https://www.ecmweb.com/automation/media-gallery/21282247/new-collaboration-sends-drones-flying",
      "isTrending": false,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<div class=\"article-hero\"><img src=\"https://www.kentonbrothers.com/wp-content/uploads/2024/01/AdobeStock_633649479-1-1024x576.jpeg\" alt=\"A security drone hovering and monitoring a secure facility at dusk.\" class=\"hero-image\"><div class=\"hero-caption\">Autonomous drones are becoming a transformative tool in modern physical security strategies.</div></div><h2>Drones Elevate Physical Security and Emergency Response</h2><p class=\"lead-paragraph\">The integration of autonomous drones into physical security systems is creating a powerful new layer of protection for critical infrastructure, industrial facilities, and corporate campuses. By combining aerial surveillance with traditional ground-based security, organisations can achieve more comprehensive coverage and dramatically faster response times to threats.</p><div class=\"article-columns\"><div class=\"content-column\"><h3>Rapid, Autonomous Threat Assessment</h3><p>When a security alarm is triggered, an autonomous drone can be dispatched to the location within seconds. This provides security teams with a live video feed and immediate situational awareness before human personnel can arrive on the scene. This capability allows for the quick verification of threats, differentiation from false alarms, and more effective deployment of on-ground resources. Drones can navigate obstacles and access hard-to-reach areas like rooftops, eliminating the blind spots often left by fixed cameras.</p><div class=\"pullquote\"><p>\"Autonomy is the key benefit that drones integrated with AI can bring to physical security.\" <span class=\"attribution\">&mdash; Scylla AI</span></p></div><p>AI-integrated drones can perform tedious monitoring of large areas reliably and continuously. In an emergency, they can provide an autonomous response, such as following a suspect and streaming real-time tracking information to law enforcement. This enhances safety for human responders by identifying potential hazards before they enter a volatile situation.</p><h3>Beyond Surveillance</h3><p>The application of drones in emergency response extends beyond just surveillance. They are increasingly used in firefighting to detect hotspots, in police operations for reconnaissance, and in disaster management for rapid damage assessment. In search and rescue missions, drones can locate missing persons and deliver essential supplies to dangerous or inaccessible locations. The mere presence of aerial surveillance also acts as a powerful deterrent to potential intruders.</p></div></div><div class=\"key-takeaways magazine-style\"><h3>Key Takeaways</h3><ul class=\"takeaway-list\"><li><span class=\"takeaway-bullet\">&#10004;</span> Integrating autonomous drones with existing security systems provides a dynamic layer of protection.</li><li><span class=\"takeaway-bullet\">&#10004;</span> Drones offer rapid response to alarms, providing live video feeds and situational awareness within seconds.</li><li><span class=\"takeaway-bullet\">&#10004;</span> AI-powered drones can autonomously patrol large areas, track suspects, and inspect hard-to-reach locations.</li><li><span class=\"takeaway-bullet\">&#10004;</span> The technology improves safety for human responders and acts as a strong deterrent to crime.</li></ul></div>"
    },
    {
      "id": "job-senior-3d-visualisation-artist",
      "category": "perth-local-services-and-lifestyle",
      "title": "Hames Sharley Seeks Senior 3D Visualisation Artist in Perth",
      "excerpt": "Hames Sharley, a leading multidisciplinary design firm, is seeking a talented and experienced Senior 3D Visualisation Artist to join their creative team in the Perth studio.",
      "bannerImage": "https://media.licdn.com/dms/image/D5616AQG53NqsAsI7WQ/profile-displaybackgroundimage-shrink_350_1400/0/1668560120202?e=1734134400&v=beta&t=Gq1sY-aQW1FzXb_sS_j2V9yYyXo1-9tY7rZ0-Z6K9z4",
      "thumbnailImage": "https://media.licdn.com/dms/image/C560BAQHoRze2aGN2zg/company-logo_200_200/0/1631326442654?e=1736937600&v=beta&t=jWbT2V6b2-g8L1zH7r_4k3nJ2qG7c8sYxYwK5wM9p8M",
      "author": "Hames Sharley",
      "date": "Oct 15, 2025",
      "readTime": "2 min",
      "sourceUrl": "https://www.linkedin.com/jobs/view/senior-3d-visualisation-artist-at-hames-sharley-3951239637",
      "isTrending": false,
      "isJob": true,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<div class=\"job-header\"><h2>Role Overview</h2><div class=\"job-meta\"><span class=\"job-type\">Full-time</span><span class=\"job-location\">&#128205; Perth, WA</span><span class=\"job-posted\">Posted: Oct 15, 2025</span></div></div><p class=\"job-intro\">Hames Sharley, a leading national design practice, has an exciting opportunity for a Senior 3D Visualisation Artist to join their supportive and collaborative team in the Perth Studio. This role involves working on a diverse portfolio of high-profile projects across Australia, creating compelling and high-quality architectural visualisations.</p><div class=\"job-section\"><h3>Key Responsibilities</h3><ul class=\"responsibility-list\"><li>Produce high-quality 3D architectural imagery, animations, and renderings.</li><li>Collaborate with architectural and interior design teams to interpret concepts and bring them to life.</li><li>Manage visualisation workflow from modelling and texturing to lighting and post-production.</li><li>Contribute to the creative direction of projects and mentor junior artists.</li><li>Work across a variety of project types including urban design, retail, residential, and commercial.</li></ul></div><div class=\"job-section\"><h3>Required Qualifications</h3><ul class=\"qualification-list\"><li><strong>Experience:</strong> Proven experience in a similar role within an architectural or design practice.</li><li><strong>Technical Skills:</strong> Expertise in 3D Studio Max, V-Ray, Corona, and Adobe Creative Suite (Photoshop, After Effects). Experience with Unreal Engine and other real-time rendering software is highly regarded.</li><li><strong>Portfolio:</strong> A strong portfolio showcasing high-quality architectural visualisation work.</li><li><strong>Soft Skills:</strong> Excellent communication skills, a keen eye for detail, composition, and colour, and the ability to work collaboratively in a team environment.</li></ul></div><div class=\"job-benefits\"><h3>What We Offer</h3><ul class=\"benefits-list\"><li>A creative and collaborative studio environment.</li><li>The opportunity to work on significant and diverse national projects.</li><li>A commitment to professional development and work-life balance.</li><li>A culture that is supportive, inclusive, and focused on design excellence.</li></ul></div><div class=\"highlight-box location-box\"><p><strong>&#128205; Location:</strong> Perth, Western Australia (In-studio)</p></div><div class=\"application-section\"><h3>Application Instructions</h3><p>To apply, please submit your CV and a comprehensive portfolio showcasing your best work through the original LinkedIn job posting. A cover letter outlining your suitability for the role is also encouraged.</p></div><div class=\"key-takeaways job-summary\"><h3>Key Points</h3><ul><li>Role: Senior 3D Visualisation Artist</li><li>Key Requirement: Strong portfolio and expertise in 3ds Max, V-Ray, and Adobe Suite.</li><li>Work Arrangement: Full-time, based in the Perth studio.</li><li>Company: Hames Sharley, a national multidisciplinary design firm.</li></ul></div>"
    },
    {
      "id": "north-atlantic-ocean-current-tipping-point",
      "category": "science-and-space-exploration",
      "title": "North Atlantic Ocean Current Is Behaving 'Unpredictably'",
      "excerpt": "Scientists warn that the North Atlantic subpolar gyre, a critical ocean current system, is losing stability and approaching a potentially catastrophic tipping point.",
      "bannerImage": "https://images.livemint.com/img/2023/02/09/1600x900/gulf_stream_large_1675924716182_1675924716382_1675924716382.jpg",
      "thumbnailImage": "https://www.sustainability-times.com/wp-content/uploads/2024/02/subpolar-gyre-atlantic.jpg",
      "author": "Sustainability Times",
      "date": "Oct 11, 2025",
      "readTime": "4 min",
      "sourceUrl": "https://www.sustainability-times.com/sustainable-business/the-oceans-heartbeat-is-faltering-this-north-atlantic-shift-could-trigger-violent-weather-and-upend-global-climate-and-its-already-starting/",
      "isTrending": false,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<div class=\"article-hero\"><img src=\"https://images.livemint.com/img/2023/02/09/1600x900/gulf_stream_large_1675924716182_1675924716382_1675924716382.jpg\" alt=\"A scientific visualisation of ocean currents in the North Atlantic, showing swirling patterns of warm and cold water.\" class=\"hero-image\"><div class=\"hero-caption\">The North Atlantic subpolar gyre plays a critical role in regulating the climate of the Northern Hemisphere.</div></div><h2>'The Ocean's Heartbeat Is Faltering': Key Atlantic Current Nears Tipping Point</h2><p class=\"lead-paragraph\">A massive system of rotating ocean currents in the North Atlantic is behaving erratically and may be approaching a critical tipping point, according to a new analysis. The North Atlantic subpolar gyre (SPG), a key component of the larger Atlantic Meridional Overturning Circulation (AMOC), has been losing stability since the 1950s, which could lead to its substantial weakening and trigger severe climate disruptions.</p><div class=\"article-columns\"><div class=\"content-column\"><h3>Clam Shells as Climate Archives</h3><p>Researchers analysed the shells of long-living clams, which act like 'tree rings of the ocean', to build a high-resolution picture of the SPG's behaviour over the past 150 years. The data revealed two periods of strong instability, with the most recent one ongoing. This 'critical slowing down' &mdash; where the system takes longer to recover from disturbances &mdash; is a known precursor to a tipping point.</p><div class=\"pullquote\"><p>\"It's highly worrying. The subpolar gyre was recently acknowledged as a tipping element. A subpolar gyre weakening can bring substantial climate impacts.\" <span class=\"attribution\">&mdash; Beatriz Arellano Nava, University of Exeter</span></p></div><p>The SPG helps transport heat from the tropics, regulating temperatures in Europe and North America. Its weakening or collapse, driven by factors like the melting of the Greenland ice sheet, could lead to more extreme weather events, particularly harsher winters in Europe, dramatic sea-level rise on the U.S. East coast, and shifts in global precipitation patterns.</p><h3>Global Implications</h3><p>While a collapse of the SPG would be less catastrophic than a full AMOC collapse, the climate outcomes would be similar, though potentially less intense. The weakening is being driven by an influx of freshwater from melting ice, which disrupts the density-driven circulation. Scientists are now working to deploy autonomous robotic floats to collect more data and refine predictions about how close this critical system is to its tipping point.</p></div></div><div class=\"key-takeaways magazine-style\"><h3>Key Takeaways</h3><ul class=\"takeaway-list\"><li><span class=\"takeaway-bullet\">&#10004;</span> The North Atlantic subpolar gyre (SPG), a major ocean current system, is showing signs of instability.</li><li><span class=\"takeaway-bullet\">&#10004;</span> Scientists warn it is approaching a critical tipping point, which could lead to abrupt weakening.</li><li><span class=\"takeaway-bullet\">&#10004;</span> Potential impacts include harsher winters in Europe and significant sea-level rise in North America.</li><li><span class=\"takeaway-bullet\">&#10004;</span> The instability is linked to global warming and the influx of freshwater from melting polar ice.</li></ul></div>"
    },
    {
      "id": "jwst-spots-hidden-red-supergiant",
      "category": "science-and-space-exploration",
      "title": "JWST Spots a Hidden Red Supergiant Just Before It Exploded",
      "excerpt": "The James Webb Space Telescope has uncovered a massive red supergiant star just before it went supernova, solving a long-standing cosmic mystery about these stellar giants.",
      "bannerImage": "https://news.northwestern.edu/assets/Images/2024/10/Supernova-main__ScaleWidthWzEwMDBd.jpg",
      "thumbnailImage": "https://cdn.mos.cms.futurecdn.net/pZkk4wDRpXeB2Y2vbjK3mE-1200-80.jpg",
      "author": "ScienceDaily",
      "date": "Oct 09, 2025",
      "readTime": "3 min",
      "sourceUrl": "https://www.sciencedaily.com/releases/2025/10/251009150508.htm",
      "isTrending": false,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<div class=\"article-hero\"><img src=\"https://news.northwestern.edu/assets/Images/2024/10/Supernova-main__ScaleWidthWzEwMDBd.jpg\" alt=\"A detailed image from the James Webb Space Telescope showing a bright red star within a distant galaxy before its explosion.\" class=\"hero-image\"><div class=\"hero-caption\">JWST's infrared view revealed the dust-shrouded red supergiant that other telescopes couldn't see.</div></div><h2>Webb Solves Mystery of the Missing Supernovae</h2><p class=\"lead-paragraph\">A team of astronomers has used the James Webb Space Telescope (JWST) to capture the clearest view ever of a massive red supergiant star right before it exploded, solving a major astrophysical puzzle. The discovery, published in The Astrophysical Journal Letters, suggests that many of these stellar explosions were not missing, but merely hidden from view behind thick clouds of dust.</p><div class=\"article-columns\"><div class=\"content-column\"><h3>Piercing the Cosmic Dust</h3><p>For decades, astronomers have been puzzled by the 'red supergiant problem'. Theoretical models predict that these enormous stars should be responsible for the majority of core-collapse supernovae, yet they were rarely observed exploding. This new research shows that these stars do explode, but they are often so heavily cloaked in dust that they are invisible to telescopes that observe in visible light.</p><div class=\"pullquote\"><p>\"It's the reddest, dustiest red supergiant that we've seen explode as a supernova.\" <span class=\"attribution\">&mdash; Aswin Suresh, Northwestern University</span></p></div><p>Using JWST's powerful mid-infrared instruments, the team identified the progenitor star of a supernova named SN 2025pht, which was detected on June 29, 2025. By analysing images of the area taken by Webb *before* the explosion, they pinpointed the source star. It was incredibly bright—about 100,000 times more luminous than our sun—but the thick dust veil made it appear over 100 times dimmer than it actually was.</p><h3>A New Era of Discovery</h3><p>This is the first time that JWST has been used to identify a supernova's source star, opening a new window into the final moments of massive stars. By being able to see through the cosmic dust, astronomers can now finally close the gap between theory and observation, gaining a more complete picture of how the most massive stars in the universe live and die.</p></div></div><div class=\"key-takeaways magazine-style\"><h3>Key Takeaways</h3><ul class=\"takeaway-list\"><li><span class=\"takeaway-bullet\">&#10004;</span> JWST has identified a massive red supergiant star just before it exploded as a supernova.</li><li><span class=\"takeaway-bullet\">&#10004;</span> The star was hidden behind a thick cloud of cosmic dust, which explains why such events are rarely seen.</li><li><span class=\"takeaway-bullet\">&#10004;</span> This finding helps solve the long-standing 'red supergiant problem' in astrophysics.</li><li><span class=\"takeaway-bullet\">&#10004;</span> Webb's infrared vision is crucial for observing these dust-shrouded stellar events.</li></ul></div>"
    }
  ],
  "videos": [
    {
      "id": "figure-03-humanoid-robot",
      "category": "artificial-intelligence-and-technology",
      "title": "FIGURE 03 is HERE: A Humanoid Robot That Changes EVERYTHING",
      "excerpt": "Figure AI has unveiled Figure 03, its third-generation humanoid robot designed to be a general-purpose partner in homes and factories, capable of performing a wide range of everyday chores autonomously.",
      "thumbnail": "https://img.youtube.com/vi/3ZtF_K-2J4o/maxresdefault.jpg",
      "videoUrl": "https://www.youtube.com/watch?v=3ZtF_K-2J4o",
      "channel": "Figure",
      "publishDate": "Oct 09, 2025",
      "duration": "4:22"
    },
    {
      "id": "icy-moon-ocean-life-jwst",
      "category": "science-and-space-exploration",
      "title": "Icy Moon Ocean Life? New Star Type by JWST? Plus Solar Rain",
      "excerpt": "New data from Saturn's icy moon Enceladus reveals complex organic molecules, strengthening the case for potential habitability in its hidden subsurface ocean.",
      "thumbnail": "https://img.youtube.com/vi/tjuhyuKLAEg/maxresdefault.jpg",
      "videoUrl": "https://www.youtube.com/watch?v=tjuhyuKLAEg",
      "channel": "Dr. Becky",
      "publishDate": "Oct 09, 2025",
      "duration": "18:03"
    }
  ],
  "makeWebhook": "",
  "authToken": ""
}
