 
{
  "categories": [
    {
      "id": "all",
      "name": "All",
      "active": true
    },
    {
      "id": "artificial-intelligence-and-technology",
      "name": "Artificial Intelligence and Technology",
      "active": false
    },
    {
      "id": "science-and-space-exploration",
      "name": "Science and Space Exploration",
      "active": false
    },
    {
      "id": "ancient-history-and-archaeology",
      "name": "Ancient History and Archaeology",
      "active": false
    },
    {
      "id": "digital-media-and-gaming",
      "name": "Digital Media and Gaming",
      "active": false
    },
    {
      "id": "anime-tv-series-news",
      "name": "Solo Leveling anime TV series news",
      "active": false
    },
    {
      "id": "perth-wa-jobs",
      "name": "Perth, Western Australia jobs",
      "active": false
    }
  ],
  "trending": [
    {
      "articleId": "unreal-engine-jobs-perth-oct-2025",
      "reason": "High demand for tech skills in the local job market."
    },
    {
      "articleId": "ai-news-updates-oct-17-2025",
      "reason": "Breaking developments in AI from major tech companies."
    },
    {
      "articleId": "egypt-largest-fortress-uncovered-oct-17-2025",
      "reason": "Significant archaeological finding with historical implications."
    }
  ],
  "articles": [
    {
      "id": "unreal-engine-jobs-perth-oct-2025",
      "category": "Perth, Western Australia jobs",
      "title": "Unreal Engine Jobs in All Perth WA - Oct 2025",
      "excerpt": "Find your ideal job at SEEK with Unreal Engine jobs found in All Perth WA. View all our Unreal Engine vacancies now with new jobs added daily!",
      "bannerImage": "data:image/svg+xml;utf8,<svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1200 800\" width=\"1200\" height=\"800\"><defs><linearGradient id=\"grad1\" x1=\"0%\" y1=\"0%\" x2=\"100%\" y2=\"100%\"><stop offset=\"0%\" style=\"stop-color:rgb(10,10,40);stop-opacity:1\" /><stop offset=\"100%\" style=\"stop-color:rgb(50,10,90);stop-opacity:1\" /></linearGradient></defs><rect width=\"100%\" height=\"100%\" fill=\"url(#grad1)\" /><text x=\"50%\" y=\"50%\" dominant-baseline=\"middle\" text-anchor=\"middle\" font-family=\"'Segoe UI', Roboto, sans-serif\" font-size=\"48\" fill=\"#FFFFFF\" font-weight=\"bold\">Unreal Engine Jobs</text><text x=\"50%\" y=\"58%\" dominant-baseline=\"middle\" text-anchor=\"middle\" font-family=\"'Segoe UI', Roboto, sans-serif\" font-size=\"24\" fill=\"#CCCCCC\">Perth, Western Australia</text></svg>",
      "thumbnailImage": "data:image/svg+xml;utf8,<svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 400 300\" width=\"400\" height=\"300\"><defs><linearGradient id=\"grad1\" x1=\"0%\" y1=\"0%\" x2=\"100%\" y2=\"100%\"><stop offset=\"0%\" style=\"stop-color:rgb(10,10,40);stop-opacity:1\" /><stop offset=\"100%\" style=\"stop-color:rgb(50,10,90);stop-opacity:1\" /></linearGradient></defs><rect width=\"100%\" height=\"100%\" fill=\"url(#grad1)\" /><text x=\"50%\" y=\"50%\" dominant-baseline=\"middle\" text-anchor=\"middle\" font-family=\"'Segoe UI', Roboto, sans-serif\" font-size=\"24\" fill=\"#FFFFFF\" font-weight=\"bold\">Unreal Engine Jobs</text><text x=\"50%\" y=\"60%\" dominant-baseline=\"middle\" text-anchor=\"middle\" font-family=\"'Segoe UI', Roboto, sans-serif\" font-size=\"14\" fill=\"#CCCCCC\">Perth, WA</text></svg>",
      "author": "SEEK",
      "date": "Oct 18, 2025",
      "readTime": "3 min",
      "sourceUrl": "https://www.seek.com.au/unreal-engine-jobs/in-All-Perth-WA",
      "isTrending": true,
      "isJob": true,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<div class=\"article-hero\"><div class=\"highlight-box info-box\"><h2>Role Overview</h2><p class=\"lead-paragraph\">We are seeking a skilled Unreal Engine Developer to join our team in Perth. You will be responsible for creating and optimising high-quality graphics, simulations, and gameplay using Unreal Engine. The ideal candidate will possess strong technical skills, creativity, and experience in game development, simulation or real-time 3D environments. This role involves programming, visual design, and optimisation to create immersive interactive experiences.</p></div><h3>Key Responsibilities</h3><ul><li>Design, implement, and maintain gameplay and systems code in Unreal Engine using C++.</li><li>Develop high-quality simulations and gameplay features.</li><li>Collaborate with artists and designers to achieve the artistic vision of projects.</li><li>Optimise graphical assets and performance across different platforms.</li><li>Write optimised, scalable, and well-documented code.</li><li>Debug and troubleshoot issues related to functionality and performance.</li><li>Identify and address any stability, performance, and security risks.</li></ul><h3>Required Qualifications</h3><ul><li>Bachelor's degree in Computer Science, Game Development, or a related field.</li><li>Proven professional experience with Unreal Engine, including advanced C++ and Blueprint scripting.</li><li>Strong understanding of object-oriented programming and software design patterns.</li><li>Knowledge of 3D graphics, physics, and animation.</li><li>Excellent problem-solving skills and attention to detail.</li><li>Ability to work collaboratively in a team environment.</li></ul><div class=\"highlight-box info-box\"><h3>Nice-to-Have Skills</h3><ul><li>Hands-on VR development experience (Meta/Quest preferred).</li><li>Familiarity with performance profiling and memory optimisation.</li><li>Solid version-control practice with Git.</li><li>Experience with multiplayer games or VR applications.</li></ul></div><h3>What We Offer</h3><p>This is an opportunity to be part of a pioneering team that is reshaping how essential industries train their workforce. You&rsquo;ll be instrumental in developing immersive, realistic VR simulations that improve safety, efficiency, and expertise across high-stakes environments. We offer a collaborative and dynamic work environment with opportunities for career development.</p><h3>Application Instructions</h3><p>To apply, please submit your resume and a portfolio showcasing completed Unreal Engine projects through the SEEK portal. An impressive portfolio is often crucial for this role.</p><div class=\"key-takeaways magazine-style\"><h3>Key Points</h3><ul><li>&#128205; <strong>Location:</strong> Perth, WA</li><li>&#128187; <strong>Core Skills:</strong> Unreal Engine, C++, 3D Graphics</li><li>&#127919; <strong>Focus:</strong> Developing high-quality simulations and interactive experiences.</li><li>&#127891; <strong>Qualifications:</strong> Degree in a related field and proven professional experience required.</li></ul></div></div>"
    },
    {
      "id": "ai-news-updates-oct-17-2025",
      "category": "Artificial Intelligence and Technology",
      "title": "AI News for the Week of Oct 17: Updates from Anthropic, Oracle & More",
      "excerpt": "A summary of the top headlines in artificial intelligence news from the past week, including vendor product news, mergers, and funding.",
      "bannerImage": "https://i.ibb.co/L5T1kVk/jose-p-ortiz-l-Ab-T-kn-Xj-I-unsplash.jpg",
      "thumbnailImage": "https://i.ibb.co/qg0D1v8/jose-p-ortiz-l-Ab-T-kn-Xj-I-unsplash-thumbnail.jpg",
      "author": "Solutions Review",
      "date": "Oct 17, 2025",
      "readTime": "3 min",
      "sourceUrl": "https://www.solutionsreview.com/business-process-management/artificial-intelligence-news-for-the-week-of-october-17-updates-from-anthropic-netapp-oracle-more/",
      "isTrending": true,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<div class=\"article-hero\"><img src=\"https://i.ibb.co/L5T1kVk/jose-p-ortiz-l-Ab-T-kn-Xj-I-unsplash.jpg\" alt=\"Abstract AI technology background\" class=\"hero-image\"/></div><p class=\"lead-paragraph\">The artificial intelligence sector saw a flurry of activity this week, with major vendors like Oracle and Anthropic announcing significant product updates and strategic partnerships. Key developments also centred on enterprise AI readiness, data infrastructure, and the ongoing race to automate complex workflows.</p><h2>Enterprise AI and Application Updates</h2><p>Oracle has advanced its enterprise AI capabilities by debuting a new set of AI agents within its Fusion applications portfolio. These agents are designed to deliver automated intelligence and streamline processes for ERP, HCM, and SCM customers. In a related development, a new report from Insightsoftware revealed that many finance teams are struggling with legacy systems, which hampers their readiness for AI adoption. The research highlighted how inefficiencies from manual processes limit real-time financial insights, urging organisations to modernise their data workflows.</p><blockquote class=\"expert-quote\"><p>&ldquo;While this highlights just how rapidly large language models are automating coding, human oversight remains essential for system reliability, debugging, and ethical quality control.&rdquo;</p><footer>- Daario Amod, CEO of Anthropic</footer></blockquote><h2>Data Readiness and Infrastructure</h2><p>A 2025 study from Qlik underscored a critical challenge in the industry: while AI budgets are surging, a lack of data readiness remains the primary barrier to scaling AI in the enterprise. Addressing the infrastructure side, NetApp and Red Hat announced a strengthened collaboration to drive IT modernisation with Red Hat OpenShift Virtualization. Meanwhile, Cisco AI research found that the most AI-ready companies are significantly outpacing their peers, emphasising the competitive advantage of a solid AI strategy.</p><h3>Partnerships and Funding</h3><p>Strategic collaborations continue to shape the AI landscape. Salesforce announced an expanded partnership with Anthropic to deliver trusted AI for regulated industries, making Anthropic the first large language model provider fully integrated within the Salesforce trust boundary. In funding news, AI-driven document intelligence firm Reducto closed a $75 million Series B round to accelerate its product development and market expansion.</p><div class=\"key-takeaways magazine-style\"><h3>Key Takeaways</h3><ul><li>&#128640; Oracle launched new AI agents for its Fusion applications to automate enterprise workflows.</li><li>&#128202; A Qlik study identified data readiness as the main obstacle to scaling enterprise AI, despite rising budgets.</li><li>&#128187; Anthropic's CEO revealed that its AI now writes 90% of the code at several leading tech companies.</li><li>&#127760; Salesforce deepened its partnership with Anthropic to provide trusted AI for regulated sectors.</li></ul></div>"
    },
    {
      "id": "egypt-largest-fortress-uncovered-oct-17-2025",
      "category": "Ancient History and Archaeology",
      "title": "Archaeologists Uncover One of Ancient Egypt’s Largest Forts",
      "excerpt": "Egyptian archaeologists have discovered a more than 3,000-year-old fortress that has been described as one of the country's “largest and most important”.",
      "bannerImage": "https://i.ibb.co/RScJz8w/roberto-shumski-SXt-Y-a-U-MRs-unsplash.jpg",
      "thumbnailImage": "https://i.ibb.co/hZ2vXbN/roberto-shumski-SXt-Y-a-U-MRs-unsplash-thumbnail.jpg",
      "author": "Art News",
      "date": "Oct 17, 2025",
      "readTime": "3 min",
      "sourceUrl": "https://www.artnews.com/art-news/news/archaeologists-uncover-one-of-ancient-egypts-largest-forts-1234730193/",
      "isTrending": true,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<div class=\"article-hero\"><img src=\"https://i.ibb.co/RScJz8w/roberto-shumski-SXt-Y-a-U-MRs-unsplash.jpg\" alt=\"Archaeological dig site in Egypt\" class=\"hero-image\"/></div><p class=\"lead-paragraph\">Archaeologists in Egypt have uncovered the foundations of a massive New Kingdom fortress at Tell El-Kharouba in North Sinai. The structure, dating back approximately 3,000 years, is among the largest defensive buildings ever found on Egypt's eastern border and was part of a critical military and trade route known as the &ldquo;Way of Horus&rdquo;.</p><h2>A Strategic Military Outpost</h2><p>The fortress, located near the modern town of Sheikh Zuweid, was part of a chain of forts built to secure the routes between Egypt and the Levant. Excavations revealed that the fortress covers about 8,000 square metres, which is three times larger than another fort previously discovered at the same site. Its location, Tell el-Habua, is associated with the ancient frontier town of Tjaru, the starting point of the Way of Horus. The route was protected by 11 fortresses which served as early alert points against invading armies.</p><div class=\"pullquote\"><p>&ldquo;The discovery is significant, as it reflects the details of the ancient Egyptian military history. It is a model example of ancient Egypt&rsquo;s military architecture.&rdquo;</p><footer>- Mohammed Abdel-Maqsoud, Archaeologist</footer></div><h3>Architectural and Historical Insights</h3><p>Archaeologists have excavated a southern wall measuring 105 metres long and defended by eleven towers, as well as portions of the western and northwestern walls. Inside, they found an internal wall dividing the structure and a quarter believed to have housed soldiers. Discoveries of pottery, storage vessels, and a large bread oven provide glimpses into the daily life of the garrison stationed there. One tower contained a foundation deposit from the early Eighteenth Dynasty, including a vessel stamped with the cartouche of King Thutmose I, further cementing its historical importance.</p><div class=\"highlight-box info-box\"><h3>The Way of Horus</h3><p>Illustrations on a wall at the Karnak Temple in Luxor depict the Way of Horus, a coastal road that once connected Egypt to Canaan. This route was known in the Book of Exodus as the &ldquo;way of the land of the Philistines&rdquo; (Exodus 13:17). Of the eleven fortresses believed to have been positioned along this road, five have now been excavated.</p></div><div class=\"key-takeaways magazine-style\"><h3>Key Takeaways</h3><ul><li>&#128205; A major New Kingdom fortress, one of the largest ever found, has been discovered at Tell El-Kharouba in North Sinai.</li><li>&#9935;&#65039; The fort was part of the &ldquo;Way of Horus,&rdquo; a strategic military route protecting Egypt&rsquo;s eastern border.</li><li>&#128737;&#65039; The structure covers 8,000 square metres and includes massive walls and eleven defensive towers.</li><li>&#129529; Artifacts found, including pottery and a vessel with a royal cartouche, offer insights into the daily life and timeline of the garrison.</li></ul></div>"
    },
    {
      "id": "ai-tech-news-roundup-mid-oct-2025",
      "category": "Artificial Intelligence and Technology",
      "title": "AI & Tech News Roundup: Mid-October 2025 Major Updates & Trends",
      "excerpt": "A roundup of the biggest AI and technology news of mid-October 2025, including new product launches, global conferences, and funding updates.",
      "bannerImage": "https://i.ibb.co/gZ7D9yW/possessed-photography-Jj-VLif-Y-a-Y-unsplash.jpg",
      "thumbnailImage": "https://i.ibb.co/mF939Vw/possessed-photography-Jj-VLif-Y-a-Y-unsplash-thumbnail.jpg",
      "author": "TST Technology",
      "date": "Oct 16, 2025",
      "readTime": "4 min",
      "sourceUrl": "https://www.tst.net/blog/ai-tech-news-roundup-mid-october-2025-major-updates-trends",
      "isTrending": true,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<div class=\"article-hero\"><img src=\"https://i.ibb.co/gZ7D9yW/possessed-photography-Jj-VLif-Y-a-Y-unsplash.jpg\" alt=\"Digital technology network background\" class=\"hero-image\"/></div><p class=\"lead-paragraph\">AI innovation is reshaping industries faster than ever, with a wave of new product launches, major partnerships, and global conferences dominating the mid-October 2025 news cycle. From breakthroughs in generative AI to fierce competition in chip manufacturing, the global technology landscape continues its rapid evolution as organisations race to adopt and leverage AI.</p><h2>Major Tool Releases and Market Moves</h2><p>Tech giants are fiercely competing to roll out powerful new AI tools. Meta is set to launch DevMate, an AI coding assistant that can scan entire codebases and suggest fixes, while Amazon introduced Quick Suite to provide agentic AI across its services. Google has launched Gemini Enterprise, bundling advanced models with tools for creating agents. These moves reflect a broader industry trend where AI is shifting from a simple assistant to a co-creator in software development. However, the push for AI has also contributed to workforce reshaping, with companies like Google, Microsoft, and Intel conducting layoffs in 2025 as they shift focus to AI-first talent and automation.</p><blockquote class=\"expert-quote\"><p>&ldquo;From Intel&rsquo;s AI chip struggles to OpenAI&rsquo;s expanding dominance, the AI industry in 2025 paints a picture of rapid innovation mixed with fierce competition.&rdquo;</p><footer>- TST Technology Report</footer></blockquote><h3>Global Conferences and Funding</h3><p>The global AI community is gearing up for several key events, including the 2nd Global Research Conference and Expo on Robotics &amp; Artificial Intelligence (GRCRAI2025) in London from November 10-12, 2025. These conferences highlight cutting-edge advancements and facilitate collaboration. On the investment front, startups continue to attract significant capital, with Resistant AI recently raising $25 million in a Series B funding round to further its development.</p><h2>Emerging Trends and Partnerships</h2><p>A key trend is the increasing autonomy of AI agents, which are now capable of handling complex tasks with less human intervention. Strategic partnerships are also crucial, such as the collaboration between IBM and Anthropic, which aims to advance enterprise software development by combining powerful AI models with robust security and governance tools. In the hardware sector, a major AMD-OpenAI partnership is expected to reshape the market, while Intel has faced challenges in meeting revenue expectations for its AI chips.</p><div class=\"key-takeaways magazine-style\"><h3>Key Takeaways</h3><ul><li>&#128187; Major tech companies like Meta, Amazon, and Google are releasing advanced AI development tools and enterprise solutions.</li><li>&#128202; The global demand for AI and software talent continues to increase, even as some tech giants restructure their workforces.</li><li>&#127760; Upcoming global conferences like GRCRAI2025 are set to showcase the latest innovations in robotics and AI.</li><li>&#128640; High-stakes partnerships, such as those between AMD-OpenAI and IBM-Anthropic, are redefining competition in the AI market.</li></ul></div>"
    },
    {
      "id": "ai-on-the-horizon-oct-16-2025",
      "category": "Artificial Intelligence and Technology",
      "title": "AI on the Horizon: October 16, 2025",
      "excerpt": "An examination of the potential of AI and Robotics, and where Canada's economy stands to benefit from the growing use of AI in the physical world.",
      "bannerImage": "https://i.ibb.co/3WfK9C2/maximalfocus-m-Y-ft-CR7-D8-unsplash.jpg",
      "thumbnailImage": "https://i.ibb.co/v3DGrXh/maximalfocus-m-Y-ft-CR7-D8-unsplash-thumbnail.jpg",
      "author": "The Conference Board of Canada",
      "date": "Oct 16, 2025",
      "readTime": "3 min",
      "sourceUrl": "https://www.conferenceboard.ca/insights/economics/ai-on-the-horizon-october-16-2025/",
      "isTrending": true,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<div class=\"article-hero\"><img src=\"https://i.ibb.co/3WfK9C2/maximalfocus-m-Y-ft-CR7-D8-unsplash.jpg\" alt=\"Robotic arm working in a factory setting\" class=\"hero-image\"/></div><p class=\"lead-paragraph\">A new analysis from The Conference Board of Canada examines the growing role of artificial intelligence in the physical world and its potential impact on the Canadian economy. While AI adoption has seen considerable growth, the deployment of robotics continues to lag, presenting both a challenge and an opportunity for the nation's productivity, particularly in goods-producing and transportation sectors.</p><h2>Canada's AI and Robotics Landscape</h2><p>According to Statistics Canada, AI adoption in the country has more than doubled in the past year, rising from 6.1 to 12.2 per cent. In 2025, 6 per cent of businesses had deployed hardware that uses AI. However, the adoption of robotics specifically was reported at just 2 per cent in 2023. Robotics experts suggest that increased federal support for &lsquo;physical AI&rsquo; could help improve Canada&rsquo;s slow rate of robot deployment in the economy.</p><div class=\"highlight-box info-box\"><h3>Public Perception vs. Economic Reality</h3><p>Despite evidence supporting that investment in robotics can lead to an increase in total employment, Canadians remain strongly distrustful of both AI and robotics technologies. This perception gap presents a hurdle for broader economic integration and realising productivity gains.</p></div><h3>Pioneering Canadian Firms</h3><p>Several Canadian firms are at the forefront of fusing AI and robotics to address modern challenges. Sanctuary AI is developing AI-powered androids to perform menial tasks, while companies like Indro Robotics and Clearpath Robotics are creating bespoke solutions for specific industry applications. Another innovator, Promise Robotics, aims to revolutionise the homebuilding process by using robotic arms to fabricate housing materials directly from blueprint specifications.</p><blockquote class=\"expert-quote\"><p>&ldquo;Our own reporting suggests that AI and Robotics have the most potential to boost Canada&rsquo;s productivity among automation tools, particularly in goods-producing and transportation sectors.&rdquo;</p><footer>- The Conference Board of Canada</footer></blockquote><div class=\"key-takeaways magazine-style\"><h3>Key Takeaways</h3><ul><li>&#128187; AI adoption in Canada has doubled in the last year, but robotics deployment remains low at 2 per cent.</li><li>&#127760; Experts believe federal support could significantly improve Canada's integration of 'physical AI' into the economy.</li><li>&#129302; Canadian companies like Sanctuary AI and Promise Robotics are leading innovation in AI-powered robotics for various industries.</li><li>&#128202; The Conference Board of Canada identifies AI and robotics as having the highest potential to boost the nation's productivity.</li></ul></div>"
    },
    {
      "id": "apple-nbcuniversal-bundle-oct-16-2025",
      "category": "Digital Media and Gaming",
      "title": "Apple and NBCUniversal Introduce the Apple TV and Peacock Bundle",
      "excerpt": "Apple and NBCUniversal today announced the launch of the Apple TV and Peacock Bundle, available beginning October 20.",
      "bannerImage": "https://i.ibb.co/L519V1J/card-mapr-box-l-h-T-Zg-KPas-A-unsplash.jpg",
      "thumbnailImage": "https://i.ibb.co/Jqj3B2M/card-mapr-box-l-h-T-Zg-KPas-A-unsplash-thumbnail.jpg",
      "author": "Business Wire",
      "date": "Oct 16, 2025",
      "readTime": "3 min",
      "sourceUrl": "https://www.businesswire.com/news/home/20251016254641/en/Apple-and-NBCUniversal-Introduce-the-Apple-TV-and-Peacock-Bundle",
      "isTrending": false,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<div class=\"article-hero\"><img src=\"https://i.ibb.co/L519V1J/card-mapr-box-l-h-T-Zg-KPas-A-unsplash.jpg\" alt=\"TV screen showing streaming service logos\" class=\"hero-image\"/></div><p class=\"lead-paragraph\">Apple and NBCUniversal have announced a new partnership to launch a bundled subscription for their streaming services, Apple TV and Peacock. The first-of-its-kind bundle will be available to customers in the United States beginning October 20, offering content from both platforms through one monthly subscription at a significant discount.</p><h2>Subscription Tiers and Savings</h2><p>The new bundle will be offered in two tiers, providing subscribers with a saving of over 30 per cent compared to individual subscriptions. The first tier combines Apple TV and Peacock Premium for $14.99 per month. The second tier includes Apple TV and the ad-free Peacock Premium Plus for $19.99 per month. This partnership marks the first major bundling effort for Apple TV, which recently rebranded by dropping the &lsquo;+&rsquo; from its name.</p><blockquote class=\"expert-quote\"><p>&ldquo;We&rsquo;re thrilled to introduce this all-inclusive bundle of incredible programming and to bring Apple TV&rsquo;s beloved shows and movies to more viewers in more places.&rdquo;</p><footer>- Oliver Schusser, Apple's VP of Apple TV, Apple Music, Sports, and Beats</footer></blockquote><h3>Special Offer for Apple One Subscribers</h3><p>In a unique benefit, subscribers of Apple One Family and Premier plans will be able to add Peacock Premium Plus to their existing bundle at a special 35 per cent discount. This is the first time an external benefit of this kind has been offered to Apple One members. The collaboration also includes a cross-promotional sampling program, allowing users of each service to watch up to three episodes of select shows from the partner service for free.</p><div class=\"highlight-box info-box\"><h3>Content Highlights</h3><p>The bundle combines the platforms' complementary content portfolios, including Apple TV originals like &ldquo;Ted Lasso&rdquo; and &ldquo;Severance,&rdquo; alongside Peacock&rsquo;s extensive catalogue featuring shows like &ldquo;The Traitors,&rdquo; the &ldquo;Law & Order&rdquo; franchise, and live sports such as NBA games.</p></div><div class=\"key-takeaways magazine-style\"><h3>Key Takeaways</h3><ul><li>&#128250; Apple and NBCUniversal are launching a bundled subscription for Apple TV and Peacock starting October 20.</li><li>&#128178; The bundle offers over 30% savings, priced at $14.99/month for Peacock Premium and $19.99/month for Premium Plus.</li><li>&#11088; Apple One subscribers will receive a special 35% discount when adding Peacock Premium Plus.</li><li>&#128241; Each service will feature free samples of the other's content to encourage discovery.</li></ul></div>"
    },
    {
      "id": "solo-leveling-frieren-collaboration-oct-16-2025",
      "category": "Solo Leveling anime TV series news",
      "title": "October 23 Will Be a Big Day for Solo Leveling and Frieren Fans",
      "excerpt": "On October 23, 2025, Frieren and Solo Leveling will join hands with a collaboration tied to Solo Leveling's video game, Solo Leveling: Arise.",
      "bannerImage": "https://i.ibb.co/3sH3WvD/aiony-haust-dfst-D2-B3-S4-A-unsplash.jpg",
      "thumbnailImage": "https://i.ibb.co/N1tFwB8/aiony-haust-dfst-D2-B3-S4-A-unsplash-thumbnail.jpg",
      "author": "GameRant",
      "date": "Oct 16, 2025",
      "readTime": "3 min",
      "sourceUrl": "https://gamerant.com/solo-leveling-frieren-beyond-journeys-end-collaboration-october-23/",
      "isTrending": false,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<div class=\"article-hero\"><img src=\"https://i.ibb.co/3sH3WvD/aiony-haust-dfst-D2-B3-S4-A-unsplash.jpg\" alt=\"Stylized image of two anime characters\" class=\"hero-image\"/></div><p class=\"lead-paragraph\">Two of modern anime's most popular fantasy series, Solo Leveling and Frieren: Beyond Journey's End, are set for an official crossover event. The collaboration will take place within the mobile action RPG Solo Leveling: Arise and is scheduled to begin on October 23, 2025. The event will introduce characters from the world of Frieren into the game.</p><h2>A Fusion of Contrasting Worlds</h2><p>The crossover marks a rare fusion of two distinct storytelling styles. Solo Leveling is known for its fast-paced action and the power progression of its hero, Sung Jinwoo. In contrast, Frieren: Beyond Journey's End offers a slower, more reflective narrative that explores themes of magic, time, and mortality through its elven mage protagonist. The collaboration will bring the two contrasting philosophies of fantasy together by integrating Frieren's serene magic with Jinwoo's shadow powers in an action-heavy gameplay environment.</p><div class=\"side-image-left\"><img src=\"https://i.ibb.co/N1tFwB8/aiony-haust-dfst-D2-B3-S4-A-unsplash-thumbnail.jpg\" alt=\"Close up on an anime character\" class=\"content-image\"/><p>Fans are anticipating playable versions of Frieren, Fern, and Stark, who will be reimagined within Solo Leveling's combat system. A short trailer showcased an image of Sung Jinwoo and Frieren standing side by side, teasing the upcoming adventure. This collaboration may also provide the only new Frieren-related content for the remainder of 2025, as the manga has recently gone on an indefinite hiatus.</p></div><h3>Bridging Fandoms</h3><p>The event is seen as more than just a marketing initiative; it represents a creative experiment that bridges two major fandoms that have previously had a competitive relationship. For Solo Leveling: Arise, partnering with the award-winning Frieren series adds narrative depth and prestige. Simultaneously, the collaboration exposes the world of Frieren to Solo Leveling's massive global fanbase. The union of the two properties is being viewed as a positive example of bringing different communities together.</p><div class=\"key-takeaways magazine-style\"><h3>Key Takeaways</h3><ul><li>&#127918; A crossover event between Solo Leveling: Arise and Frieren: Beyond Journey's End will begin on October 23.</li><li>&#128126; The collaboration will feature playable characters from Frieren, including Frieren, Fern, and Stark.</li><li>&#127754; The event merges the fast-paced action of Solo Leveling with the reflective fantasy world of Frieren.</li><li>&#129309; The crossover is seen as a positive move to unite the two large and distinct fan communities.</li></ul></div>"
    },
    {
      "id": "rediscovery-of-shafts-giza-pyramids-oct-14-2025",
      "category": "Ancient History and Archaeology",
      "title": "Rediscovery of Three Shafts May Lead to Underworld Beneath Giza Pyramids",
      "excerpt": "Three precisely engineered shafts have been rediscovered that may unlock access to a vast underground network whispered about by ancient Greek historians.",
      "bannerImage": "https://i.ibb.co/m0f0zKq/get-lost-mike-h-G-a-Dgo-Gg-Ag-unsplash.jpg",
      "thumbnailImage": "https://i.ibb.co/hK8bwnv/get-lost-mike-h-G-a-Dgo-Gg-Ag-unsplash-thumbnail.jpg",
      "author": "Ancient Origins",
      "date": "Oct 14, 2025",
      "readTime": "4 min",
      "sourceUrl": "https://www.ancient-origins.net/news-history-archaeology/giza-pyramids-shafts-0021699",
      "isTrending": false,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<div class=\"article-hero\"><img src=\"https://i.ibb.co/m0f0zKq/get-lost-mike-h-G-a-Dgo-Gg-Ag-unsplash.jpg\" alt=\"The Great Pyramids of Giza\" class=\"hero-image\"/></div><p class=\"lead-paragraph\">Three mysterious and precisely engineered vertical shafts have been rediscovered beneath the sands of the Giza Plateau, potentially offering access to a vast underground network. The passages are located in the triangle formed by the Great Sphinx, Khufu's Pyramid, and Khafre's Pyramid and descend over 40 metres into the bedrock. Their smooth walls and precise geometry challenge conventional explanations about their origin and purpose.</p><h2>The Labyrinth of Herodotus</h2><p>The discovery may provide the first physical evidence of a massive labyrinth described by the ancient Greek historian Herodotus. He wrote of a complex in Egypt containing 3,000 chambers, many of which were hidden underground. For centuries, scholars debated whether this account was fact or fiction, but these rediscovered shafts, combined with advanced scanning technologies revealing anomalies beneath the plateau, suggest Herodotus may have been describing a real and colossal structure. A vast network of underground chambers and tunnels has long been rumoured to exist beneath the pyramids.</p><div class=\"pullquote\"><p>&ldquo;As Above, so Below. That which is Below corresponds to that which is Above, and that which is Above corresponds to that which is Below, to accomplish the Miracle of the One Thing.&rdquo;</p><footer>- Ancient Hermetic Saying</footer></div><h3>A History of Underground Exploration</h3><p>Historical records show that explorers in the 1800s documented strange wells near the Sphinx. Prominent scholars like George Reisner and Selim Hassan also traced a line of cavities between the Sphinx and Khafre's Pyramid between 1929 and 1939, after which the area was largely forgotten. More recently, the exploration of what is now officially called the &ldquo;Osiris Shaft&rdquo; has required negotiating access with Egyptian authorities and using modern pumps to remove water from its lower levels.</p><h2>Purpose of the Shafts</h2><p>The exact purpose of these vertical passages remains a topic of debate among researchers. One of the most mysterious features of the Great Pyramid itself are the so-called &ldquo;air shafts,&rdquo; which were once thought to be for ventilation. However, the discovery of small, finely finished limestone &ldquo;doors&rdquo; at the top of these shafts suggests a more symbolic purpose. It is now widely believed these shafts were intended to allow the king's soul to travel to the stars, a concept supported by ancient Egyptian religious texts like the Pyramid Texts.</p><div class=\"key-takeaways magazine-style\"><h3>Key Takeaways</h3><ul><li>&#128205; Three deep, precisely engineered shafts have been rediscovered on the Giza Plateau.</li><li>&#128367;&#65039; The discovery could provide evidence for the legendary underground labyrinth described by Herodotus.</li><li>&#129529; Explorers have documented underground cavities at Giza since the 1800s, with recent efforts focusing on the &ldquo;Osiris Shaft&rdquo;.</li><li>&#11088; The purpose of such shafts is believed to be religious, allowing the pharaoh's soul to ascend to the afterlife.</li></ul></div>"
    },
    {
      "id": "mystery-object-million-suns-oct-12-2025",
      "category": "Science and Space Exploration",
      "title": "A million-sun-mass mystery object found lurking in deep space",
      "excerpt": "Scientists have detected the universe's lowest-mass dark object by observing how it warped light through gravitational lensing.",
      "bannerImage": "https://i.ibb.co/L5hY5Xb/guillermo-ferla-t-U3-A-A9-Jg-D-k-unsplash.jpg",
      "thumbnailImage": "https://i.ibb.co/3sN6tTj/guillermo-ferla-t-U3-A-A9-Jg-D-k-unsplash-thumbnail.jpg",
      "author": "ScienceDaily",
      "date": "Oct 12, 2025",
      "readTime": "3 min",
      "sourceUrl": "https://www.sciencedaily.com/releases/2025/10/251012133230.htm",
      "isTrending": false,
      "isJob": false,
      "isVideo": false,
      "videoUrl": "",
      "fullContent": "<div class=\"article-hero\"><img src=\"https://i.ibb.co/L5hY5Xb/guillermo-ferla-t-U3-A-A9-Jg-D-k-unsplash.jpg\" alt=\"A deep space nebula\" class=\"hero-image\"/></div><p class=\"lead-paragraph\">Scientists using a global array of radio telescopes have detected the universe&rsquo;s lowest-mass dark object by observing how it warped light through a phenomenon known as gravitational lensing. The invisible mass, weighing approximately one million times as much as the Sun, could be a small clump of dark matter or a dormant dwarf galaxy. The finding represents a significant achievement in uncovering the hidden objects that shape the cosmos.</p><h2>Detecting the Invisible</h2><p>Because the object emits no detectable light or radiation, astronomers could not see it directly. Instead, they identified it by observing how its immense gravity bent and distorted the light from a much more distant galaxy, creating warped, arc-shaped images. The object&rsquo;s presence appeared as a tiny &ldquo;pinch&rdquo; in the distorted image created by a much larger gravitational lens. By measuring the distortion, researchers were able to calculate the mass of the unseen object.</p><blockquote class=\"expert-quote\"><p>&ldquo;It&rsquo;s an impressive achievement to detect such a low mass object at such a large distance from us. Finding low-mass objects such as this one is critical for learning about the nature of dark matter.&rdquo;</p><footer>- Chris Fassnacht, Professor, University of California, Davis</footer></blockquote><h3>Implications for Dark Matter Theory</h3><p>The mysterious object is about 100 times smaller than any previously detected dark mass found using gravitational lensing, making it a record-breaking discovery. Its existence provides strong support for cold dark matter models, which are fundamental to our current understanding of how galaxies form and how visible matter is arranged throughout the universe. One of the major questions in astronomy is whether dark matter can form such small, starless clumps, and this discovery provides a crucial piece of evidence.</p><div class=\"side-image-right\"><img src=\"https://i.ibb.co/3sN6tTj/guillermo-ferla-t-U3-A-A9-Jg-D-k-unsplash-thumbnail.jpg\" alt=\"Close-up view of stars and galaxies\" class=\"content-image\"/><p>To capture the faint signals required for this discovery, the team combined data from multiple radio observatories across the globe. This included the Green Bank Telescope in West Virginia and the Very Long Baseline Array in New Mexico, which together achieved the high-resolution observing power needed to spot the subtle lensing effect.</p></div><div class=\"key-takeaways magazine-style\"><h3>Key Takeaways</h3><ul><li>&#127756; An invisible object with the mass of one million suns was detected using gravitational lensing.</li><li>&#10067; The object's identity is unknown; it could be a dense clump of dark matter or a dormant dwarf galaxy.</li><li>&#128202; This discovery is the lowest-mass object ever found via gravitational lensing, 100 times smaller than the previous record holder.</li><li>&#127752; The finding supports the cold dark matter theory, which helps explain how galaxies are formed and structured.</li></ul></div>"
    }
  ],
  "videos": [],
  "makeWebhook": "",
  "authToken": ""
}
