{"categories":[{"id":"all","name":"All","active":true},{"id":"science-and-space-exploration","name":"Space","active":false},{"id":"artificial-intelligence-and-technology","name":"AI & Tech","active":false},{"id":"ancient-history-and-archaeology","name":"Archaeology","active":false},{"id":"digital-media-and-gaming","name":"Gaming","active":false}],"trending":[{"articleId":"hidden-doomed-star-jwst","reason":"Resolves a decades-old astrophysical mystery about supernova progenitors."},{"articleId":"dayforce-microsoft-ai-agents","reason":"Significant partnership integrating AI into core business HR and payroll functions."}],"articles":[{"id":"hidden-doomed-star-jwst","category":"science-and-space-exploration","title":"Hidden 'Doomed' Star Revealed by James Webb Telescope","excerpt":"The James Webb Space Telescope (JWST) has revealed a hidden 'doomed' star, solving a long-standing astrophysical mystery about why so few red supergiants are seen exploding.","bannerImage":"https://cdn.mos.cms.futurecdn.net/pZ5M2a4s5i7gjvt3j2nZ9k-1200-80.jpg","thumbnailImage":"https://cdn.mos.cms.futurecdn.net/E4y5i5yC8a8B5Z7Y4R9bA9-480-80.jpg","author":"Live Science","date":"Oct 13, 2025","readTime":"3 min","sourceUrl":"https://www.livescience.com/archaeology/hidden-doomed-star-revealed-by-james-webb-space-telescope-could-solve-decades-old-mystery","isTrending":true,"isJob":false,"isVideo":false,"videoUrl":"","fullContent":"<div class=\"article-hero\"><img src=\"https://cdn.mos.cms.futurecdn.net/pZ5M2a4s5i7gjvt3j2nZ9k-1200-80.jpg\" alt=\"An image of spiral galaxy NGC 1637 with the massive red supergiant marked in a box.\" class=\"hero-image\"><div class=\"hero-caption\">The new JWST observation shows the massive red supergiant just before it exploded. (Image credit: NASA, ESA, CSA, STScI, Charles Kilpatrick, Aswin Suresh)</div></div><h2>Webb Telescope Solves Decades-Old Supernova Mystery</h2><p class=\"lead-paragraph\">The James Webb Space Telescope (JWST) has revealed a hidden 'doomed' star that could help solve a giant astrophysical mystery. The star, a massive red supergiant, was imaged just before it exploded, providing evidence that resolves a long-standing puzzle about why these types of stars are rarely observed as the source of supernovae, despite theories predicting they should be common.</p><div class=\"article-columns\"><div class=\"content-column\"><h3>An Obscured Giant</h3><p>For decades, astronomers have been perplexed by the apparent lack of red supergiant progenitors in supernova observations. The latest JWST findings, published in The Astrophysical Journal Letters, suggest these enormous stars are often obscured by thick cocoons of dust, making them invisible to most telescopes. This dust is particularly effective at blocking shorter, blue wavelengths of light. JWST's powerful infrared sensors were able to pierce through this dusty veil, providing an unprecedentedly detailed look at a supergiant on the brink of detonation.</p></div></div><div class=\"pullquote\"><p>\"For multiple decades, we have been trying to determine exactly what the explosions of red supergiant stars look like. Only now, with JWST, do we finally have the quality of data and infrared observations that allow us to say precisely the exact type of red supergiant that exploded.\"<span class=\"attribution\">&mdash; Charlie Kilpatrick, Northwestern University</span></p></div><h3>Data and Discovery</h3><div class=\"stats-grid\"><div class=\"stat-box\"><span class=\"stat-number\">100,000x</span><span class=\"stat-label\">Brighter than our Sun</span></div><div class=\"stat-box\"><span class=\"stat-number\">100x</span><span class=\"stat-label\">Dimmed by Dust</span></div><div class=\"stat-box\"><span class=\"stat-number\">38M</span><span class=\"stat-label\">Light-Years Away</span></div></div><p>The supernova, named SN 2025pht, originated in the galaxy NGC 1637, located 38 million light-years from Earth. By comparing historical Hubble data with new JWST images, researchers identified the progenitor star. Although the star shone about 100,000 times brighter than our sun, the team estimated its surrounding dust was so thick that it dimmed the star's visible light by more than 100 times. Co-author Aswin Suresh, a graduate student at Northwestern, described it as \"the reddest, dustiest red supergiant that we've seen explode as a supernova.\"</p><div class=\"key-takeaways magazine-style\"><h3>Key Takeaways</h3><ul class=\"takeaway-list\"><li><span class=\"takeaway-bullet\">&#10004;</span> JWST has identified a massive red supergiant star just before it exploded, solving a long-standing cosmic mystery.</li><li><span class=\"takeaway-bullet\">&#10004;</span> The finding suggests many red supergiants are hidden behind thick veils of dust, explaining why they are rarely seen as supernova progenitors.</li><li><span class=\"takeaway-bullet\">&#10004;</span> The star was 100,000 times brighter than the sun, but its light was dimmed over 100 times by the surrounding dust.</li><li><span class=\"takeaway-bullet\">&#10004;</span> This is the first time JWST has been used to identify a supernova progenitor star, opening a new avenue for studying the final stages of massive stars.</li></ul></div>"},{"id":"dayforce-microsoft-ai-agents","category":"artificial-intelligence-and-technology","title":"Dayforce Boosts HR & Payroll With Microsoft AI Agents","excerpt":"Dayforce announced an expanded collaboration with Microsoft to integrate custom AI Agents into business workflows, aiming to unify human resources, payroll, and operations.","bannerImage":"https://channellife.com.au/uploads/story/2025/10/12/Dayforce_Microsoft_AI_partnership_iStock-1464426573_1.jpg","thumbnailImage":"https://channellife.com.au/uploads/story/2025/10/12/Dayforce_Microsoft_AI_partnership_iStock-1464426573_1.jpg?w=400&h=300&fit=crop","author":"ChannelLife Australia","date":"Oct 13, 2025","readTime":"3 min","sourceUrl":"https://channellife.com.au/story/dayforce-boosts-hr-payroll-efficiency-with-microsoft-ai-agents","isTrending":true,"isJob":false,"isVideo":false,"videoUrl":"","fullContent":"<div class=\"article-hero\"><img src=\"https://channellife.com.au/uploads/story/2025/10/12/Dayforce_Microsoft_AI_partnership_iStock-1464426573_1.jpg\" alt=\"Abstract futuristic image representing AI in a business context\" class=\"hero-image\"></div><h2>Dayforce Integrates Microsoft AI to Unify HR and Payroll</h2><p class=\"lead-paragraph\">Dayforce has expanded its collaboration with Microsoft to embed custom Dayforce AI Agents into everyday business workflows, targeting human resources, payroll, and operations. The integration uses Microsoft Copilot Studio to bring personalised AI agents directly into the Dayforce platform, aiming to unite fragmented HR, payroll, and IT processes into a single, cohesive experience.</p><div class=\"article-columns\"><div class=\"content-column\"><h3>Streamlining Complex Workflows</h3><p>Many organisations struggle with HR and payroll software existing in silos, which leads to fragmented workflows and manual processes. This initiative intends to solve that by building a unified application entirely on Microsoft technologies, including Azure, Power BI, and Microsoft Teams. The new AI agents will have secure access to workforce data, such as employee details and payroll insights, allowing them to automate repetitive tasks and provide decision support to managers within their familiar working environments.</p></div></div><blockquote class=\"expert-quote\"><p>\"By harnessing the full power of the Microsoft technology stack, Dayforce is redefining how organisations unlock value from their technology investments &mdash; freeing employees to focus on the work they're truly meant to do.\"<span class=\"source-attribution\">&mdash; Joe Korngiebel, Chief Strategy, Product, and Technology Officer, Dayforce</span></p></blockquote><h3>Broader Impact on Business Operations</h3><p>The collaboration allows organisations to fully extend and customise workflows using AI agents built and deployed through Dayforce APIs and Microsoft Copilot Studio. This approach is designed to reduce the need for multiple add-on modules and complex integrations, simplifying deployment and maintenance. By bringing contextual, actionable AI directly into the flow of work, the partnership aims to improve efficiency, empower leaders to automate with confidence, and enhance the overall employee experience.</p><div class=\"key-takeaways magazine-style\"><h3>Key Takeaways</h3><ul class=\"takeaway-list\"><li><span class=\"takeaway-bullet\">&#10004;</span> Dayforce is integrating Microsoft Copilot Studio to embed custom AI agents into its HR and payroll platform.</li><li><span class=\"takeaway-bullet\">&#10004;</span> The goal is to unify fragmented HR, payroll, and IT systems into a single, seamless user experience.</li><li><span class=\"takeaway-bullet\">&#10004;</span> AI agents will automate repetitive tasks, provide decision support, and operate within existing tools like Microsoft Teams.</li><li><span class=\"takeaway-bullet\">&#10004;</span> The platform is built entirely on Microsoft technologies, promising greater interoperability and return on investment for customers.</li></ul></div>"},{"id":"quantum-teleportation-supercomputers","category":"science-and-space-exploration","title":"Scientists Achieve Teleportation With Quantum Supercomputers","excerpt":"In a significant breakthrough, scientists have successfully achieved quantum teleportation, not of matter, but of data between two quantum computers, paving the way for distributed quantum computing.","bannerImage":"https://bgr.com/wp-content/uploads/2023/02/bgr-quantum-computer-computer-chip.jpg?quality=82&strip=all","thumbnailImage":"https://bgr.com/wp-content/uploads/2023/02/bgr-quantum-computer-computer-chip.jpg?quality=82&strip=all&w=400&h=300&crop=1","author":"BGR","date":"Oct 11, 2025","readTime":"2 min","sourceUrl":"https://www.bgr.com/tech/scientists-achieved-teleportation-using-quantum-supercomputers-heres-how/","isTrending":false,"isJob":false,"isVideo":false,"videoUrl":"","fullContent":"<div class=\"article-hero\"><img src=\"https://bgr.com/wp-content/uploads/2023/02/bgr-quantum-computer-computer-chip.jpg?quality=82&strip=all\" alt=\"A close-up of a quantum computing chip with intricate wiring.\" class=\"hero-image\"></div><h2>Quantum Teleportation of Data Achieved Between Supercomputers</h2><p class=\"lead-paragraph\">Scientists have officially achieved quantum teleportation, though it does not involve moving objects or people as depicted in science fiction. Instead, the breakthrough involves the instantaneous sharing of quantum information between two separate quantum computers through a process known as quantum entanglement, effectively allowing them to function as a single, more powerful supercomputer.</p><div class=\"article-columns\"><div class=\"content-column\"><h3>How It Works</h3><p>The achievement, detailed in a report in Nature, describes how a team from the University of Oxford wirelessly sent a quantum algorithm from one processor to another. This was accomplished via quantum entanglement, a phenomenon where two particles remain connected, or 'entangled', even when separated by distance. In this case, the qubits &mdash; the basic units of quantum information &mdash; of the two computers were entangled. This allowed the computers to share data instantaneously and pool their resources, without any matter physically moving between them.</p><div class=\"inline-image-right\"><img src=\"https://images.thebrighterside.news/wp-content/uploads/2025/10/oxford-physicists-achieve-teleportation-between-two-quantum-supercomputers-1280x720.jpg\" alt=\"Researchers working on the distributed quantum computer at Oxford University.\" class=\"content-image\"><p class=\"image-caption\">Dougal Main and Beth Nichol working on the distributed quantum computer. (Credit: John Cairns / Oxford University)</p></div><p>This process of 'quantum gate teleportation' across a network link is a first, and it addresses the significant challenge of scalability in quantum computing. Rather than building one enormous, fragile quantum processor, this method allows smaller, modular units to be linked together.</p></div></div><div class=\"pullquote\"><p>\"This breakthrough enables us to effectively 'wire together' distinct quantum processors into a single, fully-connected quantum computer.\"<span class=\"attribution\">&mdash; Dougal Main, University of Oxford</span></p></div><h3>The Future of Computing</h3><p>This success is a crucial step towards distributed quantum computing, where multiple remote quantum processors can be combined into a unified, exponentially more powerful system. This concept is analogous to a quantum version of cloud computing. The ultimate goal is to create a 'quantum internet', an ultra-secure network for communication, computation, and sensing by linking many processors together.</p><div class=\"key-takeaways magazine-style\"><h3>Key Takeaways</h3><ul class=\"takeaway-list\"><li><span class=\"takeaway-bullet\">&#10004;</span> Scientists have successfully 'teleported' quantum data, not matter, between two separate quantum computers.</li><li><span class=\"takeaway-bullet\">&#10004;</span> The process uses quantum entanglement to link the processors, allowing them to act as one supercomputer.</li><li><span class=\"takeaway-bullet\">&#10004;</span> This is the first demonstration of teleporting logical gates, the fundamental components of a quantum algorithm.</li><li><span class=\"takeaway-bullet\">&#10004;</span> The breakthrough is a major step towards scalable, distributed quantum computing and a future 'quantum internet'.</li></ul></div>"},{"id":"jwst-spots-red-supergiant-before-explosion","category":"science-and-space-exploration","title":"JWST Spots a Hidden Red Supergiant Just Before It Exploded","excerpt":"The James Webb Space Telescope has captured the clearest-ever view of a massive red supergiant star just before it exploded, solving a long-standing cosmic mystery.","bannerImage":"https://www.sciencedaily.com/images/2025/10/251009150532_1_540x360.jpg","thumbnailImage":"https://www.sciencedaily.com/images/2025/10/251009150532_1_540x360.jpg","author":"ScienceDaily","date":"Oct 09, 2025","readTime":"3 min","sourceUrl":"https://www.sciencedaily.com/releases/2025/10/251009150532.htm","isTrending":false,"isJob":false,"isVideo":false,"videoUrl":"","fullContent":"<div class=\"article-hero\"><img src=\"https://www.sciencedaily.com/images/2025/10/251009150532_1_540x360.jpg\" alt=\"A combined Webb and Hubble view of spiral galaxy NGC 1637, with the region of interest in the top right.\" class=\"hero-image\"><div class=\"hero-caption\">A detailed view of a red supergiant star before and after it exploded. Credit: NASA, ESA, CSA, STScI, Charles Kilpatrick (Northwestern), Aswin Suresh (Northwestern)</div></div><h2>Webb Captures Doomed Star, Solving Cosmic Puzzle</h2><p class=\"lead-paragraph\">A team of astronomers has captured the most detailed view ever of a dying star just before its dramatic explosion, using NASA's James Webb Space Telescope (JWST). The observation identified the source of a supernova in mid-infrared light for the first time, revealing it to be a massive red supergiant star enveloped in a thick blanket of dust. This discovery may finally solve the cosmic mystery of why red supergiants, predicted by models to be common sources of supernovae, are so rarely seen exploding.</p><div class=\"article-columns\"><div class=\"content-column\"><h3>Piercing the Dust Veil</h3><p>The research, published in The Astrophysical Journal Letters, suggests that many of these enormous stars do explode but are often hidden from view by dense dust clouds. Optical telescopes are unable to see through this dust, but JWST's powerful infrared vision can penetrate the obscuring material. The supernova, named SN2025pht, was first detected on June 29, 2025, in the nearby spiral galaxy NGC 1637. By comparing pre- and post-explosion images from both Hubble and JWST, the team pinpointed the progenitor star, which was both brilliant and intensely red.</p></div></div><blockquote class=\"expert-quote\"><p>\"SN2025pht is surprising because it appeared much redder than almost any other red supergiant we've seen explode as a supernova. That tells us that previous explosions might have been much more luminous than we thought because we didn't have the same quality of infrared data that JWST can now provide.\"<span class=\"source-attribution\">&mdash; Charlie Kilpatrick, Northwestern University</span></p></blockquote><h3>A New Era for Stellar Discoveries</h3><p>This study marks the first time JWST has been used to confirm a supernova's progenitor star, opening a new frontier for astronomical discoveries. Although the star radiated about 100,000 times more light than the Sun, its glow was significantly hidden by the surrounding dust. This new capability to observe previously hidden stellar events will allow scientists to better bridge the long-standing gap between supernova theory and direct observation, fundamentally changing how past observations are interpreted.</p><div class=\"key-takeaways magazine-style\"><h3>Key Takeaways</h3><ul class=\"takeaway-list\"><li><span class=\"takeaway-bullet\">&#10004;</span> JWST captured the most detailed image ever of a red supergiant star right before it went supernova.</li><li><span class=\"takeaway-bullet\">&#10004;</span> The discovery helps solve the mystery of why red supergiants are rarely seen exploding; they are often hidden by dust.</li><li><span class=\"takeaway-bullet\">&#10004;</span> The star was incredibly luminous but appeared very red and dim due to a thick, surrounding dust cloud.</li><li><span class=\"takeaway-bullet\">&#10004;</span> This is the first confirmed detection of a supernova progenitor by JWST, heralding a new era of research into the death of massive stars.</li></ul></div>"},{"id":"new-discoveries-at-lystra","category":"ancient-history-and-archaeology","title":"New Archaeological Discoveries at Ancient City of Lystra","excerpt":"Ongoing excavations at the ancient city of Lystra in Anatolia are uncovering a large basilica, providing new physical evidence for early Christian communities in the region.","bannerImage":"https://arkeonews.net/wp-content/uploads/2025/10/Lystra-kazisi-arkeonews-1-1.jpg","thumbnailImage":"https://arkeonews.net/wp-content/uploads/2025/10/Lystra-kazisi-arkeonews-1-1-400x300.jpg","author":"ArkeoNews","date":"Oct 08, 2025","readTime":"3 min","sourceUrl":"https://arkeonews.net/new-archaeological-discoveries-at-lystra-the-sacred-anatolian-city-cited-eight-times-in-the-bible/","isTrending":false,"isJob":false,"isVideo":false,"videoUrl":"","fullContent":"<div class=\"article-hero\"><img src=\"https://arkeonews.net/wp-content/uploads/2025/10/Lystra-kazisi-arkeonews-1-1.jpg\" alt=\"Archaeological excavation site at Lystra with stone walls visible in the ground.\" class=\"hero-image\"></div><h2>Discoveries at Biblical City of Lystra Rewrite Early Christian History</h2><p class=\"lead-paragraph\">Excavations at the ancient city of Lystra, located in modern-day Turkey, are emerging as a cornerstone in understanding how Christianity took root in Asia Minor. The site, known from the Acts of the Apostles as a key location visited by St. Paul, is now yielding significant discoveries, including what is believed to be the main church of the ancient city, a 30-metre-long basilica.</p><div class=\"article-columns\"><div class=\"content-column\"><h3>A Biblical City Rediscovered</h3><p>Founded as a Roman colony under Emperor Augustus, Lystra gained fame when St. Paul and Barnabas visited during their first-century missionary journeys. The city is mentioned eight times in the Bible, and the account of Paul healing a crippled man there is considered a foundational miracle of Christianity. For centuries, the city's exact location and physical remains were subjects of speculation, but recent work is providing tangible evidence of its past. The newly discovered basilica provides material proof for the early and organised Christian communities in central Anatolia.</p></div></div><blockquote class=\"expert-quote\"><p>\"Lystra was visited by St. Paul on three of his four journeys. It became one of the earliest Christian centers in Anatolia, and later a bishopric in the Byzantine period.\"<span class=\"source-attribution\">&mdash; Assoc. Prof. İlker Mete Mimiroğlu, Necmettin Erbakan University</span></p></blockquote><h3>Cultural Coexistence</h3><p>One of the most remarkable aspects of the excavation is the discovery of Seljuk-era artefacts from the 12th-13th centuries within the layers of Christian ruins. Finds include Seljuk coins and turquoise-coloured beads in children's graves, which are seen as early forms of the 'nazar boncuğu' or evil-eye bead. According to the excavation leader, this points to a remarkable cultural coexistence during the Seljuk period, suggesting the local Christian population continued their lives under Seljuk rule in an atmosphere of tolerance, rather than being displaced.</p><div class=\"key-takeaways magazine-style\"><h3>Key Takeaways</h3><ul class=\"takeaway-list\"><li><span class=\"takeaway-bullet\">&#10004;</span> Excavations in the ancient city of Lystra, mentioned eight times in the Bible, have uncovered a large basilica.</li><li><span class=\"takeaway-bullet\">&#10004;</span> This discovery provides new physical evidence for the presence of organised Christian communities in first-century Anatolia.</li><li><span class=\"takeaway-bullet\">&#10004;</span> Lystra was a key site visited by St. Paul during his missionary journeys.</li><li><span class=\"takeaway-bullet\">&#10004;</span> The site also reveals evidence of cultural coexistence between Christians and Seljuk Turks in later centuries.</li></ul></div>"},{"id":"solo-leveling-arise-overdrive-trailer","category":"digital-media-and-gaming","title":"Solo Leveling Trailer Showcases 6 Minutes of Action","excerpt":"New footage for Solo Leveling: Arise Overdrive unveils co-op gameplay and new moves for protagonist Sung Jinwoo ahead of its upcoming November release.","bannerImage":"https://static1.cbrimages.com/wordpress/wp-content/uploads/2025/10/solo-leveling-arise-overdrive-trailer.jpg","thumbnailImage":"https://static1.cbrimages.com/wordpress/wp-content/uploads/2025/10/solo-leveling-arise-overdrive-trailer-400x300.jpg","author":"CBR","date":"Oct 08, 2025","readTime":"2 min","sourceUrl":"https://www.cbr.com/solo-leveling-arise-overdrive-trailer-release-date/","isTrending":false,"isJob":false,"isVideo":false,"videoUrl":"","fullContent":"<div class=\"article-hero\"><img src=\"https://static1.cbrimages.com/wordpress/wp-content/uploads/2025/10/solo-leveling-arise-overdrive-trailer.jpg\" alt=\"Sung Jinwoo in an action pose from Solo Leveling: Arise Overdrive.\" class=\"hero-image\"></div><h2>New Solo Leveling: Arise Trailer Reveals Co-op Gameplay</h2><p class=\"lead-paragraph\">A new, action-packed six-minute trailer for the upcoming game Solo Leveling: Arise Overdrive has been released, showcasing co-op gameplay and new abilities for the main character, Sung Jinwoo. The footage provides the most in-depth look yet at the game ahead of its scheduled November release.</p><div class=\"article-columns\"><div class=\"content-column\"><h3>Gameplay and New Features</h3><p>The trailer highlights several new features, including a cooperative gameplay mode where players can team up to tackle challenges. It also demonstrates a range of new moves and combat skills for Sung Jinwoo, displaying the fluid and fast-paced action players can expect. The visuals emphasise the game's faithful adaptation of the popular webtoon's art style, bringing its iconic battles to life.</p><div class=\"inline-image-right\"><img src=\"https://static1.cbrimages.com/wordpress/wp-content/uploads/2024/04/solo-leveling-arise-sung-jinwoo.jpg\" alt=\"Sung Jinwoo facing off against enemies in Solo Leveling: Arise.\" class=\"content-image\"><p class=\"image-caption\">The game aims to capture the high-octane combat of the original webtoon.</p></div><p>Fans of the series will recognise many of the scenarios and enemies depicted in the trailer, which promises a comprehensive experience covering key arcs of the story. The introduction of co-op is a significant addition, allowing players to experience the world of Solo Leveling with friends.</p></div></div><h3>Anticipation for November Release</h3><p>The extensive footage has heightened anticipation for the game's launch. The trailer serves as a final major preview, confirming the November release window and giving players a clear understanding of the gameplay mechanics, including the newly revealed cooperative elements and enhanced combat system. The game aims to be the definitive interactive experience for fans of the massive multimedia franchise.</p><div class=\"key-takeaways magazine-style\"><h3>Key Takeaways</h3><ul class=\"takeaway-list\"><li><span class=\"takeaway-bullet\">&#10004;</span> A new six-minute trailer for Solo Leveling: Arise Overdrive has been released.</li><li><span class=\"takeaway-bullet\">&#10004;</span> The footage reveals a new co-op gameplay mode for the first time.</li><li><span class=\"takeaway-bullet\">&#10004;</span> It showcases new combat moves and abilities for the protagonist, Sung Jinwoo.</li><li><span class=\"takeaway-bullet\">&#10004;</span> The game is confirmed for a November release.</li></ul></div>"}],"videos":[{"id":"new-discovery-egyptian-pyramids","category":"ancient-history-and-archaeology","title":"The NEW Discovery About Egyptian Pyramids as Earthquake Generators","excerpt":"This video gives you a balanced, easy-to-follow guide to the Great Pyramid power plant concept.","thumbnail":"https://img.youtube.com/vi/O-R-g-IeA-c/maxresdefault.jpg","videoUrl":"https://www.youtube.com/watch?v=O-R-g-IeA-c","channel":"The Infographics Show","publishDate":"Oct 09, 2025","duration":"49:33"},{"id":"secrets-of-the-pyramids","category":"science-and-space-exploration","title":"Secrets of the Pyramids That Still Can't Be Explained","excerpt":"Explore the enduring mysteries of the Great Pyramid of Giza, a timeless testament to ancient Egypt and the brilliance of its architects.","thumbnail":"https://img.youtube.com/vi/9bZkp7q19f0/maxresdefault.jpg","videoUrl":"https://www.youtube.com/watch?v=9bZkp7q19f0","channel":"UNIVERSE INSIDE YOU","publishDate":"Oct 07, 2025","duration":"1:00:11"}],"makeWebhook":"","authToken":""}